{
  "Chapter 1: Taming Beasts with Blood": "<p>“Jade pagodas excavated from an ancient tomb in Miaojiang, don’t miss it!” A tanned, middle-aged man dressed in traditional Miao clothing shouted in front of a bus stop, but he was largely ignored by the crowd.</p> <p>“How much?” Yang Ling had wanted to ignore him, but he saw that the so-called “jade pagodas” were rather exquisite. He involuntarily thought about getting it for his nephew, who had been pestering him for new toys.</p> <p>“It’s not expensive, 280 dollars, it can bless you and your family with good health and smooth careers…”</p> <p>“Five dollars!” Yang Ling loosened the knot on his tie, interrupting the swindler. “Take it or leave it!”</p> <p>Yang Ling had just found his first job since his graduation, and he did not know when his first paycheck would arrive. He was a true member of the “moonlight clan”. Perhaps from tomorrow onward, he would resign himself to five dollar meals from a fast food stand by the road. If he could not afford that, he’d have to eat plain buns with water.</p> <p>…</p> <p>After a bit of haggling, Yang Ling bought the jade pagoda for 10 dollars, but he convinced the man to give him a canvas bag priced at eight dollars for free. He had a relaxed look, while the man from the Miao tribe grumbled. He had not been able to sell these jade pagodas for a few years now, and even garbage collectors found them too heavy to take. He had no choice but to sell them at a very low price.</p> <p>It was the time of evening when everyone was getting off work, and the bus was like a can of sardines. The bus arrived a little late, so even the ladies did not mind squeezing in with the sweaty, smelly men to get home a little earlier.</p> <p>The person in front of Yang Ling was a petite lady wearing a black suit. She had light makeup on, and her lashes were thin and long, but from his angle, he saw that the lashes had been trimmed. Of course, he could also steal glances at her cleavage. It was hot, and the ladies were not wearing much.</p> <p>Some time later, Yang Ling felt the jade pagoda in his hands become hotter. Coincidentally, the tip of the pagoda was resting right on the perky buttocks of the lady in front of him. He did not feel anything at first, but quickly, the suited lady in front of him felt that something was off.</p> <p>With the movement of the bus, the suited lady felt a wave of heat hit her buttocks, as if there was a hard stick propped against her. To make things worse, even after she stepped an inch forward, that stick followed her. It was also becoming hotter. That feeling was like…</p> <p>She turned back to glare at Yang Ling, but saw that he was pretending to be ignorant. The suited lady was as ashamed as she was furious, her face red. She wanted to reprimand Yang Ling, but she didn’t know where to start. She could not put up with this anymore, but she had no space to move away. The thing on her back was becoming hotter and hotter. Her heart began to beat faster as she became more and more ashamed.</p> <p>What if it flows out?</p> <p>The suited lady was uneasy. She felt as though the thing that was prodding her was going to tear the sanitary pad she just put on before she got off work. She was only wearing a thin skirt today. If she bled through the pad, it would definitely leave a large stain. She would be so ashamed.</p> <p>Shame, anxiety, fear, anger, helplessness…</p> <p>The suited lady felt many emotions. Even though the next stop was her destination, she felt that time was dragging by too slowly. The so-called “luxury air-conditioned bus” was moving slower than a snail. The boiling stick behind her made her think about a donkey, an exceptionally large, mutated donkey.</p> <p>“Miss, are you alright?” Yang Ling noticed that the suited lady’s face was red, and that she was frequently looking back at him. He thought that she could not find a handle to grab on and was uncomfortable from squeezing in with the people on board. He said kindly, “If you are feeling uncomfortable, you can come to the back, and I’ll try standing in front of you!”</p> <p>Try standing in front of me?</p> <p>The suited lady nearly fainted. This man is shameless! He’s been rubbing against me throughout the journey, and now he’s saying that he wants to try standing in front of me! How far are perverts on buses willing to go these days?</p> <p>“Ummm…”</p> <p>The bus took a sudden turn, instantly tilting to the left. Under the inertia, the people on the bus leaned into one another. The suited lady felt the thing behind her pierce inward like a shovel against the sponge-like sanitary pad. Blood seeped out.</p> <p>“You pervert. Despicable, shameless, lecherous pervert!” The suited lady felt the thing become hotter and hotter, and she couldn’t stand it anymore. She wanted to whip out a pair of scissors and turn the despicable Yang Ling into a twenty-first century eunuch.</p> <p>Despicable, shameless, lecherous pervert?</p> <p>After the lady’s shouting, even the driver of the bus turned to look out of curiosity, nearly running down a jaywalking old lady.</p> <p>I’m a pervert?</p> <p>Looking at the teary lady, then looking at the jade pagoda that was coincidentally propped against her butt, Yang Ling shook his head. He had just wanted to buy a toy, but now, it had created such a huge spectacle.</p> <p>“Miss, are you talking about this steaming big guy?” Yang Ling lifted the unusually hot jade pagoda under the scrutiny of everyone in the bus.</p> <p>Steaming big guy?</p> <p>After witnessing Yang Ling bring up the jade pagoda from behind the suited woman’s buttocks, the people on the bus understood and broke into laughter. As for the furious suited lady, her face became redder than liver. All she wanted to do was dig a hole for herself to hide in. She jumped off the bus the moment she reached her stop.</p> <p>After successfully clearing his name, Yang Ling was incredibly curious about the hot jade pagoda. He meticulously inspected it on his second-hand computer desk the moment he got home.</p> <p>The jade pagoda was black. Even though it was only the length of a chopstick, it was carved with various images. There were images of Miao people crawling on the ground in prayer, and some were raising their hands and shouting. There were also ferocious wild beasts, including several golden dragons, each one of them lifelike.</p> <p>Other than that, there were streaks of red on the tip of the pagoda, and they smelled like blood. He recalled the ashamed lady and her short skirt, which had been stained with traces of blood. Yang Ling more or less got the idea. His heart shook when he thought about her perky buttocks and her cleavage.</p> <p>Yang Ling curiously ran a cleaver over the jade pagoda, then looked incredulously at it after seeing that there were no scratches.</p> <p>“Tsk tsk, this pagoda is harder than a cleaver. What kind of jade is this made of?” As he was distracted, he accidentally cut his right index finger with the cleaver.</p> <p>“What did that shyster say about blessing me with good health? D*mn, how unlucky!”</p> <p>Yang Ling shook his head as he prepared to set the jade pagoda to the side. Unexpectedly, when he touched the jade pagoda with his bloodied right hand, the pagoda released a radiant light. It was absorbing the blood in his body through his wound, and it was stuck to his right hand as if super glued. Even weirder, a violent tornado appeared out of thin air.</p> <p>As he was pulled up into the air, Yang Ling realized in fear that his limbs were rigid. His entire body was numb. Following which, he felt a massive headache and quickly lost consciousness. The landlord who had coincidentally walked past Yang Ling’s house was dumbfounded as he saw a black hole swallow Yang Ling, but not the other things in the house. He passed out in the corridor.</p> <p>In his daze, Yang Ling dreamed a weird dream. He dreamed of an ancient worshipper wandering in a primordial forest. The worshipper had a weird pagoda-shaped brand between his brows.</p> <p>Whenever the worshipper came across a ferocious beast, he would bite the skin of his finger and drip a drop of his blood on the creature to tame it. After that, he could tame the beasts using mere gestures. The gestures became faster and faster, each more mysterious than the last. In the end, he could even control the weather, becoming as powerful as the deities in legends.</p> <p>Some time later, Yang Ling felt a chill as he slowly opened his eyes.</p> <p>There were several clouds in the blue sky. A clear stream meandered through a network of tall trees beside him, and he could hear the cries of frogs nearby. Clearly, this was not the lousy park that demanded a two dollar entry fee near his apartment. It was also not the small hill behind the apartment used for rearing chickens.</p> <p>Yang Ling rubbed his eyes in disbelief as he surveyed the tall trees around him. Even though there were pine trees all around the mountains in his old house, he had never seen pine trees as tall as these. The trunks of these trees were about the size of a truck. He doubted that ten people holding hands would be enough to fully encircle the tree. The roots exposed on the ground were woven like spider webs, each root thicker than his waist.</p> <p>“The primordial forest from Xishuangbanna?” Yang Ling understood that this was not an illusion, nor was it a dream. He pinched his thigh to check.</p> <p>Collecting himself, Yang Ling shook his head and walked cautiously to the clear stream. He had just wanted to wash his face when he suddenly trembled. He saw that a pagoda-shaped mark had appeared between his brows, identical to the one on the worshipper in his dream. After he observed it carefully, he found a faint indication of blood on the tip of the pagoda, as if this pagoda was the one he bought at a discount from the Miao man, the same one that nearly got him labelled as a pervert. This one was just considerably smaller.</p> <p>Am I seeing things?</p> <p>Yang Ling was dumbfounded. He did not understand where the mark of the pagoda had come from, nor did he know how the black-hole-like tornado could have brought him here. He had the faint feeling that everything was due to the so-called jade pagoda excavated from a ten thousand year old Miaojiang tomb.</p> <p>As he could not make sense of anything, Yang Ling opted to wash his face with the clear water of the stream first. After he energized himself, he heard a faint roar. At the same time, he caught the faint scent of blood. He made his way over in curiosity. His scalp crawled immediately when he saw a cluster of thumb-sized mutated bees attacking a rhino-like beast. The bees were taking bites at the giant beast, each bite ripping away chunks of flesh.</p> <p>In immense pain, the rhino manically charged in all directions. It uprooted several tall trees like a bulldozer, but it was unable to flee from the terrifying bees.</p> <p>There was a sharp black horn on the head of every bee. Every time a bee charged downward, the horn was like a blade, gouging a hole in the flesh of the rhino. After that, it would bite down with its sharp teeth and rip off a chunk of flesh. The pain would make the rhino bellow loudly.</p> <p>Without anywhere else to go, the rhino charged straight for the cluster of shrubs Yang Ling was hiding in. Just as he was worried about getting trampled to mush by the rampaging rhino, the bulldozer-like beast thumped onto the ground. It no longer had the strength to get up.</p> <p>Looking over, every hair on Yang Ling’s body stood on end. He saw the bees devour the meat on the rhino’s front legs, leaving behind a large chunk of exposed bone.</p> <p>Yang Ling witnessed a more harrowing scene soon after. The cluster of bees pierced deeply into the body of the rhino and crunching sounds could be heard. Soon after, the massive rhino was picked clean. There was only a puddle of blood left where the rhino was.</p> <p>African man-eating bees?</p> <p>In his shock, Yang Ling sprawled on the ground and slowly retreated backward. He was cautious, fearful that he would catch the attention of the bees. He had retreated several meters and had just started to stand so he could run away when he heard a light snap. He had carelessly broken a thumb-sized branch.</p> <p>“Not good!” Yang Ling was alarmed. He saw a scout bee fly toward him, its sharp teeth clearly visible.</p> <p>Am I going to die here?</p> <p>Yang Ling was suddenly covered in a cold sweat. Even the powerful rhino with thick skin and muscles could not fend off the bees, much less me. I can’t beat it, nor can I run from it. What can I do?</p> <p>At this critical moment, Yang Ling suddenly recalled the actions of the mysterious worshipper in his dreams. He bit on his index finger and pressed it on the head of the bee that was charging over. At that moment, a silver glow escaped the yellow bee. The silver glow formed mysterious symbols, then the bee obediently landed on his arm.</p> <p>Even though it was only a drop of his blood, Yang Ling felt as though the blood in his body had been emptied. He was drained, his head dizzy. At the same time, he felt a wave of heat enter his body. He felt the pagoda-shaped mark between his brows burn. Following which, a foreign memory appeared in his mind.</p> <p>In his daze, Yang Ling felt as though he had arrived at a mysterious space. In front of a tall pagoda, the mutated bee was flying through the air happily. It flew over to Yang Ling excitedly when it saw him.</p> <p>There were two ancient words, Wizard’s Pagoda, carved onto the door of the giant pagoda. The body of the pagoda was filled with various pictures. Some were images of mysterious sacrifices, some fierce beasts, each one of them lifelike. This was especially so for the golden dragons carved near the top of the pagoda. They were incredibly realistic. In fact, one could faintly hear their lightning-like roars.</p> <p>Out of curiosity, Yang Ling lightly pushed on the door of the jade pagoda. Behind him, the tamed bee excitedly followed him in. There was a billowing fog behind the door. He could faintly make out a human-sized stele. There were ancient Chinese characters carved on the stele.</p> <p>“With the primal powers of the Wizard’s Pagoda, absorb the blessings of heaven and earth and grab the essences of the sun and moon…” Yang Ling tried his best to decipher the ancient text on the stele. “With the primal wizarding powers, let blood essences guide you and train your soul…”</p> <p>A long time ago, in order to chase after a belle from the Chinese department, Yang Ling had memorized countless ancient poems. The side effect of that was that he now recognized several ancient Chinese characters. To think that it would prove useful here.</p> <p>There was a passage explaining the text on the bottom, followed by a mysterious mantra. Finally there was an inscription of people in weird poses. Looking over, Yang Ling felt a sense of familiarity, as if these poses were similar to the ones used by the worshipper in his dreams when he was taming beasts.</p> <p>After looking at the stele for some time, Yang Ling more or less got the idea of what was happening. The stele was a record of a mysterious wizarding spell. The spell was split into seven levels, Blood Wizard, Spirit Wizard, Earth Wizard, Heaven Wizard, Divine Wizard, Soul Wizard, and Wizard Deity, respectively. The deeper your wizarding powers, the faster you could tame wild beasts. You could also tame wild beasts of greater numbers and strength. After practice, you could not only tame wild beasts, you could also use their powers and purify their spirits. You could even manipulate the weather just like the worshipper in the dream.</p> <p>After thinking for a moment, Yang Ling realized that he had unintentionally become a beginner Blood Wizard when he got his hands on the Wizard’s Pagoda. Even though he was still a great distance away from the Wizard Deity, he had indeed stepped past the hurdle to practicing wizardry. In so doing, he had not only averted a crisis, he had also used his blood to tame a mutated bee.</p>",
  "Chapter 2: Blood Essence of Magical Beasts": "<p>After repeating the mysterious mantra and actions to himself, Yang Ling felt a wave of giddiness. Slowly, his consciousness wavered.</p> <p>Some time later, Yang Ling opened his eyes to realize that the bee on his arm had disappeared. He recalled the mysterious Wizard’s Pagoda and had an idea. He instinctively repeated the mantra. Suddenly, the tamed yellow bee appeared within his field of vision out of thin air.</p> <p>Observing closely, Yang Ling noticed that the tamed bee had grown considerably. Before, it had only been the size of a thumb, but now, it had grown to be as thick as the handle of a sword. Two fangs had grown on both sides of its mouth, reflecting a cold light. The black horn on the top of its head also seemed sharper and exceptionally frightening. It looked like it had benefited much from the mysterious Wizard’s Pagoda.</p> <p>After the surprise, Yang Ling thought seriously about the foreign memory that appeared in his mind. He saw a grain-sized bee emerging from its cocoon, then the memory transitioned into a mature bee flying freely in the forest…</p> <p>It looks like I’ve not only tamed the bee in front of me, I’ve also gained its memories.</p> <p>The bee he had tamed was a low level Magical Beast called the Horned Bee Beast. Through its memories, Yang Ling found out that he had arrived at a place called the Terras Forest which spanned ten thousand miles. There were not many humans here, and Magical Beasts roamed this land. There might be many powerful entities deep within the forest, as even the Horned Bee Beast before him did not dare enter.</p> <p>Crossing through space-time?</p> <p>Yang Ling let out a bitter laugh after he realized that he had been brought to this foreign world for reasons unknown. He had never expected that he would have to deal with such an unthinkable situation one day.</p> <p>Live on. Only by stubbornly living on in this world where the strong preyed on the weak could he find a way home!</p> <p>After the initial shock, Yang Ling slowly calmed down. There were no televisions here, nor was there the internet, but there were countless terrifying Magical Beasts. If he wanted to return to the world he was familiar with, he had to find a way to survive. If he gave up on himself, he might end up in the belly of some Magical Beast in the blink of an eye, much less return home.</p> <p>A foreign world, a vast primordial forest, terrifying Magical Beasts, also the mysterious Wizard’s Pagoda and mantra…</p> <p>Yang Ling stroked the sharp black horn of the Horned Bee Beast. He was worried, but he was also excited. Perhaps this foreign continent would give him larger surprises.</p> <p>After experimenting a little, he quickly discovered the technique of controlling the Horned Bee Beast. After he practiced the technique, he was able to make the tamed Horned Bee Beast follow his commands. His control over the bee was the same as the control he had over his fingers. At the same time, whatever the Horned Bee Beast saw or thought would quickly enter his mind. That feeling was strange, yet wonderful, as if he was equipped with a 3D camera.</p> <p>The teeth of the Horned Bee Beast were incredibly sharp. They could shatter even solid rock with a bite, much less the bones of a wild beast. The bee had many sources of food, from decomposing corpses, to white ants, to even the steel-like minerals on the ground.</p> <p>After witnessing the fate of the rhino, Yang Ling had wanted to stay far away from the Horned Bee Beasts. But ever since the Horned Bee Beast he tamed bit a wild rabbit to death and gave him a food source without him doing anything, he started to have a bold idea. Even though the Horned Bee Beast was terrifying, it was an excellent assistant after it had been tamed.</p> <p>This forest was mysterious, or should he say that the wild beasts here were insane.</p> <p>Sometimes, an innocent looking wild rabbit could spew a ball of fire out of its mouth. Sometimes, a fish in the water could expel an arrow made of water, sharper than any Swiss army knife and more powerful than an ox. Without enough power, Yang Ling understood that there was no way he could make his way out of this foreign, mysterious primordial forest.</p> <p>With the guidance of the tamed Horned Bee Beast, Yang Ling carefully made his way to the nest of the Horned Bee Beasts. He hid in a nearby bush, motionless, in search of any Horned Bee Beasts that had strayed from the group.</p> <p>The nest of the Horned Bee Beasts was constructed on a granite wall covered with weeds. The wall was littered with thigh-sized holes. From afar, it looked like a giant beehive.</p> <p>Groups of Horned Bee Beasts entered and exited the nest continually, some carrying the meat of a wild beast, some carrying thumb-sized sticks. There were even several bees working together, dragging a still-twitching wild rabbit into the nest. Other than that, there were a number of larger Horned Bee Beasts flying around, patrolling the nest.</p> <p>Not far away, a group of Horned Bee Beasts were slamming into a giant pine tree. After circling the tree twice, the bees would descend upon the tree, piercing into its bark with their sharp horns. They would immediately rise back into the air, then rain down once again, completing the cycle. Every time they collided with the tree, the large tree would let out a thump, as if the bees were forcefully hitting a wall.</p> <p>Just as Yang Ling was feeling perplexed, an opening finally appeared in the trunk of the tree following the collision of the many Horned Bee Beasts. After which, white ants the size of chopsticks scuttled out of the opening, some of them following the trunk upward, the rest falling like rain onto the ground.</p> <p>After letting out excited cries, the Horned Bee Beasts welled forward, swallowing the soft white ants in gulps. Quickly, the stomachs of the Horned Bee Beasts swelled like balloons. Soon after, there were no more white ants left.</p> <p>Yang Ling waited patiently. He saw a full grown Horned Bee Beast lazily flying around. With a thought, he commanded the tamed Horned Bee Beast to fly outward to attract his prey over to him.</p> <p>After the tamed Horned Bee Beast collided with it, the lazy wild Horned Bee Beast was agitated. It manically chased after the tamed beast. Just as it was flying over a bush, a drop of blood suddenly fell onto its head. Instantly, silver light glowed around it as mysterious symbols appeared.</p> <p>After he succeeded, Yang Ling retreated carefully with his two Horned Bee Beasts. His wizarding abilities were not strong, and he could only tame one Horned Bee Beast at a time. If the large group of wild Horned Bee Beasts noticed his actions, then his life would be forfeit.</p> <p>Cautiously, Yang Ling retreated far away. Unexpectedly, he had just thought about lying down and resting when the Horned Bee Beast beside him suddenly raised its tail nervously. This was followed by the ghostly howl of a wolf not far away. Nervously, he carefully crept over, only to see a giant wolf, the size of a young cow, grappling with a black and white python.</p> <p>The wild wolf was black, and its rows of sharp teeth reflected cold light. Yang Ling had no doubt that it could smash his thigh bone with a mere bite. The python was even more terrifying. It was as thick as a water pail. It flicked its tongue quickly, its lantern-like eyes staring straight at the wild wolf.</p> <p>After a couple seconds of the motionless standoff, the hungry-looking wild wolf took the offensive. It let out a howl before spewing a ball of dark red fire from its mouth. The coiled up python was unwilling to display weakness. It extinguished the flames with an arrow of water, then struck toward the wolf.</p> <p>A wild wolf that could spew fire, a python that could spew water? Yang Ling was dumbfounded as he rubbed his eyes. He suspected that this was a dream.</p> <p>Just as Yang Ling was dazed, the wild wolf took a bite at the python. The python wrapped tightly around the calf-sized wolf. The two parties howled incessantly, each releasing every ounce of their strength.</p> <p>After a frightening battle, the spine of the wild wolf was shattered. Its pupils dilated, its strength waning as it struggled; the python was not in a good state either. It had traces of blood all over its body, especially where the wolf had bitten it. The blood did not stop flowing as the wolf’s howls became weaker.</p> <p>Yang Ling’s face was pale after using his blood essence to tame the Horned Bee Beasts. He was famished. Seeing the damage suffered by both parties following the battle, Yang Ling had an idea. He sent his two Horned Bee Beasts forward. The mutated Horned Bee Beasts made quick work of the struggling python.</p> <p>Sitting cross-legged beside the wild wolf, Yang Ling recited the mysterious mantra and pressed his right hand on the head of the wolf. Quickly, the flesh of the wild wolf shriveled, and a mist of air spouted from all around its body. Slowly, a peanut-sized orb of blood crystallized on Yang Ling’s palm.</p> <p>So this is the Blood Crystallization Technique, a secret technique of Blood Wizards, which enables them to refine the essences of all the beasts in the world?</p> <p>Looking at the orb of blood in his palm, Yang Ling hesitated for a moment before swallowing it. According to the explanation on the stele, this blood orb refined from the essence of a wild beast had many mysteries, and it was the most powerful supporting item needed for a Blood Wizard to advance. It could rapidly increase his wizarding abilities.</p> <p>“Well, that feels incredible!” After successfully absorbing the power of the orb of blood, Yang Ling slowly opened his eyes. The mountain looked greener and the sky bluer, and he could clearly feel the movement of everything within a ten-step radius.</p> <p>Yang Ling stood up and tested his movements. He felt that his body was filled with energy. He felt as though he could punch a hole in a tree. It looks like the mysterious mantra was powerful indeed. It could not only tame wild beasts, but it could also allow him to absorb their powers through the Blood Crystallization Technique.</p> <p>After understanding how he could use the wizarding techniques, Yang Ling was filled with hope about walking out of this foreign, dangerous forest. He had decided to accept the fact that he had been transported to this world. Perhaps he would be able to enjoy a unique life after strangely arriving at this foreign world.</p>",
  "Chapter 3: Taming an Army": "<p>Hiding atop a tree with lush leaves, Yang Ling lay motionless as he watched a small team of Horned Bee Beasts searching for food. Beside him, thirty-six tamed Horned Bee Beasts silently unfolded their black wings. Their sharp fangs reflected cold light. They lifted their tails, ready to strike, just waiting for the order to attack.</p> <p>After consuming the blood essences of the giant wolf and the python, he noticed in surprise that his wizard abilities had greatly improved. He now could tame ten Horned Bee Beasts with his blood a day, so his efficiency was much greater than it had been in the past. In just a few days, he had successfully tamed dozens of Horned Bee Beasts.</p> <p>Because of either Yang Ling’s blood essence or the effects of the Wizard’s Pagoda, the thumb-sized Horned Bee Beasts would grow to become the size of a sword hilt after being stored for some time in the Wizard’s Pagoda. At the same time, the fang would grow from each side of their mouths, the horns on their heads would also become sharper, and their battle abilities would become even greater than Horned Bee Beasts in the wild.</p> <p>Yang Ling had tried it several times, noticing that the Horned Bee Beasts that he tamed were more aggressive than the ones in the wild. When faced with their wild counterparts, they could deal with five to six of them at the same time.</p> <p>The team of Horned Bee Beasts that came out in search of food had a messy formation. There were about a hundred of them, each slowly flying between the trees in search of food. Some of them flipped over dried branches to see if there were any ants or bugs, others foraged for leaves and sucked on the liquids within, and there were some whizzing around pine trees, searching for the nests of white ants.</p> <p>Seeing the Horned Bee Beasts in search of food becoming more scattered, Yang Ling seized the opportunity and split his thirty-six tamed Horned Bee Beasts into six groups, six bees per group. Other than leaving one group as his bodyguards, he ordered the rest of the Horned Bee Beasts to attack immediately. They were to launch a sneak attack on their unsuspecting counterparts.</p> <p>With Yang Ling’s command, thirty ferocious Horned Bee Beasts flew out like lightning. Their first strike succeeded, and they changed targets as soon as they rendered their wild counterparts immobile. At the same time, Yang Ling followed behind quickly. He bit on his index finger and let a drop of blood fall onto the head of each wild Horned Bee Beast.</p> <p>Over these few days, he accidentally discovered that it was easier to tame injured Horned Bee Beasts. The heavier the injury, the less wizard abilities and blood essence he had to use when taming them. With his current wizard abilities, he could only tame ten healthy Horned Bee Beasts in a day, but after the Horned Bee Beasts were injured, he could tame dozens of them without a problem.</p> <p>At the same time, he realized that no mattered how injured the Magical Beasts were, they could recover fully after being stored in the Wizard’s Pagoda, as if the thick fog within the Wizard’s Pagoda had healing abilities. But this was only limited to Magical Beasts that had just been tamed. After tamed Magical Beasts were injured, they recovered much more slowly. It was as if one was consuming flu medicine; the initial effects would be great, but any subsequent medicine would have diminished effects.</p> <p>With the sudden onslaught, the wild Horned Bee Beasts could not react before they became severely injured. A few of them managed to fight back, but they were powerless against the tamed Horned Bee Beasts. They were either bit in two by the powerful jaws or stung by the sharp black horn.</p> <p>At Yang Ling’s commands, the wild Horned Bee Beasts were wiped out soon after. Other than the thirty or so beasts that had lost their wings or been stung into mush, the rest of them were successfully tamed by Yang Ling and brought into the Wizard’s Pagoda for recovery.</p> <p>Yang Ling was pale after exhausting a large amount of wizard abilities and blood essence. He heaved a sigh as he quickly left, just in case a large group of wild Horned Bee Beasts noticed his actions. After he retreated far away, he commanded the tamed Horned Bee Beasts to hunt. This way, he could not only enjoy some wild game for dinner, he could also train the cooperation and battle abilities of the Horned Bee Beasts. Occasionally, the bees would also successfully kill a low level Magical Beast for him to feast on its blood essence.</p> <p>And that was his routine. When he became tired, Yang Ling would instruct the Horned Bee Beasts to hunt, and then he would consume the crystallized blood essence of their prey. After he recovered his energy, he would seek out more Horned Bee Beasts. At night, he would seize the opportunity to practice the mysterious wizard mantra. In the beginning, the wizard powers circulating in his body were faint, but after some time, he could gradually feel a roaring current.</p> <p>A month or so later, Yang Ling gradually adapted to the jungle. He had tamed more than two thousand Horned Bee Beasts, and he gradually stopped frequenting the hive of the Horned Bee Beasts.</p> <p>It was not that he wanted to accumulate good karma, but that the Horned Bee Beasts had become more cautious. There were not many small teams of Horned Bee Beasts flying around anymore, much less individual bees. The rest of the Horned Bee Beasts either stayed in their nest or swarmed out in armies. There was no way for him to strike anymore.</p> <p>After obtaining a sufficient defensive ability, Yang Ling started to make his way to the outer circles of the forest. He wanted to someday make his way out of this ten thousand mile wide Terras Forest. He sent many Horned Bee Beasts out as scouts on his journey and avoided Magical Beasts he could not defeat. When he occasionally saw a wild beast that he could easily defeat, he would command his Horned Bee Beasts to launch multiple attacks.</p> <p>This day, after journeying for several hours, Yang Ling stopped by a small lake. He wanted to take a quick rest before continuing on his journey. According to the memories of the Horned Bee Beasts, he would be able to make his way out of the primordial Terras Forest if he walked westward.</p> <p>A group of small white rabbits were playing near the lake, their lychee-sized eyes scanning Yang Ling. But Yang Ling had lost interest in them. After all, no matter how delicious their meat was, one could only eat so much of it before getting tired of it. This was the same logic that would explain why a man would cheat despite having married a pretty wife.</p> <p>“Kill…”</p> <p>Just as Yang Ling was about to squat and wash his face, he heard the sounds of a massacre coming from far away. As low level Magical Beasts, Horned Bee Beasts could use simple, local language. After receiving their memories, Yang Ling had quickly learned this relatively simple language.</p> <p>After silently arriving at the scene, Yang Ling hid in the top of a tree with thick leaves. Not far away was a small mountain village. A group of warriors dressed in black clothes were riding flying beasts, manically attacking a group of flustered elves with sharp ears.</p> <p>The warriors in black were riding two different kinds of flying beast. Other than a few calf-sized gryphons, the rest were riding black and white condors.</p> <p>According to the memories of the Horned Bee Beasts, the condors had considerable speed, but they lacked offensive capabilities and were low level flying Magical Beasts. Gryphons, on the other hand, were terrifying. They were not only speedy, but they also had immense power. The elves would be crushed into a mush with just a pounce.</p> <p>With their powerful charging capabilities, the warriors in black roared as they lifted their bloody battle blades. At the same time, an elder elf leading the resistance gave a signal, and the elves launched arrows at the warriors. Every flying green arrow brought down a warrior in black. The lightning-like speed and terrifying accuracy caught the warriors in black off guard. The victors of the battle seemed to be undecided.</p> <p>A battle between races?</p> <p>Yang Ling shook his head. He released all two thousand of his bloodthirsty Horned Bee Beasts. Save for a hundred that he sent to scout the surroundings, he kept the rest of them around him, just in case of a sudden attack.</p> <p>Suddenly, Yang Ling had a glint in his eyes. He saw a black-haired teen elf girl come out from behind the elder. She was slender, her hair long and flowy. Her white dress accentuated her beauty.</p> <p>After muttering for a moment with a green staff in her hand, she released a dark halo from her palm. Everywhere the dark halo passed, the black warriors’ movements became sluggish, as if they were under a curse. It was as if they were swimming in super glue. They were picked off by the accurate arrows of the elves.</p> <p>“Quick, capture that elf priest!” A young man that looked like the leader issued an angry command after losing a few warriors. Quickly, a group of elite warriors in black charged swiftly toward the beautiful lady.</p> <p>Seeing the warriors in black charge toward her with bloodlust, the long-haired lady nervously took several steps back. She once again chanted as she held her dark green staff. Quickly, a ripple appeared in the air, and following that came the sounds of wood cracking. The tall trees around them had become Withered Tree Giants, several meters tall.</p> <p>Under the command of the long-haired beauty, the Withered Tree Giants advanced toward the warriors in black with heavy steps. They swung hard with their bathtub sized clubs, crushing the warriors in black into mush along with their rides.</p> <p>Demonic arts, illusions?</p> <p>Yang Ling rubbed his eyes, unable to believe that he had just seen tall trees become Withered Tree Giants.</p>",
  "Chapter 4: Withered Tree Guardians": "<p>The Withered Tree Giants had brown skin etched with intersecting lines, similar to the tree rings on wood. Their chest muscles were made up of sections. From far away, they looked like walls of hard granite.</p> <p>There were thorns on their knees and elbows. Even though they were shorter than daggers, they were incredibly sharp. Yang Ling had no doubt that they could easily pierce through a person’s skull.</p> <p>The weapon held by each Withered Tree Giant was suffocatingly massive. Rather than call it a giant mace, it was more like a giant log of primordial wood, even thicker than the pillars used to support Yang Ling’s old apartment. Yang Ling was sure that even a T92 tank would be pulverized if it met the impact of those clubs.</p> <p>Shocking, this is too shocking!</p> <p>Yang Ling was dumbfounded. The warriors in black were even more fearful. The Withered Tree Guardians were the guardian deities of the elves of the forest. They were tall and immensely powerful. Even though they knew that they might have to face off against such terrifying entities, the warriors in black had not expected that the long-haired beauty would be able to summon a whole twenty-five of them at the same time.</p> <p>Under the commands of the long-haired beauty, the Withered Tree Guardians took large strides toward the warriors in black. With every step, they brought up large amounts of soil. Even though they were slow, they covered nearly ten meters with every step. In the blink of an eye, they had arrived directly in front of the warriors in black.</p> <p>They brought down their clubs, the impact as loud as lightning. They smashed the warriors in black who could not avoid the attacks in time into pulp, blood splattering everywhere.</p> <p>Caught off guard and facing the massive Withered Tree Guardians, the warriors in black frantically whipped their condors and gryphons and took to the air. The Withered Tree Guardians before them did not advance, but the hardy bodies of these entities were not something the swordsmen could deal with. Only the spellcasters that followed them into battle would be able to deal much damage to the guardian deities of the elves.</p> <p>Under the cover of the Withered Tree Guardians, the elves retaliated. Their dark green arrows rained down on the warriors in black, turning them into porcupines. The morale of the warriors was smashed in an instant.</p> <p>Unable to take to the skies in time, some of the warriors in black fearfully steered their flying beasts to the side. But quickly, they realized that their actions were all for naught. They were either reduced to porcupines by the arrows of the elves or smashed like flies by the clubs of the Withered Tree Guardians. After that, a bulldozer-like foot would crush down, turning them into thin pancakes. Yang Ling had chills just witnessing the scene.</p> <p>According to the Horned Bee Beasts he sent out to scout the surroundings, there were no ambushes set by either party. This put Yang Ling more at ease. He did not want to risk losing his life to witness the action. This world was too crazy; rabbits could spew fire, pythons could spew water, and now even a tree could turn into a spirit. Who knew what other monsters he would come across next.</p> <p>“Wind Riding Technique, quick!” Seeing how invincible the Withered Tree Guardians were, the fearful young man ordered loudly. “All spellcasters are to take steps backward and support the warriors using the Wind Riding Technique, quick!”</p> <p>After the heavy loss, the morale of the young man on the gryphon was low. He stared at the long-haired beauty holding the dark green staff on the ground and clenched his teeth in hatred. According to the intelligence he got from his soldiers, there was only a small elf tribe here. He had thought that he could easily defeat them. He did not expect to face off against this many Withered Tree Guardians.</p> <p>“Yiblis, I’ll sell you to the lowliest brothel after I am done with you. I’ll make sure you satisfy eighty barbarians everyday, d*mn it!” The young man cursed in hatred. Only by selling these young beautiful elves to the nobles or brothels can I recover the loss incurred by this attack. Otherwise, I will have lost big.</p> <p>After receiving the order, several spellcasters dressed in long robes took to the skies on the gryphons. They stopped after they confirmed that they were out of range of the elves’ arrows, then started casting the Wind Riding Technique on the warriors in black. In that instant, the warriors in black sped up. They could now easily avoid the slow Withered Tree Guardians. They charged with bloodlust toward the elves.</p> <p>The condors and gryphons were naturally fast, but they reached alarming speeds after the Wind Riding Technique. Some of the elves were caught off guard, their throats slit by the descending warriors in black. Some of them had even poorer fates, torn in half by the calf-sized gryphons. Blood, brain matter, and intestines slopped onto the ground.</p> <p>Seeing the bloodthirsty warriors in black, the long-haired beauty commanded the Withered Tree Guardians to engage them in combat. Unfortunately, the warriors were too fast to catch. Often, the warriors in black would have already left the attack range of the Withered Tree Guardians before they had finished lifting their clubs. It was like trying to fish with a basket; the basket was too slow, and the fish were too quick.</p> <p>“Sofia, gather the Withered Tree Guardians, quickly!” Seeing the speedy warriors in black, the elder commanding the elves had an idea. Since the Withered Tree Guardians were ineffective and were unable to catch up to the opponents, it was better to gather them and focus on their defense.</p> <p>Indeed, the tide of the battle changed once again when the twenty-five guardians were gathered together. The warriors in black did not dare swoop down and attack, fearful of the thick, long clubs of the guardians. The elves could hide behind the Withered Tree Guardians and shoot their arrows, accurately taking down several warriors in black.</p> <p>“Ice Frost Technique, freeze the Withered Tree Guardians!” the young man ordered after circling the air. Following the command, the several spellcasters started to chant. Quickly, the temperature of the surroundings dropped. Even Yang Ling, who was hiding in the treetops, could not help but shiver.</p> <p>After hearing the incantations of the spellcasters and noticing the increasing magic power in the air, the color drained from the face of the elf elder. The Withered Tree Guardians had not advanced and could not attack the targets in the air. If they became frozen and unable to attack the targets on the ground, the outcome would be disastrous.</p> <p>“Elder, we have to ensure the continuity of our clan: lead the clansmen in retreat. It will be too late if we don’t leave now!”</p> <p>After clenching his teeth, an elf warrior with a full holster of arrows stepped forward. But without waiting for the elder to give an order, the spellcasters in the air raised their right hands at the same time. Swan feathers descended from the sky like snow. In the blink of an eye, the slow Withered Tree Guardians were frozen solid.</p> <p>Ice sculptures? Really?</p> <p>Shivering, Yang Ling once again calmed the Horned Bee Beasts, excited by the smell of blood. He circulated the wizard powers in his body to ward off the cold. Admiring ice sculptures was a recreational activity, but being turned into a living ice sculpture was another story.</p> <p>Seeing that the Withered Tree Guardians were now unable to move, the morale of the warriors in black ran high. They frantically charged toward the elves.</p> <p>“Haha, you’re asking for death!” The young man slit the throat of an elf warrior and gave a loud order, “Kill all the men and take all their possessions. Tie up all of the women!”</p> <p>The young man was heavily armored, his gaze sinister. He charged downward riding his gryphon, under the protection of many guards. After scattering the elves’ formation, he charged straight for the long-haired beauty.</p> <p>“D*mn it, don’t kill the young elf ladies! They are all money. Tie them all up.” The young man reprimanded a warrior who was enjoying the massacre. He looked lecherously at the bodies of the young elf ladies. “Haha, warriors, enjoy this day with me, Ymir!”</p> <p>After understanding the intentions of the young man, the warriors in black let out loud howls, advancing even faster toward the retreating elves. Some of them even became savages, immediately tearing off the clothes of the elf ladies.</p> <p>“Release me you beasts, release me!”</p> <p>The long-haired beauty struggled after she got tied up by several warriors in black. Seeing her grandfather unable to help, and then looking at the young man advancing toward her lecherously, she could not help but cry.</p> <p>“Haha, beauty, I am coming for you!” Ymir could not control his urges when he saw this fairy-like lady. He could not wait and pounced forward. “Oh my little beauty, you need not worry, I’ll treat you well!”</p> <p>“Ah… my eyes!”</p> <p>“Ah, Horned Bee Beasts, help!”</p> <p>…</p> <p>Just as the long-haired beauty closed her eyes in despair, the warriors in black beside her suddenly started shouting hysterically. Blood was flowing out their eyes. They dropped onto the ground and started rolling around. She opened her eyes and looked, only to see many Horned Bee Beasts savagely biting the eyes and heads of the warriors in black.</p> <p>In the critical moment, Yang Ling had sent out his Magical Beast army that was excited by the smell of blood.</p>",
  "Chapter 5: Chapter 5": "<p>Seeing Ymir ordering his men to tie up the females of the elf tribe, Yang Ling guessed that this man was either a slave master, or at the very least, a slave trafficker. He was capable of committing any evil. After confirming that there were no ambushes around them, he decided to show off some of his power!</p> <p>He had to tackle the problem at the source. If he was to act, he was going to use all of his power to target the leader.</p> <p>Yang Ling gathered two hundred of the fiercest Horned Beast Bees and split them into two teams. He ordered one of the teams to attack the young man Ymir, while the other team was sent to deal with the spellcasters in the air. He did not want the mysterious spellcasters to turn him into a human popsicle after he exposed himself.</p> <p>The army of Horned Bee Beasts became increasingly excited as they heard the pathetic cries and detected the thick scent of blood following the ambush. If not for Yang Ling’s commands and suppression, they might have swarmed over in that instant.</p> <p>After being tamed by Yang Ling, the Horned Bee Beasts not only became more powerful, they also became more raring to battle. Sometimes, after they captured their prey, they not only swallowed their bones, they even consumed the fresh blood splattered onto the ground. At the same time, just like Yang Ling, the beasts would experience considerable improvements after consuming the blood essence of Magical Beasts. Their armor would become more sturdy, the black horns on their heads sharper, and they became even faster.</p> <p>Caught off guard, the warriors in black stood no chance against the ferocious Horned Bee Beasts. Some of them fled outward in a fluster, but they were shot down by the elf warriors. Some flailed their swords in vain and could only watch as the Horned Bee Beasts ripped their flesh, turning them into bare skeletons in mere seconds.</p> <p>Wherever the Horned Bee Beasts went, the once-victorious warriors in black abandoned their armor and fled. Even the mighty gryphons were no exception, fleeing immediately. The lucky managed to flee, while the unlucky were reduced to bones, some even leaving behind only a few strands of hair or a pool of blood.</p> <p>Ymir, who was the primary target of the Horned Bee Beasts’ attacks, was in an even more pathetic state. Several of his elite guards were instantly reduced to pools of blood. Ymir was incredibly afraid, seeing the sharp fangs of the Horned Bee Beasts and hearing the blood-curdling screams of his guards.</p> <p>“Ah, my butt!” In his fear, Ymir maintained his guard on his eyes and vital areas, but a large portion of flesh was ripped from his butt. “D*mn it, cut through this formation! Gilbas, Fireball Technique!”</p> <p>In his panic, Ymir shot a fireball toward his butt. At the same time as he was burning the detestable Horned Bee Beasts, the flames seared his buttocks. The pain made him sweat and tear up.</p> <p>The spellcaster called Gilbas had fast reactions, but the Horned Bee Beasts suddenly changed the focus of their attacks, targeting the scattered warriors in black instead. He had not killed many Horned Bee Beasts despite launching a large number of fireballs. Instead, ten more warriors in black were sprawled on the ground, burned and smoking. Ymir was furious. If not for the pain in his butt and his limited movement, he would have charged over to Gilbas and slapped the sh*t out of him.</p> <p>“D*mn it, reform on me. Make your way to me even if it means you have to die!”</p> <p>Seeing the increasing numbers of the Horned Bee Beasts, Ymir became even paler as he gave a loud order. Horned Bee Beasts were low level Magical Beasts. Even though their individual offensive capabilities were not terrifying, a large group of them would be tricky. One would not be able to deal with this large of a group of flying beasts unless one was equipped with sturdy armor or ample spellcasting abilities.</p> <p>Under such a terrible situation, the warriors in black fled in all directions like headless cockroaches. Some of them, in their terror, even rolled off their flying beasts that were hovering in the air. At the same time, the condors and gryphons that had lost their masters also fled for their lives, as mighty as they were. A calf-sized gryphon, in its panic, flew straight toward where Yang Ling was hiding.</p> <p>“Haha, great!” Yang Ling was not afraid when he saw the gryphon charging toward him. Instead, he was elated. With a speedy gryphon as his ride, it would be much easier to make it out of this large forest.</p> <p>Yang Ling quickly jumped out of the treetops and grabbed onto the right claw of the gryphon before pulling himself up onto its back. He then bit his index finger and dripped a drop of blood onto its head. In that moment, a silver glow surrounded the gryphon, forming into several mysterious symbols. The tamed gryphon obediently allowed Yang Ling to ride it.</p> <p>Taking a deep breath, Yang Ling instructed the gryphon to stop on top of a giant stone. When he had tamed the gryphon just now, he felt as though his blood and wizard powers had poured out. He became fatigued in an instant. It looked like the level of this gryphon was much higher than a Horned Bee Beast. If not for the fact that it was not in the mood for a battle now, it might have trampled him with a simple charge. There might not have been enough time for him to tame it with his blood.</p> <p>“Ah, help!”</p> <p>“Ah, my thigh…”</p> <p>…</p> <p>Even though the warriors in black were nimble, there were unfortunately too many Horned Bee Beasts to deal with. They were unable to gather before a swarm of Horned Bee Beasts attacked them, reducing them into piles of bones in the blink of an eye. Some of their bones were even picked clean. The pathetic cries before their deaths were chilling.</p> <p>Seeing the swarms of Horned Bee Beasts and hearing the crunching sounds of bones, even the elves who were not the targets of the attacks were fearful, much less the warriors in black.</p> <p>“A summoner? Yiblis, we fell for the ambush of the elves of the forest!” Ymir understood after he saw that the attacks of the Horned Bee Beasts had been coordinated and focused only on the warriors. Then he saw Yang Ling, who charged out under the protection of a team of Horned Bee Beasts.</p> <p>Horned Bee Beasts were Magical Beasts of the lowest level and did not have high intelligence. Usually, they would all swarm forward when they encountered an enemy or prey. But the attacks of the Horned Bee Beasts before them were strategic, precise, and clearly trained. They must have been trained and controlled by a Summoner like Yang Ling.</p> <p>“Retreat, quickly!” Ymir ordered after a moment’s hesitation. He realized that he had lost the battle after seeing the casualties, and that even a few spellcasters were unable to fend for themselves. He was the first to hop onto a gryphon and flee for his life.</p> <p>“Ah, my butt, ah…”</p> <p>In the chaos, Ymir sat on his gryphon. He howled in pain whenever the bleeding wound on his butt came into contact with the hard bones of the gryphon. But there was a swarm of Horned Bee Beasts behind him. To save himself, he had no choice but to bear with the pain and flee on the gryphon.</p> <p>“D*mn you elves and that blasted Summoner. Wait and see, I’ll be back!”</p> <p>Ymir was furious as he looked at the few warriors beside him. He had not expected to be left with such a small group of men despite him personally leading the attack. He had not only failed to capture a single forest elf, he had paid a heavy price.</p>",
  "Chapter 6: Evolution": "<p>“Sir, here please!”</p> <p>After reversing the battle, Yang Ling received the passionate hospitality of the elves. He was invited into a green wooden building. The ground was level in the building and etched with natural patterns, its texture similar to white marble. The ground did not produce a sound wherever Yang Ling stepped. It was as if he was walking on soft, noise-absorbing wooden planks.</p> <p>“Sir, please try this rum we made using the purple orchids, scutellaria, and morning dew we gathered.” The long-haired beauty Sofia took several steps back, leaving behind a faint fragrance, after serving Yang Ling a cup of light green rum. She beckoned for the elf elder to sit.</p> <p>“From your accent, sir, you don’t seem to be local?”</p> <p>“Elder, you can just call me Yang Ling.” Yang Ling took a sip of the light green rum. It was refreshing, as if it was filled with pure mint. “You are right, my hometown is somewhere far away from here. I heard the sounds of a battle when I was passing through just now and thus hurried over to help.”</p> <p>Yang Ling drank more of the rum as he silently observed his surroundings. Since he was a foreigner, he thought that he might have unexpected gains after he befriended the local elves.</p> <p>“The slave-capturing squads of the humans are becoming more and more brazen, especially the violent ones they sent today!” The elf elder had a serious expression. He gripped the pitch black staff in his hand tightly. “It is fortunate that you came at the right time and provided assistance, Yang Ling. Otherwise, the outcome would have been disastrous!”</p> <p>“It was nothing, you need not thank me,” Yang Ling said in relief. “The attackers suffered heavy casualties, so I would think that they will not dare bother you in the future. Your lives should improve!”</p> <p>“No, the nightmares have just begun. The young man that escaped is from the notorious Anca family from Wissen Town. After the heavy casualties this time around, he might soon return with a large group of warriors for revenge!”</p> <p>The elf elder had a depressed tone. He became increasingly worried as he thought about the powerful Anca family. This area was far away from the other elf tribes. They did not have Dalewi Warriors or elite hunters, much less powerful forces such as the Fairy Dragon or the Twin-headed Chimera.</p> <p>It would be best for them to retreat as soon as possible when faced with the vengeance of the Anca family, but winter was approaching. There was no way they could migrate with their entire tribe. The only method they had left was to think of ways to keep this mysterious Summoner here.</p> <p>Yang Ling got the general idea after hearing the elf elder’s explanation. It turned out that the Tailun Continent that they were in now was immensely vast, and the Terras Forest was the largest primordial forest in the Tailun Continent.</p> <p>Since there were rich resources in these parts, the Terras Forest had attracted many humans to gather wood and hunt. Slowly, near an ancient castle in the outer parts of the forest, a small town called Wissen was established.</p> <p>The town was not big by any means, its population only about twenty thousand. But since it was near a place with many resources, the number of troops, risk takers, and merchants that were stationed there often numbered four to five thousand.</p> <p>The Anca family was the most powerful faction in Wissen Town. They had warriors in the family that could kill without blinking an eye. It was rumored that they also had many powerful swordsmen and spellcasters. They were notorious for extorting the citizens and merchants, as well as for their slave trade.</p> <p>Over the years, many troops of considerable abilities came into conflict with the Anca family, but no one had ever bested them. Most of the troops that stood up against them ended up dismembered. There were no exceptions over the past years.</p> <p>It was rumored that the Anca family were a group of merciless pirates, and that Wissen Town was merely a small resting spot for them. Often, people would see warriors of unknown origins enter their castle. These warriors were all merciless characters.</p> <p>Slowly, troops and adventurers from all over the world fell under the control of the Anca family, much less the inhabitants of the town. Even small tribes of other races living in Terras Forest were often harassed by these human traffickers.</p> <p>After giving Yang Ling a rough explanation of the situation, the elf elder let out a heavy sigh. According to the rumors that had spread over the years, the elves’ situation wasn’t optimistic now that they had become a target of the powerful Anca family.</p> <p>After groaning for a moment, the elf elder had an idea. He said sincerely, “Brave warrior Yang Ling, I wonder if it’s convenient for you to stay here for a short time?”</p> <p>“I’m sorry, I have already arranged to meet a friend a few days later…” Even though Yang Ling wanted to stay, he feigned hesitation. “Furthermore, my Horned Bee Beasts are still rather weak. If the opponents launched a strong offensive, I might not be of any help!”</p> <p>When he understood the elf elder’s intentions, Yang Ling decided to play hard to get. He might obtain a bigger reward that way. But it would be troublesome if Ymir led a large group of warriors and spellcasters here to exact revenge.</p> <p>This continent was strange and mysterious. A Fireball Technique was enough to burn more than ten Horned Bee Beasts to ash. If the other party were to mobilize even more powerful spellcasters, he might be defeated in an instant.</p> <p>“Yang Ling, these are all Magical Beasts that you summoned?” The elf elder clenched his teeth after looking at the horde of Horned Bee Beasts beside Yang Ling. He took out a small clay bottle from his robes. “This is the Water of the Spring of Life our tribe has left for the year. It can hasten the evolution of your Magical Beasts. With this many Horned Bee Beasts, even successfully evolving a portion of them to the second stage would increase your combat abilities dramatically, much less all of them!”</p> <p>For the safety of his tribe, the elf elder had taken out his treasure. At the same time, he could not understand how Yang Long was able to summon this many Horned Bee Beasts. Typically, Summoners would only be able to summon one or two Magical Beasts, but Yang Ling had managed to summon a full horde of beasts.</p> <p>Seeing how serious the elf elder was, Yang Ling understood that what the elder produced was a serious treasure. He accepted it without hesitation. “I am not a Summoner; these Horned Bee Beasts have been with me since I was little.”</p> <p>“Oh, so that’s why!” The elf elder did not probe any further as he saw that Yang Ling was unwilling to elaborate. He told him how to use the precious Water of the Spring of Life.</p> <p>Sitting cross-legged, Yang Ling chose a hundred Horned Bee Beasts, the most ferocious of his army. He poured a drop of the precious Water of the Spring of Life onto each of them and consumed the rest. Quickly, the little critters grew to the size of a fist. Mysterious symbols once again surrounded the beasts before disappearing.</p> <p>At the same time, Yang Ling felt the pagoda mark on his forehead turn hot. A warm current was slowly circulating within his body. His wizard powers were becoming more powerful.</p> <p>“An Ancient Summoner?” The elf elder looked excitedly at Yang Ling. “Even a great Summoner would not be able to contain hundreds of Magical Beasts, much less an ordinary Summoner.”</p> <p>The elf elder was incredibly excited. According to the historical annals, an Ancient Summoner had immense spiritual powers and could gather large numbers of Magical Beasts to do battle. As an Ancient Summoner, even though Yang Ling could only control low level Magical Beasts like the Horned Bee Beasts, the immense number explained everything. His potential was unimaginable.</p> <p>With an Ancient Summoner like Yang Ling helping them, the elder believed that they would be able to avert this crisis even if Ymir were to return with a horde of gryphons.</p> <p>Yang Ling gave a faint smile as he looked at the excited elf elder. He did not confirm the elder’s suspicions, nor did he deny them. In reality, the elder might think of him as a lunatic if he were to say that he came from another planet. Since they were willing to think of him as a so-called Ancient Summoner, then it would be better if he did not clear up the misunderstanding. He might even be able to gain something from it.</p> <p>After collecting himself, Yang Ling had a thought and instinctively formed a hand gesture. Suddenly, the hundred evolved Horned Bee Beasts appeared before everyone out of thin air. They bared their fangs, barely containing their bloodlust. It felt like they had grown even larger after being stored in the mysterious Wizard’s Pagoda for some time.</p> <p>Poison stingers?</p> <p>Quickly, Yang Ling noticed that the evolved Horned Bee Beasts had gained another power—poison stinger attacks. A Horned Bee Beast that had evolved to the second stage could shoot out three highly poisonous stingers from its tail a day. The stingers were fast as lightning. Those hit by the stingers would feel their bodies turn numb immediately. More severe symptoms included slipping into a coma.</p>",
  "Chapter 7: An Extraordinary Misunderstanding": "<p>After standing up and testing his powers, Yang Ling noticed that his strength and wizard powers had improved considerably. He now had a shocking explosive power. With the sudden increase in speed, he could now move like an unevolved Horned Bee Beasts. The elves were amazed.</p> <p>Yang Ling could not help but exclaim that the elves’ Water of the Spring of Life was indeed a powerful treasure after looking at his evolved, fist-sized Horned Bee Beasts as well as witnessing the change to the wizard powers in his body. It had a better effect than consuming several blood orbs from Magical Beasts.</p> <p>“How could we get this Ancient Summoner to stay and help us?” Now that the slave-capturing squad of the humans was becoming more and more brazen, the prettier members of his tribe would become their primary target. The elf elder was very worried.</p> <p>Just as the elf elder was thinking up a plan, an elf carrying a basket of arrows made of purple sandalwood charged into the room. “Elder, the dwarves have visited us with a large number of weapons!”</p> <p>“Good, this is great, invite them in!”</p> <p>The elder had not finished his sentence when a commotion broke out outside the room. “Elder, we are thirsty, get us a few barrels of rum!”</p> <p>A dark-faced dwarf, his height reaching about Yang Ling’s chest, swaggered into the room and sat down on a light green bamboo chair after tossing the bag he was carrying onto the ground.</p> <p>Even though he was not tall, the dark-faced dwarf was incredibly well-built. His arm was thicker than the long-haired beauty Sofia’s thigh. The dwarf could not keep still despite sitting down. He constantly shifted his watermelon-like butt, causing the bamboo chair to creak incessantly. Yang Ling was worried that the chair would shatter under the weight.</p> <p>“Sofia, me and the poor members of my tribe have walked in the mountains for the entire day, can’t you give us a few glasses of rum to quench our thirst?” The dwarf feigned a pathetic look and stared at Sofia. “If not, one glass is alright too. I have not tasted alcohol for a full month now. Oh god, I am too pitiful!”</p> <p>“Alright, Rumi, you drunkard. You’re going to drink yourself into a stupor again!” As she was saying this, Sofia poured a glass of delicious rum for the dwarf, then filled Yang Ling’s glass.</p> <p>After finishing his rum in a gulp and looking at Yang Ling’s full cup, the dwarf felt the injustice deeply. “Sofia, this is not fair! You poured your lover a full glass of rum, but only gave me such a little amount. It’s not enough to quench my thirst, I want another cup!”</p> <p>Lover?</p> <p>Sofia felt ashamed and angry after she heard the dwarf Rumi’s words. She fiercely twisted Rumi’s filthy ear and left. As she was leaving, she silently turned to look at Yang Ling, her face red.</p> <p>“Come, Brother Rumi, I’ll treat you to a cup!”</p> <p>Seeing the dwarf pick up the flask of rum and drink every last drop, Yang Ling laughed and pushed his glass of rum over.</p> <p>The dwarf did not hesitate to down the large glass of rum in a gulp. After releasing a burp, he gave a thumbs up to Yang Ling. “Brother, that was nice of you. I’ll treat you to a drink next time, we’ll drink by the barrels!”</p> <p>“Look at this lad, still the same as always. Rumi, what did your father get you to bring over this time? Let me see quickly!” The elder elf gave a charitable smile as he saw the dwarf beginning to fall into a drunken stupor.</p> <p>After patting his head, the dwarf finally recalled that he was here for a reason and ordered the members of his clan to unravel the package for the elder.</p> <p>Yang Ling took a cursory glance. Other than a small number of swords, the bulk of the weapons were steel armor, bows, and arrows.</p> <p>Yang Ling tried flailing a sword, but he felt that it was a little too heavy. He struck hard and managed to slice off a thick branch cleanly. The sword was rather sharp. Yang Ling tapped on the blade of the longsword and heard a crisp feedback. He understood that the longsword was sufficiently hard and flexible, at least better than the cleaver he used to slice his meat and vegetables.</p> <p>Yang Ling studied electronics, but he had been sent to a metal factory by the school for his internship. Who knew what the old man in his school had been thinking. But after staying there for a month, he could at least evaluate the materials, hardness, and flexibility of an item. To think that he would be able to come across steel of this quality even on this ancient continent. He was quite interested in the dwarf’s mines and smithing techniques.</p> <p>“Brother, you can take any weapon you fancy, just treat me to a few cups of beer in the future!” The dwarf Rumi generously patted Yang Ling on the shoulder, his sooty hands leaving a fresh mark on Yang Ling’s white jacket. But if he were to know that Yang Ling was comparing the weapon he created with much effort to a cleaver that was sold by the roadside, he might become livid.</p> <p>After evading Rumi’s harassment, Yang Ling flicked the blade of the sword. “How much ore of this quality do you have left? How about you sell a portion of it to me?”</p> <p>Yang Ling understood from the Horned Bee Beasts’ memories that steel ores could be used to feed them. The teeth of the Horned Bee Beasts were very sharp and could shatter even steel, much less rocks. Their armor would become harder after they consumed various metals.</p> <p>Even though he did not understand why he would be transported to this forest, Yang Ling knew that if he were to survive in this primordial forest, other than cultivating the mysterious wizard mantra, taming the Horned Bee Beasts would offer him the best chance of survival. Increasing their abilities was the next step to going home.</p> <p>“What, you only want the ores?” the dwarf exclaimed in shock. Many people were fighting to purchase the weapons forged by his tribe, but this was the first time he heard that someone wanted only the ore. “Brother, are you thinking of smashing walls like a giant throwing rocks by bringing only the steel ores into battle?”</p> <p>After staring at Yang Ling for a while and noticing that he was not joking, Rumi creased his brows. It was not that he was unwilling to sell Yang Ling the ores, but he did not know what price he could give. He would be embarrassed to give a high price since Yang Ling seemed to be rather close with Sofia, but he would be unable to account to the members of the clan if he gave a low price.</p> <p>Yang Ling understood why Rumi was in a tight spot. After smiling mysteriously, he took out twenty Magical Beast essences he had obtained over the days from his robes and said, “You can take these as a deposit. Of course, if you are willing, I can exchange them with good alcohol in the future!”</p> <p>There were rich resources in this forest: clear, sweet spring water, sufficient sunlight, fully organic ingredients… The resources here were one of a kind. Perhaps it would be a good idea to open up a brewery here. Just the clear spring water here was better than any brand name mineral water back on earth.</p> <p>After exchanging formalities and under the support of the elf elder, Yang Ling managed to obtain two thousand pieces of quality steel ore using twenty-five essence crystals and ten barrels of rum. It was enough to feed his Horned Bee Beast army for a good half a month even without needing to hunt.</p> <p>People thought that Yang Ling must have been born into a wealthy family. An average person would be satisfied even obtaining just one of the weapons forged by the dwarves, but Yang Ling only wanted a large amount of ore. He was either a lunatic or a rich nobleman who had everything. If he was the latter, he would not pay any attention to ordinary weapons.</p> <p>Also, the essence crystal of a low level Magical Beast was worth at least ten Purple Crystal Coins and could feed five families for several years, yet Yang Ling offered twenty-five of them at a go. Other than a few human nobles from the capital, who else could do something like that?</p>",
  "Chapter 8: Volcano Valley": "<p>After enjoying himself for several days, the dwarf Rumi left satisfied with his ten barrels of rum. Before he left, he promised that he would lead the brave warriors of his tribe into battle should the elf tribe get attacked again. He also warmly invited Yang Ling to visit the dwarf tribe.</p> <p>“This dwarf is interesting indeed!” Yang Ling laughed.</p> <p>“He is a boor and often utters nonsense!” Sofia blushed as she thought about how Rumi called Yang Ling her lover in front of everyone. She took a peek at the smiling Yang Ling.</p> <p>After being saved by Yang Ling at the critical moment, Sofia was filled with gratitude toward him. She could not imagine what kind of humiliation she would have gone through if she had not been saved; she was also very surprised when Yang Ling emerged from the treetops and revealed himself. She did not expect her benefactor to be this dashing, nor did she expect that he could control such a large group of Magical Beasts despite his young age.</p> <p>Elves did not fancy humans as most of them were greedy and scheming, but Yang Ling was an exception. In just a few days time, he had gotten friendly with the elves. Slowly, Sofia also began to feel something strange when she was around him. She liked listening to his stories, she liked how he sometimes looked a little dazed when looking at her, and she liked the feeling she got when she was around him.</p> <p>“Haha, the brat Rumi is a carbon copy of his father!” The elder laughed. “Mountain dwarves are naturally forthright and powerful. They are not only adept at making weapons and armor, they are also brave warriors!”</p> <p>Yang Ling looked at the bamboo chair beside him and smiled. “That’s right, they sure are powerful. They almost crushed the bamboo chair!”</p> <p>The elves couldn’t help but chuckle. Sofia laughed as she wiped off the stains Rumi’s sooty hands had left on the bamboo chair. Her glistening black hair, long lashes, fair neck, and slender waist tempted Yang Ling.</p> <p>He did not know why he had felt the flames of passion within him throughout these last few days. Yang Ling could not help but think wild thoughts whenever he saw Sofia’s fair, gentle skin or alluring figure. Sometimes, he would recall the suited lady he had stood behind on the bus the other day. He would recall his excitement when he saw her perky butt and cleavage.</p> <p>What was even weirder to him was how the pagoda-shaped mark on his forehead would burn whenever he was overcome with lust. The mark would even throb slightly, much to his confusion. In his lack of understanding, he could only bear with that for the moment. He pretty much got used to it after the throbbing occurred on several different occasions.</p> <p>Over the next few days, in order to quickly enhance his abilities, Yang Ling either spent the day training his Horned Bee Beasts or cultivating his wizard mantra.</p> <p>After repeated practice, in an attempt to increase the Horned Bee Beasts’ attacking power, Yang Ling split his army of two thousand or so Horned Bee Beasts into ten teams and chose ten of the most ferocious beasts to lead the teams. Each large team was split into a further ten groups, each group consisting of twenty Horned Bee Beasts. The groups were led by Horned Bee Beasts that had evolved to the second stage.</p> <p>After the evolution, the hundred Horned Bee Beasts had experienced huge improvements, both in intellect and battle abilities. Yang Ling also found it easier to give them instructions. Be it in their attacking or defending abilities, the Horned Bee Beasts that had been taught a battle strategy showed more impressive results, far surpassing their wild counterparts.</p> <p>There was a light drizzle that morning. Yang Ling had wanted to sleep in for a little while longer, but the long-haired beauty Sofia approached him bright and early.</p> <p>“Yang Ling, there was a slight drizzle this morning, and any purple orchids picked now would be great for making rum. Do you want to go?” Sofia looked shyly at Yang Ling, who was not wearing a shirt. Her beautiful eyes, slightly blushing cheeks, and youthful fragrance all caused Yang Ling’s heart to beat faster.</p> <p>Yang Ling instinctively looked at Sofia’s perky breasts and slender thighs. If he were to judge them according to Earth’s beauty standards, the young elves in this tribe would all be classified as extreme beauties. Sofia would be the cream of the crop. Standing before her, even a famous actress would pale in comparison, much less the belle he had chased after in the past.</p> <p>“I’ll go, of course I’ll go!” Yang Ling wiped his face with cold water. “To be able to take a stroll with the prettiest lady in the elf tribe, how can I miss such an opportunity!”</p> <p>Prettiest lady in the elf tribe?</p> <p>Sofia turned red when she heard Yang Ling, her watery eyes bulging. She felt shy, as well as unprecedentedly joyful, when she looked at Yang Ling’s strong muscles and his charismatic gaze.</p> <p>After a little preparation, Yang Ling left with the ladies of the elf tribe to explore the Terras Forest amidst the drizzle.</p> <p>“Comfortable, much better than any topnotch oxygen cafe back on Earth!”</p> <p>Yang Ling stretched comfortably as he strolled between the trees and took deep breaths of the cool air. When he had just graduated, he and some friends had visited an oxygen cafe touted to have the best source of oxygen in the world. It felt alright back then, but now that it was compared to this clean, natural air, it felt like garbage.</p> <p>“Yang Ling, we must give thanks to the Goddess of Nature! Be it the lush forests or the clean air, these are all blessings given to us by the goddess!” Sofia closed her bright eyes, touched her heart with her right hand, and started giving a silent prayer.</p> <p>The world was silent.</p> <p>In that moment, looking at Sofia and her flowing white dress, her long lashes and peaceful expression, Yang Ling felt serenity coming from the forest. He did not believe in gods, but at this moment, he felt as though the Goddess of Nature from the legends was just over the horizon.</p> <p>“Hey, it’s getting late, let’s go!”</p> <p>After her prayer, Sofia slowly opened her eyes. She saw Yang Ling staring at her and could not help but blush. After seeing that her sisters were nowhere to be found, she realized that they were intentionally giving her some alone time with Yang Ling. Her face turned red.</p> <p>Along the way, Sofia gently picked purple orchids that were covered in morning dew and placed them into her flower basket. Her beautiful face, alluring figure, and long dancing hair attracted Yang Ling’s gaze. Sofia’s heart beat faster whenever she caught Yang Ling looking at her. Even her ears were red.</p> <p>Some time later, the two of them arrived at a quiet valley. This place was different from the other areas they had walked through. It got more desolate the farther they traveled into it. Eventually, there were not even traces of grass in the area, much less flowers.</p> <p>“Oh no, Valenia Valley. Yang Ling, leave, leave quick!” Sofia was incredibly alarmed when she realized where they were. She stopped immediately. “This is a place cursed by the demons! Leave, we must leave quickly!”</p> <p>His expression turning serious, Yang Ling also had a bad premonition. This place was too quiet. There were no insects or birds here; in fact, there was not even the sound of wind. There was a warm rumble from time to time beneath his feet. The rocks around them were very smooth, as if they had been exposed to a terrifying heat sometime in the past.</p> <p>“A dead volcano?” Yang Ling swallowed. This is surprising. The surrounding areas are rich with nature. How odd to think that there is a dead volcano here.</p> <p>Yang Ling turned to leave as he grabbed Sofia’s icy cold hand. Unexpectedly, the Horned Bee Beasts behind him were not willing to follow for the longest time. Some of them even flew forward without consideration, quickly disappearing behind a giant rock.</p> <p>Yang Ling was surprised when he saw the unusual actions of the Horned Bee Beasts. He had not had such a situation ever since he tamed the Horned Bee Beasts. Looking over in confusion, he saw that there was a good number of dark red fragments behind the giant rock. The Horned Bee Beasts were charging toward these fragments and happily devouring them.</p> <p>“Dark Fire Crystals?” Yang Ling was first shocked, but understood quickly. According to the memories of the Horned Bee Beasts, these dark red crystals were left behind after a volcano erupted. They were also the Horned Bee Beasts’ favorite food. There were fire element energies within these crystals which could boost the speed of their evolution.</p> <p>“Since we are already here, you need not worry!” Yang Ling squeezed Sofia’s hand when he saw how pale she was.</p> <p>Sofia instinctively leaned against Yang Ling’s body as she looked at the barren valley and recalled the various terrifying legends. She saw how calm Yang Ling was and felt his powerful heartbeats. Her nervousness slowly faded.</p> <p>“Oh, what is that over there?”</p> <p>Yang Ling unintentionally spotted a reflection of sunlight nearby when he was surveying the surroundings. He walked over to have a look and could not help but gasp. All he saw was a white skeleton leaning against a stone outcrop, its blank eyes staring straight ahead. The skeleton was missing some parts, as if its bones had been blown away by a strong wind or destroyed by a wild beast.</p> <p>Beside the skeleton was a dull dagger and the few crystals of an unknown Magical Beast. There was also a black badge beside the skeleton. Carved on the badge was a soaring eagle as well as several ancient characters. But neither Sofia nor Yang Ling could decipher the words.</p> <p>“Yang Ling, this person is too pitiful. Let’s bury him!” Even though she said this, Sofia leaned into Yang Ling’s arms in fear when she saw the incomplete skeleton, not daring to take a step forward.</p> <p>After shaking his head, Yang Ling grabbed the dagger and dug a hole about half the height of an average human before dragging the skeleton over. Just as he was about to bury the skeleton, he noticed in shock that there was an ancient, pale silver ring lodged on the right middle finger of the skeleton. He pulled it off in curiosity.</p> <p>“You don’t need this in the afterlife, rest in peace!” After filling the hole, Yang Ling put the silver ring on his middle finger.</p> <p>After observing for a moment, Sofia hesitated to say, “Yang Ling, this looks like a Space Ring. Try dripping a drop of blood onto it!”</p> <p>Space Ring?</p> <p>Even though he was a little confused, Yang Ling bit his index finger and allowed a drop of blood to fall onto the old ring. Just as the blood came into contact with the ring, mysterious symbols appeared around the ring. Following which, the ring locked tightly around his finger. He could not take off the ring, try as he might.</p>",
  "Chapter 9: Weak Magical Beasts": "<p>Yang Ling quickly understood how to use the Space Ring after Sofia explained it to him. The Space Ring was a sort of magical storage space, and he only needed a thought to quickly put in or take out an item.</p> <p>There were many things in the Space Ring. There were various minerals, a few crates full of crystal coins, as well as a large stack of books. In that instant, Yang Ling felt dizzy just looking at all the items.</p> <p>“Mind Magic for Beginners, Gryphon Techniques, Research on Secret Silver Ores…” Yang Ling nonchalantly picked out a few books from the stack, and each of them shocked the elf Sofia.</p> <p>“Mind Magic?” Sofia said in surprise, grabbing the thick book from Yang Ling’s hands. “Yang Ling, when this skeleton was alive, his status was definitely not simple!”</p> <p>“So what if it wasn’t simple? He still returned to the dirt after he died!”</p> <p>Sofia was shocked, but Yang Ling did not think too much about it. Just as he was about to carefully scrutinize the items in the Space Ring, the Horned Bee Beast leading the group suddenly let out a howl, leading the group of Horned Bee Beasts back toward him.</p> <p>“Sofia, be careful!” Yang Ling had a bad premonition when he saw the unusual behavior of the Horned Bee Beasts. He hugged the flustered Sofia and observed the surroundings closely, preparing himself for any surprises.</p> <p>Quickly, rustles could be heard. A group of strange creatures emerged from behind the rubble. They had large heads, yet their bodies were only about the thickness of a water bottle. They all had a thin tentacle on each side of their bodies, as well as a bowl-sized eye in the center of their foreheads.</p> <p>“So they are Evil Eyes!” Sofia heaved a sigh of relief as she leaned in Yang Ling’s embrace. “They are low level Magical Creatures that live in groups. They can shoot laser beams. Even though they are rather slow, we should still be careful!”</p> <p>Yang Ling quickly understood what she meant by rather slow. The Evil Eye directly opposite them attacked without warning, releasing bolts of chopstick-sized beams of light. The attacks left holes in the wall behind them. Even though the beams were powerful, the speed and accuracy of the projectiles were laughable. They had to store energy for half a day after every round of projectiles, and Yang Ling and Sofia could easily avoid the projectiles they released.</p> <p>Yang Ling was even more relaxed by the fact that even though a portion of them would attack with all their might, a good portion of them would just stay by the side and look on. He did not know if this was because they were confident of their numbers, or if they just lacked intellect. In fact, some of the creatures even spread out in search of food, picking up and consuming the Dark Fire Crystals.</p> <p>Under Yang Ling’s command, two hundred Horned Bee Beasts started to attack. They formed a triangular formation and swarmed over, freely assaulting the slow Evil Eyes as if they were fighter jets.</p> <p>The Horned Bee Beasts rained down on the creatures, stabbing with their sharp black horns before ripping their flesh off with their shiny fangs. The Horned Bee Beasts dug out deep holes on the eyes or heads of the Evil Eyes. The Evil Eyes that were under attack let out pathetic cries, struggling before they fell helplessly.</p> <p>Seeing the precise attacks of the Horned Bee Beasts, the leader of the Evil Eyes tried to consolidate their firepower. But they were slow, often losing their targets before they could even take aim.</p> <p>Under Yang Ling’s command, the Horned Bee Beasts made use of their speedy movements and forced the Evil Eyes to retreat. They sometimes scattered in the air, easily avoiding the light beams of the Evil Eyes; other times, they grouped together and attacked the defenseless Evil Eyes as a group. Sofia was shocked to see how powerful these Horned Bee Beasts were compared to their wild counterparts.</p> <p>Under Yang Ling’s command, a mere two hundred Horned Bee Beasts were enough to disrupt the Evil Eyes’ battle formation. The situation only turned slightly more advantageous for the Evil Eyes after their leader managed to successfully gather all the Evil Eyes.</p> <p>The power of the Evil Eyes’ attacks were improved as they combined their efforts and formed a rain of light beams. Even though the beams of light they shot out were still messy and all over the place, there were a few Horned Bee Beasts that were unfortunate enough to be hit.</p> <p>At the same time, the giant rocks around them became targets for the Evil Eyes, the light beams creating little holes within them. Even though the Evil Eyes could not launch an effective offensive, their firepower was decent. Perhaps that was how they got their status as low level Magical Beasts.</p> <p>With his speed, Yang Ling dodged the Evil Eyes’ attacks with Sofia in his arms. Soon after, seeing the holes on the giant rocks, Yang Ling came up with an idea.</p> <p>He told Sofia to hide behind a giant rock. Yang Ling did not retreat. Instead, he advanced. He bit on his right index finger as he charged quickly toward the Evil Eyes. At the same time, he commanded the Horned Bee Beasts to launch a full assault. Under his command, the Horned Bee Beasts attacked the non-vital areas of the Evil Eyes. They did not kill the Evil Eyes, but instead, they rendered the creatures unable to move or attack.</p> <p>Yang Ling did not stop. He dripped a drop of blood on the head of every injured Evil Eye. When Sofia wasn’t looking, he would consume a Blood Orb made by crystallizing blood essences from Magical Beasts, quickly replenishing the energy and wizard powers he spent taming the Evil Eyes.</p> <p>After coming into contact with Yang Ling’s blood, a silver glow enveloped the Evil Eyes. Mysterious symbols also appeared, creating an effect similar to what happened with the Horned Bee Beasts. At the same time, Yang Ling felt a streak of warm current enter his body. He also gained many more unfocused memories in his mind.</p> <p>After moving through the group, Yang Ling had soon managed to tame a large portion of the Evil Eyes. Counting them after the battle was over, he realized that he had tamed about two thousand Evil Eyes, so their numbers were similar to the Horned Bee Beasts. The price was that he had to consume more than two hundred Blood Orbs, all that he had gathered recently.</p> <p>“Yang Ling, this… This is the Ancient Summoning Magic?”</p> <p>Sofia was dumbfounded when she saw Yang Ling quickly taming the Evil Eyes. She had never expected that such a powerful Summoning Magic existed. He did not have to use magical powers, nor did he recite incantations; all he did was use a drop of blood to summon two thousand Evil Eyes. He lived up to his reputation of an Ancient Summoner of the legends.</p> <p>After giving a mysterious smile, Yang Ling did not confirm or deny Sofia’s statement. The Wizard’s Pagoda was a secret that his survival relied on, and he did not want anyone to know about it. Also, there were still many things he did not know about the Wizard’s Pagoda, so he couldn’t explain it even if he wanted to.</p> <p>Yang Ling’s face was rather pale even though he had consumed a large number of Blood Orbs. After all, he had tamed a large number of Evil Eyes. He was lucky that his wizard powers had improved after consuming the Water of the Spring of Life, and that the Evil Eyes were all injured by the Horned Bee Beasts; otherwise, there was no way he could have pulled it off.</p> <p>After resting for a moment, Yang Ling excitedly commanded the Evil Eyes into a formation. The firepower of the Evil Eyes wasn’t weak. Even though they required some time between attacks, this weakness could be offset with the correct strategy.</p> <p>Yang Ling recalled the famous three column cannon formation used by Napoleon when he thought about the ancient cannons used in the eighteenth century. He arranged the Evil Eyes into three rows, the first row prowling on the ground, the second squatting, while the third row stood. The three rows would fire successively. This way, he could create a continuous web of firepower. With the terrifying number of Evil Eyes he had at his disposal, his offensive capabilities were now greatly increased.</p> <p>Sofia looked at the busy Yang Ling. Slowly, her shock turned into admiration.</p> <p>He had a massive number of Horned Bee Beasts and excellent training methods. After summoning a large number of Evil Eyes, he could perfectly balance their strengths and weaknesses in the blink of an eye. Sofia felt that the more she learned about Yang Ling, the more shrouded in mystery he became.</p> <p>Buying a mountain of minerals with a large number of Essence Crystals might be unimaginable to many, but Yang Ling did not hesitate. He seemed to be a rich person who spent money like water, but when he was busy, he could do without his meals or fill his stomach with ordinary food. He did not have airs of a noble.</p> <p>Possessing a strange summoning magic and a large number of Magical Beasts, Yang Ling seemed to be a powerful Ancient Summoner of the legends. But he did not know what the foundations of magic were, nor did he know what a Space Ring was. In fact, he did not seem to know how expensive the Essence Crystal of a Magical Beast was.</p> <p>Even though there were many questions surrounding Yang Ling, Sofia instead became more attracted to him. With Yang Ling around, her life became radiant and full of laughter; when she saw the suave Yang Ling, her heart would unexplainably beat faster.</p> <p>“Yang Ling, how did you come up with this strange yet effective method?” Sofia instinctively took out her handkerchief and prepared to wipe his forehead when she saw the sweaty Yang Ling. But she felt a little embarrassed.</p> <p>“Haha, Sofia, I’ll tell you the truth, these ideas were all given to me by the Goddess of Nature!” After storing the Horned Bee Beasts and Evil Eyes into the strange space that was the Wizard’s Pagoda, Yang Ling gave a mysterious smile. “Let’s go, my elf beauty. If we do not make our way back soon, the tender orchids will be dried out by the sun!”</p> <p>Sofia blushed when she heard Yang Ling call her a beauty. She scanned Yang Ling with her large eyes before leaving. Besides her shyness, she had a sweet feeling in her heart.</p> <p>Referring to the memories of the Evil Eyes, Yang Ling understood that there were many deep caves within the valley, and in those caves were countless monsters. Legends also said it that there was a subterranean city sealed somewhere underground, overrun with monsters. His wizard powers were depleted, and he could not explore the valley even if he wanted to. All he could do was come back if there was a suitable opportunity.</p>",
  "Chapter 10: Magical Beast Army": "<p>Hunting was the best training. After taming a large number of Evil Eyes, Yang Ling seized opportunities to train their attacking and defending techniques in a variety of situations. In order to strengthen the natural battle abilities of the Evil Eyes, he would sometimes have one face off against a ferocious Magical Beast alone.</p> <p>Under his training, the nonchalant disposition of the Evil Eyes changed drastically. They would gather together when they sensed any action near them and blast the target with consolidated beams of light.</p> <p>Similar to the Horned Bee Beasts, the Evil Eyes also had an obvious transformation after staying in the mysterious Wizard’s Pagoda for some time. Their eyeballs changed from blue to a light green, and their tentacles became longer and more nimble. The beams of light they fired also changed from white to a pale green, from the size of a thumb to the thickness of a walnut. In the past, the beams of light could only create centimeter-deep holes in stone walls, but now, the holes the beams created here about half a chopstick deep.</p> <p>Today, Yang Ling was eyeing a Twin-horned Deer near some bushes. He waited silently for an opportunity to strike. Over the last few days, he had already led the Horned Bee Beasts and Evil Eyes to successfully take down several low level Magical Beasts and had obtained dozens of precious Magical Beast Essence Crystals. At the same time, he also gathered upward of a hundred Magical Beast Blood Orbs.</p> <p>The Twin-horned Deer had a slender body, the patterns on its fur an intertwining black and white. It had muscular limbs and was considered a mid-low level Magical Beast. It had the natural ability to release wind daggers. At full sprint, it could run as fast as the wind. To an average person, this was definitely a Magical Beast that was difficult to subdue. But to Yang Ling, this was not difficult; all he needed was to be patient and await the right opportunity.</p> <p>As it exhaled, the Twin-horned Deer released a thick bolt of wind, slicing apart the tender branches of a tree before swallowing them with a gulp. It flailed its tail, chasing away chopstick-sized bloodsucking flies.</p> <p>At the same time, Yang Ling cautiously created a formation with about two hundred Horned Bee Beasts. A moment later, seeing that the Twin-horned Deer had not noticed anything off, Yang Ling released half of his Evil Eyes and ordered them to silently occupy an area advantageous to them.</p> <p>A breeze blew past. The Twin-horned Deer straightened its ears, a little alarmed. It listened carefully to its surroundings; its nose twitched, as if it was trying to discern strange scents in its surroundings.</p> <p>Was the attack going to fail?</p> <p>Seeing that the Twin-horned Deer seemed to have noticed something, Yang Ling quickly collected himself and came up with an idea. He patted lightly on the Horned Bee Beast beside him. The little critter understood and slowly dug out from within the bushes. Over the days of practice, he had already tamed the Horned Bee Beasts to an extreme degree.</p> <p>The worries of the Twin-horned Deer vanished when it saw the Horned Bee Beast lazily searching for food. It continued munching on the tender branches, unaware of the danger that it was in. With winter approaching, it had searched everywhere for a mouthful of the sweet, tender branches.</p> <p>In the instant the Twin-horned Deer lowered its head, Yang Ling called for action. The Evil Eyes acted. In that moment, after a flurry of light beams, the body of the Twin-horned Deer became covered with bullet holes. It twitched for a second before collapsing onto the ground.</p> <p>“Haha, Essence Crystal number fifty!”</p> <p>Yang Ling sliced off the head of the Twin-horned Deer with a dagger and extracted a dark green Essence Core. He gathered the blood essence of the Twin-horned Deer into two thumb-sized Blood Orbs before allowing the Horned Bee Beasts to devour its body.</p> <p>After resting for a moment, Yang Ling recalled the Horned Bee Beasts and Evil Eyes before exploring the forest, searching for the tracks of his next prey.</p> <p>“Help me…”</p> <p>Yang Ling suddenly heard a pathetic cry as he was walking past a small hill. He listened seriously. He could hear the faint sounds of a battle. At the same time, the wind brought along the faint scent of blood.</p> <p>Could it be a hunter that came across a Magical Beast?</p> <p>There were not many people in the nearby forest, and it was rare to see anyone around these parts. In his confusion, Yang Ling followed the scent of the blood, jumping from tree to tree and quickly arriving at the scene. Ever since he successfully tamed the two thousand Evil Eyes, his power and speed had considerable improvements.</p> <p>“Hmph, you’re trying to escape? You are asking for death!” said a two-meter-tall barbarian as he walked toward a human dressed in tattered clothes. The axe in his hand was larger than a tire.</p> <p>The barbarian had a muscular build, his strength immense. He had been a fighter from birth, a powerful warrior from the mountains. It was said that the elite warriors from their tribe could go one on one against an Iron Lizard, a mid level Magical Beast, with their bare fists. Over the days, Yang Ling had gained an understanding of the area around the elf tribe because of the beautiful Sofia.</p> <p>“I’d rather die in battle than become your so-called sacrifice!” A human warrior covered in blood clenched a sharp wooden bat tightly in his hands. Behind him, other than a few warriors also covered in blood, twenty humans were huddled together in fear. There were old men, some children, and even a mother carrying a child.</p> <p>On the ground were dozens of human corpses, some decapitated, some split into two. There were even some who were smashed into pulp; dark red innards, bloody intestines… It was a shocking scene. It looked like what happened just now was a one-sided massacre.</p> <p>Taking a few steps forward, the barbarian leading the group licked the blood off his axe. “You filthy humans should feel lucky that you can become our sacrifice!”</p> <p>Seeing the barbarian’s red tongue, seeing him swallow the flesh stuck on his axe, the humans shivered in fear. Some closed their eyes tightly and prayed for the blessings of god; some had dazed expressions, as if they had lost their souls. Some immediately fainted after letting out a scream.</p> <p>The leading barbarian lifted his ax into the air and said fiercely, “Now, you only have two choices. Obediently follow us back and become our sacrifice, or die where you stand!”</p> <p>Looking at the merciless barbarians, hearing their raw threats, the human warrior standing in front tightened his grip on his wooden club. After considering it for a moment, he softly instructed the person behind him, “Argus, lead the rest to the south later. If I remember correctly, there is a tribe of forest elves in that direction. Even though we humans are not welcome by the elves, the elves that follow the Goddess of Nature will not leave us in the lurch!”</p> <p>“No, Casey, I am not leaving. We leave together!” Argus’s eyes were red. He clenched his teeth as he looked at the barbarians to the other side of them.</p> <p>A month before, in order to earn some money for his sick mother, Argus had followed the troops and Casey into the Terras Forest to hunt. But he did not expect to suddenly come across the terrifying barbarians after they had successfully hunted some Twin-horned Deer and were returning home with a few Essence Crystals. After they were captured, they were kept alive to be the sacrifice of the barbarians. Once every few days, one of them would be dragged out and thrown into a deep pit.</p> <p>Casey did not say anymore after he looked at the determined Argus. The elf tribe to the south was dozens of kilometers away. With how tired they were, how many of them would escape the pursuit of the barbarian mountain warriors?</p> <p>“Haha, since you are asking for death, then do not blame us for exterminating you!” The leading barbarian let out a cold grunt and ordered the group to charge forward. A few of the violent barbarians howled loudly as they charged.</p> <p>Casey looked to the west as he gripped his feeble wooden club, then charged forward without looking back. His hometown, Wissen Town, was to the west of Terras Forest. There, he had his benevolent mother, his little angel who was not even five years old yet, and his beloved wife.</p> <p>As he looked at the ferocious barbarians, the enormous axe that almost seemed to be growing as it came towards him, Casey did not ask for anything else. Dragging just one barbarian into the grave with him was good enough. But just as he was about to die together with his enemies, he heard buzzes in the air behind him. Following which, a group of ferocious Horned Bee Beasts flew past him like the wind.</p> <p>At the critical moment, Yang Ling had sent out his army of Magical Beasts. After the long training, the cooperation between the Evil Eyes and the Horned Bee Beasts had gotten better. It was a good time to test their battle abilities against these merciless barbarians.</p> <p>Caught off guard, the barbarians were instantly overwhelmed. Some of them were blinded, pressing their hands to their bleeding eyes and stumbling around like headless flies. Some called for their parents, pressing on their heads to prevent brain matter from spilling out. Some were reduced to bones in the blink of an eye, falling over in disbelief.</p> <p>If one were to compare the Horned Bee Beasts to a sharp blade, what the barbarians experienced next was the power of a cannon. A large group of Evil Eyes appeared out of thin air and quickly arranged themselves into a weird, half-moon formation before shooting out bolts of thick green light.</p> <p>Under Yang Ling’s command, the Evil Eyes shot out continuous light beams, creating a giant, intertwining web of firepower. Everything within their range of fire was mercilessly reduced into nothing. Even giant rocks were obliterated in the blink of an eye.</p>",
  "Chapter 11: Poison Stingers": "<p>Facing such a sudden, fierce attack, the unarmored barbarians suffered heavy casualties. Other than a lucky few, all of them were blasted into pieces by the light beams of the Evil Eyes.</p> <p>Seeing the barren land before them and the giant rocks blasted to smithereens, the people who were saved were dumbfounded. No one would have expected the merciless barbarians to be reduced to nothing in just the blink of an eye.</p> <p>“Thank you sir, for saving us!” After realizing that he was not dreaming, the surprised Casey knelt before Yang Ling. Quickly, under his lead, the rest of the people knelt as well.</p> <p>“Stand up, it was nothing, you need not pay too much heed to it!” After sending a group of Horned Bee Beasts to patrol the surroundings, Yang Ling returned the rest of his Magical Beast army.</p> <p>“Thank you for saving us!”</p> <p>“You will definitely have good karma for having such a good heart!”</p> <p>…</p> <p>After repeatedly thanking Yang Ling, the group of people stood up and cried tears of joy. They were incredibly excited, having successfully escaped with their lives. Only a skinny girl continued kneeling in grief. She cried and pleaded, “Sir, please save Alice’s grandfather, he is going to be pushed into the abyss by the barbarians!”</p> <p>The young girl cried as she crawled toward Yang Ling. Her eyes were red, swollen and filled with tears. Her knees seemed to be injured, perhaps scraped by the rocks on the ground. She left behind a trail of blood wherever she passed.</p> <p>“Sir, please save Alice’s grandfather, Alice is willing to become your servant until death, sir…”</p> <p>Alice cried as she lifted her head, her tears falling on her long eyelashes. Her large bright eyes were filled with boundless grief. Her skinny shoulders and slender waist made her look even more pitiful.</p> <p>Yang Ling had wanted to leave after saving this group of people, but he was unable to decline after seeing the pitiful Alice.</p> <p>At the same time, as they saw the grieving Alice, the rest of the group also wanted to kneel and plead for Yang Ling’s help. But when they recalled how heavily guarded the barbarian tribe was, as well as the brave warriors within the tribe, they began to hesitate. Even though Yang Ling was powerful, he was but one person. How could they allow their benefactor to risk his life?</p> <p>“Sir, we still have dozens of family members in the hands of the barbarians. Do you have any followers or partners around?”</p> <p>As a wandering troop for many years, Casey understood that a powerful Summoner like Yang Ling would have several powerful followers around him. If Yang Ling was willing to help, then saving the people from the barbarian tribe was not a hopeless situation.</p> <p>Followers?</p> <p>Yang Ling gave a bitter smile. He was alone, and the only reinforcements he had nearby were the elf tribe. But the elves were preparing for Ymir’s attack, so it wasn’t feasible to ask them for an army.</p> <p>After conversing for a few minutes, Yang Ling got the general idea of what happened. It turned out that the barbarians had captured a large number of risk takers who entered Terras Forest. They kept the humans captive, and they would drag one of them out once every couple of days and push them into a deep hole as a sacrifice.</p> <p>A few hours ago, Casey and the group had risked their lives and escaped their cells. But the barbarians reacted quickly. Most of the people did not have the opportunity to escape. And that included Alice’s elderly grandfather.</p> <p>“They’re using living humans as sacrifices?” Yang Ling shook his head. He recalled the African tribes back on Earth that roasted humans as if they were wild boars. He hesitated for a moment before clenching his teeth. “Since that is the case, then I guess I’ll have to make a trip there!”</p> <p>Even though the barbarians were powerful and had the numbers advantage, Yang Ling believed that even if he could not save everyone with his Magical Beast army, his abilities would be enough for him to escape to safety if he needed to. Heading to the barbarian tribe could not only allow him to save the captured humans, it would also reinforce his understanding of the local tribes of the area, a win-win situation.</p> <p>After Yang Ling agreed, the group once again knelt in thanks. Many of them still had relatives trapped within the tribe. Tears flowed when they remembered their faces and the sound of their voices.</p> <p>Without waiting, Yang Ling rejected the group’s request to follow, only bringing along Casey toward the barbarian tribe. Before he left, he released a Horned Bee Beast to guide the group to shelter at the nearby elf tribe. Even though the elves did not like humans very much, he thought that the elf elder would give him a little respect and allow the humans in.</p> <p>“Sir, wait for me, I want to go with you!” The little girl Alice followed, determined, after they had advanced a distance. Yang Ling and Casey had to let her follow despite advising her against it, seeing how persistent she was.</p> <p>The forest around the barbarian tribe was lined with ancient, sinister trees. The three of them would come across patrolling barbarian warriors or laughter from time to time, but under the guidance of the Horned Bee Beasts, they did not have to engage in any battles.</p> <p>Scratch, scratch, scratch…</p> <p>Suddenly, Alice missed her footing and screamed. Her scream jolted awake a sleeping Eber Eagle. Yang Ling saw the beast screech as it flapped its wings. In order to avoid getting the attention of the barbarians, Yang Ling let out a cold grunt and commanded the Horned Bee Beasts around him to swarm over, instantly shutting the mouth of the eagle.</p> <p>Alice was shocked when she saw the speed of the Horned Bee Beasts, and how they devoured the unlucky Eber Eagle in the air in an instant. Luckily, Yang Ling had fast reactions. He held her waist with one hand and covered her mouth with the other. “Shhh, careful. Don’t make a sound, or we will alert the barbarian scouts!”</p> <p>Hugging the petite Alice, brushing against her gentle, elastic skin, Yang Ling unintentionally caught a whiff of her faint fragrance. He instinctively looked downward. Her breasts were not large, but they were very perky. His heart was moved.</p> <p>At the same time, being embraced tightly by Yang Ling and smelling the scent of an unfamiliar man, Alice felt flustered, and her face turned red. But seeing a group of patrolling barbarians make their way past them, all she could do was quietly lean into Yang Ling’s embrace.</p> <p>After waiting for the barbarian scouts to pass them, the three of them once again continued on their journey. Along the way, they avoided the barbarians, finally arriving at the pine forest the tribe was situated in.</p> <p>The area was surrounded by mountains and a river, and the only way in or out was a three-meter wide road. It was easy to defend, but hard to attack. Even Yang Ling was not confident that he could make it in without alerting anyone, much less the injured Casey and the inexperienced Alice.</p> <p>“Sir, what are we going to do?” Casey was more and more impressed by Yang Ling after they managed to avoid the barbarian scouts under his lead. As for Alice, she would follow anything Yang Ling said. Yang Ling was now her only hope of saving her grandfather.</p> <p>Yang Ling quickly gained the necessary intelligence after sending out a few more agile Horned Bee Beasts, but the information was rather depressing. There were many barbarian warriors guarding both ends of the road. There were also many guards patrolling the waters, making it impossible for them to infiltrate using the river. In that moment, Yang Ling could not think of any ideas other than fight their way in.</p> <p>“Sir, what are we going to do? The sun is setting. If we don’t act soon, the barbarians are going to start their sacrificial ritual!” It was Alice’s grandfather’s turn to be sacrificed today. Alice was worried.</p> <p>Seeing a thick black smoke rising from the barbarian tribe, as well as waves of wolf-like howls, Casey also became worried. The black smoke was the nightmare of the captured humans. Every time the black smoke rose, it meant that there would be one person thrown into the deep hole near the sacrificial altar of the barbarians.</p> <p>“Sir, what are we going to do? Sir…” Alice’s eyes were red and swollen. She was worried out of her mind. If not for Casey grabbing tightly on her right hand, she might have charged forward without any deliberation.</p> <p>What about a decoy?</p> <p>Yang Ling suddenly had an idea as he looked at the narrow road and the barbarians guarding it. He came up with a bold plan. “Casey, charge out and pretend to attack, remember not to run up to them; Alice, get us some of the wild vines that are growing around the area, the more the better. You are in charge of tying the barbarians up.”</p> <p>Even though he did not quite understand Yang Ling’s reasoning, Casey charged out without hesitation. Alice also quickly sprang into action. At the same time, Yang Ling jumped into the treetops and concealed himself.</p> <p>“Die!” Casey lifted a barbarian’s giant axe he had picked up and charged toward a barbarian.</p> <p>“Haha, trying to invade a tribe alone, you sure are dumber than a Sharo Boar!”</p> <p>“Ha! You’re asking for death!”</p> <p>…</p> <p>The barbarians guarding the road laughed heartily when they saw Casey returning alone to invade the camp, not thinking too highly of him. But just as they were certain that the barbarians in front were going to split Casey in half, they suddenly heard them let out pathetic cries before slumping onto the ground.</p> <p>“D*mn it, you’re asking for it!”</p> <p>In their surprise, the barbarians charged forward, planning to turn Casey into mincemeat. Unexpectedly, they had just seen a Horned Bee Beast charging over when they felt their chests turn numb. They then felt as though they had lost their strength, and they could only watch helplessly as Casey kicked them away. Then Alice tied them up tightly.</p> <p>At the critical moment, Yang Ling had thought to use the hundred Horned Bee Beasts that evolved to the second level. They could shoot out three poisonous stingers a day. Even though the poison was not enough to kill, it could make his enemies numb and render them incapable of movement or battle.</p> <p>Even though the barbarians were powerful, they had almost no armor, making it hard for them to avoid the stealthy Horned Bee Beasts’ poisonous stingers. Yang Ling believed that as long as he was able to capture a batch of barbarian warriors, he could naturally do a hostage exchange with the leader of the barbarians. He might even be able to extort them.</p>",
  "Chapter 12: Who’s the Most Barbaric of Them All?": "<p>Seeing their tribesmen falling with Casey’s every move, the barbarians nearby were as surprised as they were angry. They pounced forward. No one noticed that fist-sized Horned Bee Beasts had appeared in the treetops and bushes.</p> <p>“Kill!” Casey shouted as he charged toward the nearest barbarian, his heart filled with excitement. He did not expect Yang Ling to come up with such a marvelous plan. If he previously was in awe of Yang Ling’s powerful abilities, he was now convinced of the man’s extraordinary intelligence.</p> <p>“Don’t move, I’ll turn nasty if you move!” Alice clenched her teeth as she tied up the barbarians who had lost their strength. She was excited and nervous when she saw the barbarians, who had arms thicker than her waist. She was afraid that these scary beings would jump up suddenly.</p> <p>As the chaos continued, the thick smoke in the distance slowly scattered. It was clear that the barbarians’ sacrificial ritual had been disrupted. The more hostages they could tie up now, the more possible saving her grandfather became. Alice became more and more excited, glancing toward Yang Ling in the treetops from time to time.</p> <p>To Alice, Yang Ling was a mysterious person. She had never seen a Summoner who could summon this many Magical Beasts, nor had she seen a Summoner who would choose to control low level Magical Beasts such as Horned Bee Beasts and Evil Eyes. But without a doubt, Yang Ling’s abilities were alarming, very alarming!</p> <p>Other than his alarming abilities, Alice had also never seen a man with that black hair and those black eyes. His gaze was sometimes fiery like a ball of flame, sometimes deep like the abyss. But no matter what, Alice could not forget the feeling of his tight embrace, that strange feeling of being flustered and nervous.</p> <p>In their rage, the barbarians charged over like moths to a flame. But as the road was too narrow, they could only approach two at a time. There was no way for them to take advantage of their numbers. The barbarians behind roared loudly in their anger.</p> <p>Every time a barbarian charged forward, one of the Horned Bee Beasts that were hiding nearby shot out a near-transparent poison stinger at the critical moment, making their bodies numb before Casey struck them with an axe.</p> <p>Seeing how powerful Casey was, the violent barbarians were alarmed and angry, but they did not suspect anything in the moment. Just like that, the more barbarians that charged forward, the more hostages they captured. Even Alice’s arms were tired from tying the barbarians up, much less Casey, who was doing battle. Slowly, the casualties of the barbarians increased.</p> <p>“A bunch of fools, stand down, now!” Just as Yang Ling was worried that he would run out of poison stingers, the leader of the barbarians finally arrived with a group of elite guards. “Since we have friends visiting the barbarian tribe, why don’t you show yourselves?”</p> <p>Feeling a large amount of killing intent rushing past him, Yang Ling realized that while he could fool the average barbarian, he could not deceive the wily old fox that was the leader of the barbarians.</p> <p>Yang Ling had just exposed himself when a messenger beside the leader of the barbarians shivered. He told the leader in fear, “Chief, that’s him. His Magical Beasts destroyed everything!”</p> <p>After escaping with his life, the messenger of the barbarians had fearfully reported the situation to the leader. To him, Yang Ling, who could summon a large number of Magical Beasts to do battle, was a demon. In fact, he might even be more terrifying than a demon.</p> <p>“Horned Bee Beasts that have evolved to the second stage, hmph, so that’s why!” The leader of the barbarians was observant, quickly noticing traces of the Horned Bee Beasts and understanding the secret behind Casey’s power. He stared coldly at Yang Ling. “Just who are you, and why have you come here?”</p> <p>“I am Yang Ling, and the reason for me coming here is simple!” Yang Ling laughed coldly and said with a friendly tone, “Hand over your captives, then pay for my losses today, that’s all!”</p> <p>The leader of the barbarians had not said anything when a muscular warrior beside him howled, “Rubbish! Since you dare come here, don’t even think about leaving alive! Asking us to hand over our captives is even more ridiculous, hmph!”</p> <p>Seeing the barbarians who were all talk, Casey and Alice heaved a sigh of relief. Between the shadows of the trees and the story of the mysterious Summoner, it looked like Yang Ling had already struck fear in the hearts of the barbarians before this battle. Otherwise, if it were someone else, the leader of the barbarians might already have attacked them with an army.</p> <p>Casey and Alice sighed in relief, but the pagoda mark on Yang Ling’s forehead throbbed suddenly. Yang Ling exercised caution and immediately sent a team of Horned Bee Beasts to scout the surroundings. True enough, he soon realized that a large group of barbarians were sneaking over under the water. The other party was using a method of diversion.</p> <p>Advancing through an unknown path?</p> <p>Yang Ling let out a cold smile, quickly forming another idea. Since the barbarians were going to use sneaky tactics, he did not mind giving them a surprise.</p> <p>“Sir Yang, since this is the first time we are meeting, let me give you a present. You must accept it!” After hearing the report of the messenger and understanding that the barbarians responsible for the ambush were in position, the leader of the barbarians became confident. He shot a look to the guard beside him and the latter immediately threw a heavy bag toward Yang Ling.</p> <p>Out of curiosity, Casey took large steps forward and opened the bag. But his face quickly turned pale. He pointed to the barbarians, unable to say anything. Alice looked over in confusion and immediately screamed, her body shivering. In the bag were three bloody human heads, their eyes bulging. They had all died unjustly.</p> <p>“Great, great, great, this present is not bad!” Yang Ling laughed in fury. “I should return a gift. Since it’s the first time we are meeting, I’ll return a small gift to the tribe!”</p> <p>Eye for an eye, blood must be repaid with blood!</p> <p>After catching the scent of blood, the horde of Horned Bee Beasts became excited. If not for Yang Ling’s control, they would have charged toward the captured barbarians and started tearing their flesh. For revenge, and more to give a threat, Yang Ling did not mind giving the barbarians a display of the Horned Bee Beasts’ power.</p> <p>Under the confused gazes of the barbarians, Yang Ling softly clapped his hands. In that instant, a large group of Horned Bee Beasts flew out of the treetops and bushes. After circling the air for a moment, they charged toward the captured barbarians.</p> <p>“No… Save me!”</p> <p>“Chief, save us…”</p> <p>…</p> <p>The captured barbarians struggled, but the Horned Bee Beasts latched onto them tightly, tearing away a large amount of flesh whenever they attacked. In the blink of an eye, some of the barbarians rolled on the ground in pain, their intestines spilling out. In fact, some even got devoured in an instant, leaving behind nothing but a few strands of hair.</p> <p>Seeing the hellish sight before them, hearing the pathetic cries of their clansmen, even the merciless barbarians felt their skin crawl. Even the leader of the barbarians was not spared. Yang Ling’s present was too shocking, and they did not expect that there would be someone more barbaric than them on this continent.</p> <p>“Hmph, let’s see who’ll have the last laugh!” The leader of the barbarians waved his arms after clenching his teeth. In that instant, a large group of barbarians emerged from under the water. They charged toward Yang Ling with their gleaming axes raised high.</p> <p>Caught off guard, Casey turned pale. He clenched his teeth and charged forward with his ax, determined. “Sir, leave and take Alice, quick!”</p> <p>“Sir, what are we going to do?” Alice was dazed. She looked helplessly at the large group of barbarians charging over, not noticing the large group of bloodthirsty Evil Eyes behind her.</p> <p>“It’ll be fine, don’t worry!” Yang Ling carried the scared Alice and said coldly, “There’s a solution to every problem. Since these barbarians are rushing to their deaths, then let us send them on their way!”</p> <p>At the same time, looking at the howling barbarians, Casey felt a mixture of emotions. To think that he would have to meet his maker so soon after being saved by Yang Ling. He so wanted to return home. But if he was to do this again, he would also charge forward without hesitation.</p> <p>“Kill!”</p> <p>Casey lifted the giant ax in his hands high in the air, but he had not struck downward when it happened! Pathetic cries rang out as the barbarians charging toward him were blasted into mush by a condensed webwork of light.</p>",
  "Chapter 13: Barbaric Negotiations": "<p>Seeing a large group of elite warriors obliterated in the blink of an eye, the barbarians were dumbfounded. Previously, they hadn’t really believed the barbarian who was lucky enough to escape, but now that they were witnessing it for themselves, they felt deeply the shock and terror brought about by the beams of light.</p> <p>Shocking, it was too shocking!</p> <p>Every barbarian present was petrified. To the mountain warriors, Evil Eyes were the weakest low level Magical Beasts in Terras Forest, with nonchalant personalities and slow movements. Even four or five of them attacking together was no match for a barbarian, much less one. They did not expect that the power of these useless Magical Beasts would become so terrifying after Yang Ling gathered them together.</p> <p>“Sir Yang, if this is the full extent of your abilities, I do not think that you will be able to destroy our entire tribe!” The leader of the barbarians swallowed hard. “Horned Bee Beasts that have evolved to the second stage can only launch three poisonous stingers a day. The magical powers of the Evil Eyes are also limited, and they cannot attack over a long period of time. As long as we stand guard over the castle, there’s no way your attack will be successful!”</p> <p>Even though they had suffered heavy casualties, the leader of the barbarians was unwilling to submit. Barbarians were natural warriors of the mountains. Since ancient times, there were only barbarians that died in battle. There were never barbarians that knelt and begged for mercy.</p> <p>“That’s right, I cannot take down your entire tribe!” Yang Ling admitted it honestly, much to everyone’s surprise. “But as long as the Magical Beast army under my command is standing guard outside of your tribe, there’s no way for you to hunt out in the forest. In that case, how long can you hide in your castle?”</p> <p>Seeing Yang Ling directly expose the weak point of the barbarian tribe, the eyelids of the barbarian leader twitched, sensing the unfavorable situation. He deliberated for a moment before saying, “Sir Yang, do not forget that this is the Terras Forest, and we are only a small branch tribe of barbarians. We can call upon the help of other barbarian tribes at any time!”</p> <p>“Haha, what a joke. Even if the other barbarian tribes are willing to help, when can they reach this place? Are they going to come here to clean up your corpses for you?”</p> <p>Yang Ling smiled coldly. After a pause, seeing the green-faced leader of the barbarians, he continued, “As an Ancient Summoner, I am merely a small fry in my family. As you can see, I can only control low level Magical Beasts like Horned Bee Beasts and Evil Eyes. But my elders are different; the high level Magical Beasts can level your tribe with numbers alone, much less with their offensive capabilities. All I have to do is set up a Teleportation Spell, and they can provide reinforcements immediately!”</p> <p>Just as the leader of the barbarians had said, the magical powers of the Evil Eyes had been depleted after their continuous attacks. If a group of barbarians were to charge forward now, merely escaping unscathed would prove to be a problem. At the critical moment, Yang Ling had decided to take the risk and exaggerate his powers.</p> <p>Ancient Summoner? The leader of the barbarians had a shocking revelation, finally understanding why Yang Ling was able to summon so many Magical Beasts into battle.</p> <p>The leader of the barbarians was confused when he looked at Yang Ling and his cold smile. He could not understand how he had offended a terrifying person like him. Even though the barbarians were violent, they had been living in the Terras Forest for thousands of years, and they understood more than anyone how terrifying Ancient Summoners could be.</p> <p>According to the records of their clan, a long time ago, there was a powerful barbarian empire on the continent, its borders vast beyond imagination. But the twenty-eighth king unknowingly offended a mysterious, powerful family of Ancient Summoners. The Ancient Summoners then summoned a horde of Magical Beasts to invade the kingdom, massacring the entire royal family in just a night. In the end, the barbarian empire became overrun, its power declining over time. The barbarians slowly exited the main stage of the continent and became recluses within the forests.</p> <p>How could the leader of the barbarians dare to act rashly, if even a mighty barbarian empire was no much for a family of Ancient Summoners? The leader of the barbarians felt his skin crawl just thinking about the powerhouse behind Yang Ling. After repeatedly weighing the pros and cons, in order to ensure the continuity of the clan, all he could do was give up on the idea of defending the area. He said uneasily, “Sir Yang, might I ask why you have come to our tribe?”</p> <p>“Simple, I have said it before. I’ll call off my troops after you have released your captives and paid us for our losses!”</p> <p>“Alright!” The leader of the barbarians was forthright, immediately nodding his head. He instructed his guards loudly, “Release all the captives immediately, quickly!”</p> <p>After receiving the order, a few of the barbarians left quickly. Soon after, they brought out a large group of captives, young and old. Among them was Alice’s grandfather.</p> <p>“Grandpa, Alice can finally see you again, Grandpa…”</p> <p>Seeing the familiar figure, Alice charged forward without a care in the world. To be reunited after such a crisis, the pair huddled together and cried. At the same time, the rest of the captives shed tears, all thankful to Yang Ling for saving them.</p> <p>“Good, chief, since you were going to do that anyway, why be so violent in the first place?” Looking at the uneasy leader of the barbarians, it was as if Yang Ling saw an extremely fat lamb, ready for slaughter. He smiled. “Now, let me calculate our compensation. Ten Purple Crystal Coins for every injured human captive, twenty for every dead. Is that fair?”</p> <p>“Alright, count it as twenty for every person!” The barbarian leader agreed readily. All he wanted to do now was to send the plague that was Yang Ling away as soon as possible. He would have paid fifty Purple Crystal Coins per person, much less twenty.</p> <p>After counting the numbers of human captives and consolidating the total amount to be paid, Yang Ling smiled and said, “Chief, the compensation for the captives has been calculated, a total of two thousand five hundred Purple Crystal Coins. Now let’s talk about compensation to me. Five hundred Purple Crystal Coins for every Magical Beast, a total of twelve. We can count my effort as twenty-five thousand Purple Crystal Coins. As for my mental strain, that’s fifty thousand coins. So the total would be eighty thousand Purple Crystal Coins!”</p> <p>Eighty thousand Purple Crystal Coins?</p> <p>Even Casey and the rest were dumbfounded when they heard the number, much less the barbarians. The teary captives even suspected that they were dreaming! A few moments ago, they had just been despairing in the jail of the barbarians. Now, they had not only escaped with their lives, they might even receive sums of money as compensation.</p> <p>“You…” The leader of the barbarians was furious. He had expected Yang Ling to ask for a little extra as compensation, but he hadn’t thought that the Ancient Summoner would extort him, using his so-called “mental strain” as an excuse to ask for eighty thousand Purple Crystal Coins.</p> <p>Could he be using this as an excuse to continue his attack on the tribe?</p> <p>After taking in a deep breath, the leader of the barbarians changed his expression. He tried his hardest to cover up his unease and thought about something terrifying. After hesitating for a moment, he said, “Sir Yang, to tell you the truth, we do not come into contact with the outside world very much. We only have at most two thousand Purple Crystal Coins in the tribe!”</p> <p>“Sigh, that’s troublesome!” Yang Ling pretended to be having an internal struggle. “Do you have any specialty items, like Essence Crystals of Magical Beasts or Dark Fire Crystals? Even though there’s not a good market for them, they are still worth some money!”</p> <p>After listening to Yang Ling, the leader of the barbarians heaved a sigh of relief. He realized that Yang Ling was only after wealth. He then creased his brows. As powerful mountain warriors, they had indeed gathered a decent amount of Magical Beast Essence Crystals over the years. But it might not satisfy Yang Ling’s appetite even if they brought all of the crystals out.</p> <p>“Chief, it is understandable that you cannot cough up enough coins or Essence Crystals in such a short amount of time!” Yang Ling gave a friendly smile after seeing the barbarian leader crease his brows. “You have a large number of brave warriors and can take the time to hunt Essence Crystals or dig for Dark Fire Crystals to settle your debt. I can extend the deadline for you!”</p> <p>Yang Ling deployed the offer as bait. There were many Dark Fire Crystals in Valenia Valley, and the barbarians were strong and powerful. They would make excellent laborers. Other than that, the barbarians were notorious within these parts, and their appearance was ferocious. No one would dare mess with them.</p> <p>With such bait, Yang Ling and the leader of the barbarians signed a seemingly fair contract. The barbarians would provide Yang Ling with a hundred Magical Beast Essence Crystals and two full carts of Dark Fire Crystals once a month for a total of two years. Yang Ling would generously release the rest of the captured barbarians and promise to supply the barbarians with essentials such as salt.</p> <p>After saying goodbye to the leader of the barbarians, Yang Ling led the satisfied group south, toward the tribe of forest elves. Along the way, the people who survived the crisis were joyful, repeatedly thanking Yang Ling for saving them.</p> <p>Yang Ling had returned satisfied, but a giant storm was brewing in a magnificent castle in Wissen Town, a thousand miles away from the forest.</p> <p>“Yiblis, don’t be so rough, ouch…” Ymir was sprawled on the bed, his hand resting against his bloody butt that had been torn into shreds by the Horned Bee Beasts. He kicked the old man. “Scram, get a maid in to help change the medicine!”</p> <p>Ymir had been unable to sit ever since the battle against the elf tribe. His buttocks were swollen and torn, and his temper was becoming worse and worse.</p> <p>“Goode, gather all of the warriors immediately. I want to bathe the elf tribe in blood. I want to tear out the brains of that Summoner!”</p> <p>“Young master, this…” Goode, who was dressed fully in black, was put in an awkward position. He chose his words carefully. “Half a month ago, the master took a large group of elite warriors to see. It does not seem to be a good opportunity for revenge!”</p> <p>“I don’t care! I want to kill that detestable Summoner, and I want to sell all those elves to the most wretched brothel!” Ymir roared as he punched the bed under him. He had never experienced such a humiliation growing up. The warriors he had brought along with him were exterminated. He had almost lost his life.</p> <p>Seeing the agitated Ymir, the strategist Goode hesitated for a moment. “Young master, through my efforts, I have managed to establish a secret correspondence with a member of a guild of assassins. What if we…”</p> <p>…</p> <p>After a secret discussion, Goode silently left the room while Ymir laughed heartily. He slipped his hand into the blouse of the maid and pinched her supple breasts.</p>",
  "Chapter 14: Date with a Female Assassin": "<p>Along the way to the elf tribe, Yang Ling conversed with the group of people and learned more about their difficulties. Most of them had fallen into traps set up by the barbarians when they took the risk of hunting in the Terras Forest. There was also a small group of them who were captured by the barbarians while they were on the outskirts of the forest. These people included Alice and her grandfather.</p> <p>“I heard that the Anca family in Wissen Town is very powerful and loves to do good deeds. Why did they not do anything against the brazen barbarians?” After realizing that most of the people here came from Wissen Town, Yang Ling asked a question he already knew the answer to. He wanted to learn more about the Anca family from them.</p> <p>“Hmph, the evil Anca family has harmed many people!” Alice’s grandfather clenched his teeth. “My name is Brulis. I was the owner of a small wood processing factory in the town. Even though I was not rich, I could still get by. But the Anca family saw how well my factory was doing and employed a scheme, destroying my family. I encountered the barbarians after Alice and I luckily escaped from their clutches…”</p> <p>Brulis had tears in his eyes as he thought about his family. He hugged Alice tightly, the only family he had left.</p> <p>“That’s right. Sir, what you do not know is that there are no atrocities that the Anca family would not commit. If not for their extortions, why would we risk our lives and hunt deep in the forest?”</p> <p>Seeing the pitiful Brulis, Casey also started narrating his story, his eyes harboring a seething fury. Then, the rest of the group also told Yang Ling about their lives. The evil Anca family were the masterminds of all their suffering. They cursed Ymir and his ancestors, and they cursed the descendants of the Anca family to all die tragic deaths.</p> <p>Through his indirect questions, Yang Ling understood that the Anca family was in control of over thirty percent of the wealth in Wissen Town. They not only had over five hundred servants, they also had dozens of terrifying gryphons. They were the most powerful organization in Wissen Town. Because of their rampant extortions, the townspeople were all extremely unsatisfied with the Anca family, but they could not do anything about it because the Anca family was too powerful.</p> <p>After thinking for a moment, Yang Ling came up with a preliminary plan. Even though the Anca family was powerful, they had many enemies. Yang Ling might be able to attack them using the conflict between the Anca family and the townspeople. Rather than wait for Ymir to attack them with his army, it would be better to strike first. After all, with the large numbers of Horned Bee Beasts and Evil Eyes guarding him, as well as the gryphon and its speed, he should be able to escape unscathed even if the attack failed.</p> <p>When they reached the elf tribe, the humans were treated well by the elves, mostly due to the respect the elves had for Yang Ling. Sofia was very busy, sometimes arranging food and lodging for the people, and other times leading a few healers to heal the injured with their Regeneration Spells.</p> <p>After satisfying his hunger, Yang Ling went on a stroll in the forest alone. Over these last few days, he was becoming more and more certain that he had unintentionally stumbled into another universe. There were no planes or cannons here, nor were there televisions or the internet; but there were powerful and mysterious spellcasters, a primordial forest spanning thousands of miles, as well as beautiful girls of different races…</p> <p>“Should I marry a few elf beauties and give birth to a bunch of mixed blood kids?” Yang Ling let out a bitter laugh as he recalled Sofia and her bright, large eyes, as well as her slender waist.</p> <p>Just as Yang Ling was in a daze, he suddenly heard the sound of something slicing through the air. An arrow was flying through the air, aimed directly at his chest. Following that, a dark shadow charged over with a silver dagger in hand.</p> <p>At the critical moment, Yang Ling jumped to the side, twisting his waist to avoid the fast arrow. He then fell and rolled on the ground, causing the dagger to miss its target.</p> <p>“Who are you?”</p> <p>Yang Ling stood up, staring straight at the masked person. He felt as though he had become the target of a poisonous snake, not daring to move. At the same time, he was sending a silent emergency message to the Horned Bee Beasts and Evil Eyes at the elf tribe.</p> <p>“Even if I do not kill you, there will be others who will do it. All you need to know is that your head is now worth a thousand Purple Crystal Coins.” The masked person spoke with an icy tone.</p> <p>Yang Ling did not dare be careless, but the masked assassin was more nervous than he was. This was her first solo operation, and if she failed, she would be severely punished by the association. The intelligence she received described Yang Ling as a powerful Summoner, but she did not expect his physical skills to be more nimble than a thief’s. He had easily avoided her meticulously planned attack.</p> <p>After clenching her teeth, the masked assassin waved her dagger and charged forward. They were not far from the elf tribe, and her opponent was a mysterious, powerful Summoner. The situation would become more and more unfavorable for her the more time passed.</p> <p>Taking a deep breath, Yang Ling chose to advance, charging forward with his bare fists. He understood that against a speedy assassin, running away in a panic would make his death even more swift. Furthermore, he had gained great strength and nimble movements after cultivating the mysterious Wizard Mantra. He believed that he would be able to last in combat until his Magical Beasts came to reinforce him.</p> <p>Cautiously, Yang Ling fought the masked person. The masked person had a dagger in hand and used merciless techniques, each strike aiming for Yang Ling’s vital points. But Yang Ling was more nimble and had more strength. His fists cut the wind with strength.</p> <p>“Brother Yang, where are you?” Just as their battle approached a stalemate, an anxious cry rang from nearby.</p> <p>Hearing the shout approach them, the masked person trembled and increased the speed of her attacks. Yang Ling let out a bitter smile. Why did Sofia have to come now of all times? It would be troublesome if she were to encounter the partners of this masked assassin.</p> <p>Clenching his teeth, Yang Ling bore the brunt of his opponent’s kick and charged forward, returning a fierce kick to the masked person’s right arm. He removed the threat of the dagger and pressed down on the other party before pulling away their mask.</p> <p>“Oh, you… A female assassin?” Yang Ling was at a loss when he saw the assassin’s long lashes and blonde hair. He did not expect the masked assassin to be such a beautiful lady.</p> <p>He had not noticed it when they were battling, but now that he was pressing down on the female assassin, he felt the curves of his opponent’s body. At the same time, he caught a whiff of an intoxicating fragrance. Looking at the woman’s fair, sexy neck at such a close distance, feeling her warm, supple skin, Yang Ling quickly had a normal male reaction.</p> <p>“Die, pervert!”</p> <p>Just as Yang Ling was about to knock her out with a punch, the female assassin suddenly pushed with her right hand, the ring on her index finger slicking along his throat.</p> <p>The ring of the female assassin was dark and shiny, obviously coated with a layer of poison. Other than that, there was a cold light reflecting off the ring, its silhouette sharp. Yang Ling knew that if his reactions had been a second slower, there would have definitely been a life-threatening wound along his throat.</p> <p>After rolling away, the female assassin struck down with her leg without waiting for Yang Ling to stand. The look she gave and her clenched teeth seemed to reflect her desire to dismember Yang Ling.</p> <p>“Haha, great attack!” Yang Ling was no longer flustered now that there was no threat of a dagger. He twisted his body and avoided the female assassin’s attack, then grabbed her soft right leg. The female assassin struggled in shock, but she hadn’t expected her shoe to remain in Yang Ling’s hand even after she successfully pulled her right leg back.</p> <p>“Hmph, you have avoided death this time, but you’ll not avoid it the second time!”</p> <p>After her attack was blocked, the female assassin heard Sofia’s approaching footsteps and understood that she had already missed the optimal opportunity. She gritted her teeth and retreated decisively. She turned to glare at Yang Long before vanishing into the forest.</p> <p>Seeing how speedy the female assassin was, Yang Ling did not give chase. After all, who knew if there were any ambushes deeper in the forest?</p> <p>“Brother Yang, who was that woman just now?” The female assassin had just left when Sofia rushed over anxiously. “Oh, what a slender, petite shoe! Where did you get this? Could it be…”</p> <p>“Sofia, why have you come here? Be careful of encountering the female assassin and her partners!” Yang Ling shook her head as he looked at Sofia breathing heavily. If she had carelessly encountered the partner of the assassin just now, it would have been disastrous.</p> <p>Female assassin?</p> <p>Was there a female assassin in this world that would give the target she was assassinating one shoe? Sofia clearly did not believe Yang Ling’s weak excuse. She had a faint idea of what was going on.</p> <p>“Brother Yang, I was too reckless. I disrupted your date!”</p> <p>Seeing the petite shoe in Yang Ling’s hand, then thinking about the figure of the woman in black escaping into the forest, Sofia felt a sense of loss. Her nose twitched as she turned around and began running back to the tribe.</p> <p>Tonight, she had wanted to spend some time alone with Yang Ling after seeing that he had left by himself. But she did not expect to encounter Yang Ling going on a date with another woman.</p> <p>Date?</p> <p>A date with a female assassin?</p> <p>Yang Ling shook his head as he looked at Sofia, who had run away crying. He let out a self-mocking smile. “This date… It sure is out of the ordinary!”</p>",
  "Chapter 15: Tree Shepherd": "<p>After the incident with the female assassin, Yang Ling returned to the elf tribe and fell asleep immediately. Even though he knew that Sofia had misunderstood him, it would be difficult to explain the situation fully. Since it was hard to explain, and further explanation would feel too much like an excuse, he decided to let fate take the wheel for the time being.</p> <p>Even though Yang Ling could not find his way back to Earth, he had decided to adapt to this environment, rather than grumble all day long.</p> <p>His life was currently leaping from the frying pan into the fire; but since he was already in mid-air, he might as well enjoy the heat from the flames. As he was falling asleep, Yang Ling recalled that classic sentence he had seen on the internet a few years ago.</p> <p>Even though Yang Ling was a little surprised that Ymir would employ an assassin to take his life, he did not become overly fearful. After all, what was going to come would come regardless of what he did. The only way to deal with this was to quickly increase his abilities. This was similar to how one would never know what beast one would come across when hunting in the forest; only hunters who were strong enough could survive the repeated attacks.</p> <p>Sofia is beautiful. It seems… that female assassin was beautiful too!</p> <p>Yang Ling recalled Sofia’s large, glistening eyes and her slender, huggable waist. The scene soon changed into the female assassin’s icy cold face.</p> <p>Some time later, Yang Ling heard a fleeting tune in his daze. Amidst the rustling of the trees, he could faintly hear the cries of a young girl. The sounds also seemed to be the incantations of a priest in prayer.</p> <p>After listening intently to the sound, Yang Ling silently headed in the direction where the sound was coming from. Stepping on the dew covered grass and making his way past a clear stream, he arrived at a vast pine forest.</p> <p>Sofia, who was dressed in white, walked around a majestic tree barefoot. She was silently muttering something using the ancient language of the elves. It sounded like a folk song of the elf tribes, but also like she was whispering something toward the ancient tree. Her eyes were watery, tears falling after every round.</p> <p>Be it coincidence or an illusion, Yang Ling felt the ancient tree creak with every tear Sofia dropped, as if it was responding to Sofia.</p> <p>“Sofia!” Yang Ling could not help but shout when he saw the pitiful elf girl and her tear-covered face.</p> <p>“Yang Ling, you… Why are you here?” After wiping the tears off her face, Sofia quickly stopped circling the tree, her face red.</p> <p>“I dreamed of a beautiful woman just now and heard your song!” Yang Ling smiled and walked over with large strides. He sat beside Sofia. “So, beautiful elf lady, you spoiled my dreams. Tell me, how are you going to compensate me for my losses?”</p> <p>“Compensate, my foot!” Sofia blushed when she saw how Yang Ling was joking with her. She hesitated for a moment before silently asking, “What are you doing out here so late at night? Are you not going to accompany the woman you are dating?”</p> <p>Dating?</p> <p>Seeing Sofia’s teary eyes, Yang Ling seemed to have understood something. He shook his head and laughed bitterly. “Sofia, that woman was an assassin, and I nearly died in her hands earlier. Which part of that sounds like a date?”</p> <p>“Hmph, you humans are all the same. You men are all more of a casanova than Hasmere!” Sofia’s eyes were red, clearly not believing Yang Ling. What female assassin would give her target her petite shoe? It was rumored that humans were incredibly flirtatious and would often look at other ladies despite having a beautiful wife. It looked like those rumors were true.</p> <p>Lies were more believable than truths, and it looked like that was the same for both worlds.</p> <p>After shaking his head and letting out a bitter smile, Yang Ling understood that he was going to make the situation worse if he explained himself further. He quickly changed the subject. “If this tree truly has spiritual qualities, then you spinning around it like that would surely make it giddy, even if you are not!”</p> <p>“Giddy my foot!” Sofia burst into laughter. “This is the oldest tree in our tribe, having over eight thousand years of history. Even though it is unable to nurture Withered Tree Guardians, it has the highest spiritual qualities. It can understand whatever I tell it!”</p> <p>An ancient tree with spiritual qualities?</p> <p>Seeing Sofia lean toward the ancient tree as she was explaining it, Yang Ling became excited, also leaning over. Suddenly, an indescribable ripple spread toward him from the tree. The ripples resonated with the rhythm of his heartbeats, as if it was saying something.</p> <p>A spirit born from an ancient tree?</p> <p>Yang Ling recalled the ghost stories he had heard when he was young, and he suddenly had an idea. The mysterious wizard techniques could tame Magical Beasts; they might work on tree or mountain spirits too.</p> <p>Secretly, Yang Ling bit on his right index finger and pressed it down on the tree. In that instant, the wound seemed to have come into contact with a bottomless pit, his blood and wizard powers flowing out like the Yellow River.</p> <p>“Ah, Yang Ling, what happened to you?”</p> <p>Seeing Yang Ling trembling and turning pale, Sofia shouted in shock. But just as she was about to step forward and support him, Yang Ling let out a low grunt and swallowed a bunch of blood red orbs he had taken out of his robes. Following which, the giant tree vanished without a trace.</p> <p>In his daze, Yang Ling once again unintentionally arrived at the mysterious space of the Wizard’s Pagoda. All he saw was a giant tree in front of the tall Wizard’s Pagoda. Groups of Horned Bee Beasts and Evil Eyes were circling the tree. Some of them even climbed straight up the trunk of the tree, resting peacefully on its branches.</p> <p>The tree had lush, green leaves. For some reason, Yang Ling felt a sense of familiarity. He walked over and softly stroked the bark of the giant tree. Quickly, an indescribable ripple spread from the trunk of the tree, as if it wanted to express something.</p> <p>Before Yang Ling could make sense of the ripples, his mind suddenly jolted. His consciousness slowly slipped out of the mysterious space. When he opened his eyes, he saw that the elf elder had rushed over to where they were. The magic staff in his hands was releasing a pale green light, as if he had just cast a spell.</p> <p>“Yang Ling, are you alright!” Sofia finally heaved a sigh of relief when she saw Yang Ling open his eyes. She did not understand how the giant tree could have vanished without a trace, nor did he understand why Yang Ling would be rendered unconscious. In her panic, she had rushed to the tribe and informed her grandfather.</p> <p>Seeing the huge crater where the ancient giant tree used to be, then recalling the giant tree he saw in the mysterious space, Yang Ling had a thought. He instinctively formed a hand gesture. In the blink of an eye, a Withered Tree Guardian about twenty meters tall appeared before him, a giant club in its hands.</p> <p>“Lebrock pays respects to its master!” Just as the crowd was in shock, the Withered Tree Guardian knelt before Yang Ling, tossing up a large amount of dirt. Its deafening voice nearly shattered the eardrums of those present.</p> <p>Unlike the Withered Tree Guardians Sofia summoned, the giant groveling thing before Yang Ling had countless green shoots sprouting from its body. Its watermelon-sized eyes had a soulful glow. Those, coupled with its rippling, granite-like muscles, made it look incredibly sturdy.</p> <p>“Oh lord, a Withered Tree Warrior with spiritual qualities!” The elf elder let out a shocked shout as he pointed at Yang Ling. “Yang Ling, you… you are a Tree Shepherd?”</p>"
}