{
  "Chapter 1: Five Year Struggle": "<p>Tianwu Kingdom, Limestone City, Ye Clan Arena</p> <p>A congregation of adolescents were lined up under the sweltering heat of the sun, their faces brimming with excitement.</p> <p>On the other hand, the group of middle-aged people surrounding the perimeter of the arena looked on with worry etched on their faces as their gazes fixated on their children.</p> <p>On this day was the trimonthly Ye Clan Gate Exam, hosted by Ye Zhantian, the Head of the Martial Arts Division. Any clan members under the age of 15 were allowed to participate.</p> <p>How well or how poorly one normally performed would not matter today, as this entrance exam would be the sole determinant of a candidate and their family’s status in the Ye Clan.</p> <p>Only those who were capable would be selected by the Clan, which was a well-established tradition.</p> <p>“Ye Mei!”</p> <p>A man who stood in the center of the arena read the names off of a list. He was clad in grey chain mail armor, his expression fierce and his eyes bright.</p> <p>At that moment, the burning gazes of the audience swiveled towards a young woman with black hair. She had delicate facial features and looked around 14 years of age. She wore violet training gear, which accentuated the curves of her silhouette.</p> <p>Hearing her name, Ye Mei headed towards the center of the arena in dainty but steady steps. Facing an ironwood tree stump, she threw a punch with her delicate fist.</p> <p>Thump!</p> <p>A dull thud sounded, and on the incredibly hard surface of the tree stump was a very visible imprint of a fist.</p> <p>“The imprint is one-inch thick. She has successfully passed the Gate Exam for her right fist.”</p> <p>Hearing the results, Ye Mei’s face lit up with a gleeful grin.</p> <p>“Wow, no wonder they say Ye Mei is a prodigy. Half a year ago, her right fist still hadn’t had its Gate unlocked yet.”</p> <p>“That talent is possibly on par with young master Ye Changsheng!”</p> <p>As more exclamations of awe sounded from the audience, Ye Mei’s grin grew exceedingly wide.</p> <p>In Tianwu Kingdom, martial arts held supreme importance. All martial artists aspired to open the Five Gates, achieved by focusing the flow of energy originating from the Energy Center in the body.</p> <p>Every person had five Gates in their body, which were located in their four limbs and their mind. Once a Gate was opened, the flow of energy that had been accumulating in the Energy Center would erupt that Gate, imbuing one with explosive power and heightened reflexes. When all five Gates were opened, the martial artist would officially embark on their training journey in order to reach the Spirit Cultivating Realm.</p> <p>The strength of a normal adolescent’s punch would be roughly equal to half a stone or 130 pounds. However, once the Gates were opened, and Energy Center utilized, the punch would yield one stone of strength.</p> <p>And once all five Gates were opened and the Spirit Cultivating Realm reached, then it was possible to achieve two stones of strength.</p> <p>“Excellent! For your next exam, I hope you focus on opening your last Gate and reaching the Spirit Cultivating Realm!” Ye Zhantian exclaimed, not hesitating to show his approval.</p> <p>The only Gate Ye Mei had yet to unlock was the Mind Gate. If she could open the Mind Gate, then she would reach the Spirit Cultivating Realm even before she turned 14. Neither the Ye Clan nor Limestone City had many martial artists who could reach that stage before 14 years of age.</p> <p>“Thank you, Uncle Ye. I will definitely work very hard.”</p> <p>Hearing Ye Zhantian’s praise, Ye Mei left the arena hurriedly, turning heads as her chest heaved with excitement.</p> <p>Ye Zhantian frowned slightly as he noticed the next candidate on his list. “Next up, Ye Mo!”</p> <p>Upon hearing Ye Zhantian’s announcement, heads turned around in search of Ye Mo.</p> <p>“Next up, Ye Mo!” Ye Zhantian repeated, loud and clear. Yet Ye Mo was nowhere to be seen.</p> <p>“Look at these candidates that come from Branch Houses. Not only is he inept, he doesn’t even bother to show up for this exam. Tsk.”</p> <p>“At least he’s self awareness. Five years worth of Gate Exams and he never once opened a single Gate. If he shows up today, won’t he just be losing face?”</p> <p>“Dragons give birth to dragons, and phoenixes to phoenixes; it goes without saying that the offspring of garbage… is garbage!”</p> <p>Hearing the murmurs from the crowd, Ye Zhantian angrily proclaimed, “Who dare say that ‘the offspring of rubbish is rubbish?’ True, Ye Mo is not talented in terms of martial arts. But no one should be describing him and his father as rubbish! If it wasn’t for Ye Qing’s contribution at the Door of Desolation, we, the Ye Clan, would not be where we are today.”</p> <p>Tianwu Kingdom was the smallest country among countless others within the Zone of Desolation. The Door of Desolation was the most powerful Ancestral Gate in the Zone of Desolation. Whether to Tianwu Kingdom or to any Clan, its existence was distant and unobtainable.</p> <p>Only the best martial artist of the Kingdom would be considered worthy of entering the Door of Desolation.</p> <p>What nobody expected, however, was that Ye Qing’s Energy Center was destroyed in the Battle of Yidao. After his return to Tianwu Kingdom, he experienced several close calls due to assassinations attempted by many. Only with the aid of his friends could he live a peaceful life in the Ye Clan complex.</p> <p>And this was the story of a fallen star.</p> <p>In the ten years that followed, Tianwu Kingdom never saw a genius as remarkable as Ye Qing.</p> <p>And now, ten years later, a man once hailed as the genius of Ye Clan was reduced to nothing more than garbage. Because of the fall of Ye Qing, the Door of Desolation compensated Ye Clan generously, and in turn, was instrumental in the rise of Ye Clan.</p> <p>Outside a simple but cozy-looking hut, a 15 year old boy hastily wiped the blood on the corners of his lips before pushing open the door.</p> <p>He had jet black hair and a baby-face, but amidst his delicate, youthful appearance was a hint of determination. Although he wiped away the blood from the corners of his lips, his right cheek still remained red and slightly swollen.</p> <p>“I may not have opened a single Gate, but it doesn’t mean I will put up with the bullying!” Ye Mo muttered quietly to himself. That day was the Gate Exam, and as he had never succeeded in opening a single Gate, he did not want to make a fool of himself and therefore decided not to attend. Unfortunately, he bumped into the troublemakers that often bullied him and got several scratches on his skin.</p> <p>Ye Mo spat on the ground and entered the small hut slowly.</p> <p>Lying on the wooden bed was a middle-aged man. His features showed a past of perseverance and strength, yet his face was pallid and his hair messy.</p> <p>Looking at his father’s increasingly pale countenance, Ye Mo forced a smile and said, “Dad, I’m home.”</p> <p>Ye Qing looked at Ye Mo’s injuries, a pang of pain in his eyes. “You got beaten up today again?”</p> <p>“Dad, I’m fine. I may not have opened my Gates, but against those guys? I’ve put up a pretty good fight.”</p> <p>Ye Mo put down the hand that was covering his cheek, revealing the red and swollen patch.</p> <p>“Mo’er, my dear son, with your natural talents coupled with your mother’s gift, your skill should be equal to mine. Who would dare bully you?” Ye Qing sighed heavily.</p> <p>Those bullies that always picked on Ye Mo were Ye Clan trainees who only opened one Gate themselves. To Ye Mo, someone who had not opened a single one of his Gates, he had a clear disadvantage. As a consequence, every time he encountered them, he would suffer from mild injuries.</p> <p>The true reason behind Ye Mo being 15 years of age and yet to unlock a single Gate was not because he did not have the talent for it. In fact, he would be considered the top martial artist in Limestone City in terms of talent.</p> <p>Why? Because, at a mere ten years of age, Ye Mo could already control the flow of energy from his Energy Center and absorb Yuan Chi of Heaven and Earth. This milestone marked the transition from an average civilian to a martial artist.</p> <p>At that time, the news caused waves of shock in Limestone City. The ability to control the flow of energy from the Energy Center at such a young age was exceedingly rare not only in Limestone City, but in the entire Tianwu Kingdom.</p> <p>However, Ye Mo gave up training in order to look after his disabled father in the hopes of him being able to recover fully.</p> <p>After Ye Mo learned to read, he scoured through the libraries of Ye Clan and discovered the possibility of utilizing Yuan Chi to cure Ye Qing’s disability and recover his powers. Nevertheless, it was only a possibility. To give up years of training in favor of a mere possibility was too big of a risk. Most others were unwilling to make that sacrifice.</p> <p>When Ye Mo turned ten, and was finally able to control his energy flow from the Energy Center, he made it his mission to utilize the Yuan Chi from his Energy Center to heal his father’s paralysis that stemmed from injury.</p> <p>Initially, Ye Qing vehemently refused. Yet he could not win the argument against his son.</p> <p>Despite having a completely destroyed Energy Center, and paralysis in his four limbs, in those five years, Ye Qing miraculously recovered some degree of sensation in his limbs, thanks to Ye Mo’s insistence.</p> <p>This was what they called a miracle.</p> <p>This gave Ye Mo a ray of hope, confirming his belief that one day his father would recover entirely and be able to stand on his own feet once more.</p> <p>Everyday, Ye Mo absorbed Yuan Chi of Heaven and Earth to slowly nurse Ye Qing back to health. As a result, his training had not progressed.</p> <p>If the Yuan Chi Ye Mo absorbed everyday was used in attempt to open his Gates, in those five years, opening all of his Gates would be nothing—Ye Mo would have ascended into level two or even three of the Spirit Cultivating Realm, and none of his peers have even come close to that.</p> <p>However, due to a lack of training, not only did Ye Mo have to bear the derogatory title of “garbage,” he also suffered from constant bullying from his peers. In these five years, Ye Mo certainly endured a lot of suffering.</p> <p>Ye Qing suddenly said, “Mo’er, if I recall correctly, today is the Gate Exam.”</p> <p>“I was just there, but I failed.”</p> <p>“You’re lying to me again!”</p> <p>“I would have failed anyway. Rather than be the laughing stock, I might as well not show up and use that time to heal your body with the Yuan Chi I have accumulated.”</p> <p>Ye Mo grinned at his father and slowly walked towards him. He placed one palm on Ye Qing’s chest. The Yuan Chi within his Energy Center tumbled around in turbulent waves, endlessly flowing into Ye Qing’s body, wandering around.</p> <p>Gazing at Ye Mo’s concentrated face, Ye Qing slowly closed his eyes, his Energy Center eagerly lapping up the Yuan Chi that entered his body. As such, Ye Qing’s cheeks also began to gain a healthy glow.</p> <p>He also wished to recover as soon as possible. Once he regained his powers, he could repay his son’s efforts.</p> <p>Feeling the Yuan Chi from his Energy Center depleting at an abnormally fast rate, Ye Mo coughed and said, “How strange, all the Yuan Chi today has been depleted. It’s been going down faster lately!”</p> <p>Ye Mo noticed, in these few days of healing his father’s body with Yuan Chi, the rate of absorption increased exponentially.</p> <p>Crack!</p> <p>As Ye Mo was still riddled with confusion, the wooden bed suddenly cracked, causing Ye Qing to drop onto the floor with a loud thud.</p> <p>“Dad! Are you alright?” Ye Mo asked worriedly.</p> <p>“I’m alright, but you stay away from me!”</p> <p>Ye Qing’s eyes were still closed, but his voice held a grave note. In the room, the broken bed that was now lying on the floor was still erratically shaking.</p> <p>“Dad, how are you feeling?” Ye Mo asked, concerned. Ye Qing’s body was convulsing uncontrollably.</p> <p>Ye Qing’s face was contorted in pain, yet underneath all that lingered a hint of a smile. Five years worth of healing he received from Ye Mo meant that he could finally start controlling the flow of his Energy Center again.</p> <p>As Ye Qing was about to control the flow from his Energy Center, he suddenly grimaced.</p> <p>Boom!</p> <p>A thundering noise sounded, and Ye Qing’s Energy Center alongside with his abdomen split open with explosive force. Blood splattered across Ye Mo’s face.</p> <p>Upon this unexpected turn of events, Ye Mo froze in shock. Lifting a hand, he touched the cold, cold droplets of blood on his face.</p> <p>Ye Mo rushed towards Ye Qing, his eyes red, and bellowed, “Dad!”</p> <p>Roar!</p> <p>Suddenly, a monstrous howl sounded, and a pitch black Yuanli Beast emerged from Ye Qing’s Energy Center. The Beast somehow simultaneously resembled a tiger and a panther, baring its two giant fangs, a visage of terror.</p>",
  "Chapter 2: Budding powers": "<p>Mustering up all his remaining strength, Ye Qing cried, “Mo’er, run!”</p> <p>Ye Mo stared with wide eyes at the beast, feet not moving an inch from where he was.</p> <p>“How could this happen? How could this happen?!”</p> <p>Ye Mo let out a ferocious howl, his blood boiling in anger, causing his eyes to glow as red as rubies. His hair became a fiery red; fresh blood started to seep out, causing a veil of blood to coalesce around his form.</p> <p>“How? Didn’t the genetic testing done by Xiao Ning confirm that Mo’er hasn’t inherited his mother’s bloodline?”</p> <p>Ye Qing could not believe his eyes as he stared at what appeared to be the Dragon Form. Only those who inherited the bloodline could undergo the transformation.</p> <p>In that moment, Ye Mo succumbed to mania and started attacking the Beast as if he was in a trance. He lashed out at the black Yuanli Beast with tremendous force, sending the furniture in the hut into turmoil.</p> <p>The Beast appeared to be sentient. As it sensed the aura emanating from Ye Mo’s body, a look of fear flashed across its face and it cowered in Ye Mo’s presence, almost like a small cat.</p> <p>Ye Mo threw another punch, this time aimed at the Beast’s head. It cried out in pain, but did not dare to fight back. Without skipping a beat, Ye Mo threw a flurry of punches at the Beast like heavy rain upon a window. As its cries grew fainter, The Beast slowly disappeared without a trace.</p> <p>After subduing the Beast, Ye Mo’s crimson eyes gradually reverted back to its usual black, as with his hair.</p> <p>Ye Mo seemed to wake up from his trance as his eyes travelled towards his father, whose face was drained of blood. He immediately ran to Ye Qing’s side and fell onto his knees.</p> <p>With tears streaming down his face, he asked, “Dad, what just happened?”</p> <p>“Don’t worry about me. The thing you were doing just then, what was that about?” Ye Qing, on the other hand, held excitement in his voice. Knowing that Ye Mo had such potential, he would be able to die in peace.</p> <p>“I don’t know. I don’t know what’s happening, but I’ll take you to the Main House. He will definitely send the best doctors to you,” Ye Mo rambled. As he grabbed Ye Qing’s arms to help him stand, Ye Qing pushed him away.</p> <p>Ye Qing shook his head and feebly muttered, “Main House? The Ye Clan has not a single iota of empathy or compassion. Besides, my Energy Center has been completely destroyed. At this stage, it’s a lost cause.”</p> <p>In his glory days, he brought endless glory and honor to Ye Clan. After Ye Qing was heavily injured at the battle, the Door of Desolation compensated the Ye Clan so greatly that it drew envy from even the most distinguished, prosperous clans. But today, after his fall from grace, not only did he not receive a single drop of that compensation, but his son had to suffer from bullying and verbal abuse. And not one person had stood up for him.</p> <p>“No, there must be a cure. If it’s not found in Tianwu Kingdom, I will find it in the Zone of Desolation. If it’s not found in the Zone of Desolation, I will seek out Lingwu Continent.”</p> <p>Ye Mo shook his head, refusing to succumb to fate. Loud sobs racked his body as he cried in pain.</p> <p>Seeing the determination harbored by his son, Ye Qing’s face lit up with a proud, loving smile. He suddenly realized that the best thing that had happened to him was fathering this wonderful, strong-willed child with Zi Ning.</p> <p>Ye Qing gently stroked Ye Mo’s hair and said, “Mo’er, I’m actually relieved. You can finally live your own life. You shouldn’t have to always worry about your sick father.”</p> <p>“Dad.”</p> <p>“Let me finish. I have always wanted to find your mom and bring her home. But I couldn’t even survive the Battle of Yidao. Incompetent, no?” Ye Qing said bitterly.</p> <p>“No, no, you will always be the greatest in my books,” Ye Mo said. Ever since he could speak, Ye Mo had heard countless legends of his father’s accomplishments despite only ever seeing his father bedridden.</p> <p>“I am too incompetent. I couldn’t find your mom. To find her and be able to bring her home is my only wish. The only wish I have.” Ye Qing slowly closed his eyes, a single drop of tear trickled down his face.</p> <p>“Zi Ning, just you wait till I become stronger! I will enter your clan with pride on my face and honor on my shoulders and ask for your hand in marriage!” This promise was uttered by Ye Qing to Zi Ning back in the days, a promise he could not fulfill.</p> <p>After hearing this, Ye Mo was unnaturally quiet, almost bordering on an ominous calm. A glint of crimson flashed across his eyes.</p> <p>At this moment, the door suddenly busted open and Ye Zhantian entered the room.</p> <p>As he set his eyes on the scene unfolding before him, his eyes widened. He rushed towards the pair and asked, “Ye Mo, what is this?”</p> <p>“When dad was controlling his energy flow, his Energy Center suddenly exploded and from there, a black Yuanli Beast emerged from it,” Ye Mo answered weakly.</p> <p>“Yuanli Beast? Could it be a talisman of the Beast seal?” Ye Zhantian muttered in astonishment.</p> <p>Ye Mo frowned and hurriedly asked, “Uncle Ye, what is happening? And what is this seal you are talking about?”</p> <p>“I’m not sure either, but based on what I’ve heard, Ye Qing and someone had a conflict. In the Battle of Yidao, that person defeated Ye Qing and destroyed his Energy Center. On top of that, he used a talisman to seal in Ye Qing’s Energy Center. The seal permeated his body so whenever the Energy Center is utilized to control energy flow, the talisman will transform into a sentient beast, which will erupt from Ye Qing’s body and destroy his Energy Center once more.”</p> <p>“Damnit!” Ye Mo clenched his fists, suppressing the wave of anger that washed over him.</p> <p>“Ye Mo, wasn’t your dad’s Energy Center damaged? How was he able to manipulate the flow of energy?” Ye Zhantian asked quizzically.</p> <p>“Ever since my Energy Center was capable of absorbing the Yuan Chi of Heaven and Earth, I would sneak into dad’s room and imbue him with my energy,” Ye Mo answered casually.</p> <p>“What? You’re saying that in these five years, you have been using your Energy Center to nurse your dad back to health?” Ye Zhantian was greatly shocked. If Ye Mo was absorbing the Yuan Chi of Heaven and Earth every day to help his father, it means that in these five years, he had never attempted to convert Yuan Chi to Yuanli and open any of his Gates. Was this really the “piece of garbage” who everyone thought to have no progress in five years’ time? How much determination would one need to have?</p> <p>“Haha. What a joke. In hopes of recovery, I gave up five years, I endured five years, I ploughed on for five years. Five whole years, and yet these five years proved futile in the wake of this talisman.” Ye Mo howled with a mixture of fury and desperation, an aura of primal aggression radiated from his body. Knitting his eyebrows together in a deep frown, he asked coldly, “Who was that person?”</p> <p>“Ye Mo, don’t act recklessly. I have no clue who that person is and even if you found out who it was, what could you do? Yes, the Ye Clan’s status in Limestone City is notable, but before him, it was nothing more than a speck of dust. What you need to do right now is to become stronger!” Ye Zhantian said, shaking his head in disapproval.</p> <p>At this moment, to seek revenge was foolish, even absurd. Furthermore, Ye Zhantian wanted him to dismiss the thought of vengeance.</p> <p>Even after he became stronger, he still should not seek revenge.</p> <p>Ye Mo’s fists were clenched so tightly, that his nails dug deep into the flesh of his palms and drew blood.</p> <p>If that person could subdue his father ten years ago, then ten years after that, their skill must have reached a stage of incomprehensible strength.</p> <p>Ye Mo’s childhood dreams had been to surpass Ye Qing and to become a figure revered by the entire Tianwu Kingdom. Yet this dream had been shattered by the harsh realities of life.</p> <p>Ye Qing’s fall prompted Ye Mo to give up training, to endure all the abuse thrown at him by his peers, just to absorb Yuan Chi every day and aid in the rehabilitation of Ye Qing.</p> <p>Today marked the day of Ye Qing’s death, the day that kindled the fighting spirit and the thirst for vengeance within Ye Mo.</p> <p>Within Ye Mo’s Energy Center, the Rising Dragon Pillar began to shake. The voices of countless dragons sounded in a bellowing chorus!</p> <p>The hidden potential of a dragon will rise to the heavens!</p>",
  "Chapter 3: The Rising Dragon Pillar": "<p>Ever since Ye Qing fell from grace, Ye Mo’s status in the clan dropped significantly, and he lived his days in poverty.</p> <p>At first, Ye Mo was still be given a monthly allowance of ten silver pieces from the clan. Once news that Ye Qing’s chances of recovery were nonexistent spread across the village, Ye Mo no longer received the monthly allowance. On top of that, he was sent to the alchemist of Ye Clan to work as an assistant.</p> <p>To make ends meet, Uncle Fu would take up odd jobs here and there, and so would Ye Mo.</p> <p>Ye Qing’s death did not startle many people, nor did it spread far; only a handful of people in the Ye Clan were aware.</p> <p>Ye Zhantian made arrangements for Ye Qing’s burial at a nearby hill where the ancestors of Ye Clan were buried. He comforted Ye Mo. As he and Ye Qing used to be friends, he was one of the few among Ye Clan who would occasionally look after Ye Mo.</p> <p>Although Ye Zhantian was aware of the circumstances underlying Ye Mo’s lack of progress in opening his Mortal Gates, five years without training was essentially a death sentence for his career in martial arts. These few years in particular were peak training years as the body was on the cusp of maturity. Once the body matured completely, any training undertaken would be much less effective.</p> <p>Ye Mo returned to his bedroom. Although it was old and shabby, Uncle Fu often kept it very tidy.</p> <p>Uncle Fu used to be Ye Qing’s servant. Having served under him for several decades, he was like family to Ye Mo.</p> <p>“Master Ye used to bring endless glory and honour to Ye Clan. But when he passes, no one comes to offer condolences. What a heartbreaking sight to behold!”</p> <p>“I may be five years behind, but I will work five times, even ten times, harder. I will make those who used to bully me regret what they’ve done. I will avenge my father and find my mother.”</p> <p>Ye Mo knew that only if he trained harder than the others would he have the chance to catch up to those so-called prodigies and get the chance to enter the Door of Desolation.</p> <p>Only after setting foot in the Door of Desolation would he have the chance to seek revenge.</p> <p>Ye Mo sat on his bed, eyes shut, and started to manipulate the flow of energy within his Energy Center, absorbing the Yuan Chi of Heaven and Earth in his surroundings.</p> <p>Training involved a critical process where an individual would utilize their Energy Center to absorb the surrounding Yuan Chi of Heaven and Earth. They would then convert Yuan Chi into Yuanli and store it in their Energy Center.</p> <p>“I wonder what’s so impressive about the Rising Dragon Pillar…”</p> <p>Ever since Ye Mo gained the ability to examine his Energy Center, he had been aware of the existence of the Rising Dragon Pillar within him. It was a legendary artifact obtained by his mother, Zi Ning, in the Divine Realm.</p> <p>The Divine Realm was the pinnacle among the different levels of realms anyone could have achieved, a stage where the possibilities one could achieve were limitless: they could shake the heavens and crumble the earth, build cities, and manipulate life and death.</p> <p>When Zi Ning was pregnant with Ye Mo, the Rising Dragon Pillar seemed to consider the unborn Ye Mo its new master and shifted its presence into Ye Mo.</p> <p>The moment Ye Mo was born, a mysterious person of incredible skill whisked Zi Ning away against her wishes and humiliated Ye Qing.</p> <p>Now that Ye Mo had officially embarked on his training journey, he was very intrigued to see what the Rising Dragon Pillar was capable of.</p> <p>Ye Mo began to examine his inner body and concentrated on observing the pillar within his Energy Center. On the surface were many black dragons, slithering around the pillar, entangled, as if they were trying to imprison the hulking monolith.</p> <p>Ye Mo could not determine the exact number of dragons he saw, but he was certain that there were many, as many as the stars adorning the night sky. In fact, he could sense that the Rising Dragon Pillar was seething with power, the power to subdue dragons and to soar into the heavens, with an air of ancient forces.</p> <p>He inhaled deeply and breathed in the surrounding Yuan Chi of Heaven and Earth. He manipulated its flow and directed it towards his Energy Center to form Yuanli.</p> <p>As he began to form Yuanli, the pillar began to shake and rumble. The cries of thousands of dragons reverberated within him, causing the Yuan Chi in his Energy Center to turn into chaos. But soon after, the Yuanli was slowly absorbed by the dragon at the very bottom of the pillar.</p> <p>The dragon emitted a faint, barely noticeable glow.</p> <p>“It can absorb Yuan Chi,” Ye Mo thought to himself.</p> <p>After the thought registered, he once again started to consume the Yuan Chi of Heaven and Earth, but his Energy Center could not keep up with the rate at which the pillar was drinking up the Yuanli.</p> <p>Ye Mo spent two entire hours just exploring his newfound abilities, absorbing Yuan Chi and converting it to Yuanli. As he continued, the dragon at the bottom of the pillar began to emit a brighter glow.</p> <p>Ye Mo’s face lit up at the realization and continued on. The dragon greedily drank up the Yuan Chi and, with a mighty roar, made its way out of the pillar and began to revolve around Ye Mo’s Energy Center.</p> <p>He had a suspicion that the dragon would hear his commands. Indeed, under his control, the dragon coursed through his body and shot towards Ye Mo’s right hand. Upon impact, he could feel a tingling, numbing sensation in his hand.</p> <p>When a martial artist began their journey, they would first be in the Spirit Cultivating Realm, attempting to open the Five Gates. The dragon crashing against the Gates was in fact very helpful in Ye Mo’s training process.</p> <p>“Ha! This pillar really is something.”</p> <p>Among all beasts, dragons were an ancient being and considered the king of all beasts. Their existence compared to that of gods, possessing the might to topple mountains and cut rivers.</p> <p>Ye Mo marvelled at the wonders of the pillar. The power the black dragons harbored must greatly surpass that of normal Yuanli. His morning was spent absorbing Yuan Chi, fuelling the pillar. Once it absorbed a good amount of Yuan Chi, the dragon at the bottom of the pillar would flicker with an obsidian gleam and a giant Yuanli dragon would make its way out.</p> <p>Ye Mo concentrated on controlling the dragon’s assault on his right hand’s Gate. After an entire morning of training, his right hand was heavy like lead with all the hidden potential.</p> <p>He had a feeling that the Gate on his right hand was on the brink of erupting.</p> <p>Creak—</p> <p>Uncle Fu entered the room, holding a tray of food. Ye Mo’s eyes widened at the sight of it as he absentmindedly wiped the drool from the corner of his mouth.</p> <p>He paused his training and quickly sat down at the table, taking large bites of his lunch.</p> <p>Noticing Ye Mo’s healthy appetite, Uncle Fu felt a sense of relief. At first, he was worried that Ye Qing’s death would severely affect Ye Mo’s abilities to carry out his day-to-day activities. But now, Uncle Fu was glad to see that Ye Mo seemed to be quite energetic.</p> <p>“Young master, please slow down so you don’t choke.”</p> <p>“Uncle Fu, I still have to head to Elder Yin’s after I finish to help him with the fires. I can’t afford to be late!”</p> <p>After he wolfed down his meal, he quickly made his way towards Elder Yin’s place.</p> <p>Elder Yin was a Phase 2 alchemist of the Ye Clan, meaning that he had a high standing within the community. Ye Mo was assigned to kindle and maintain the fires, essentially serving as his assistant, which was a very physically demanding job.</p> <p>As Ye Mo arrived at the Pill Refining Chamber, he breathed a sigh of relief as he noticed the closed door. If Elder Yin arrived before he did, he would be reprimanded again.</p> <p>Fumbling for the keys, Ye Mo unlocked the door and entered the chamber.</p> <p>Instead of an empty room, what greeted him were two people rummaging through the medicine cabinets. When they heard the door opening, the two paused in alarm, but when they saw that it was Ye Mo, their composed demeanor showed not a single trace of fear.</p> <p>“Ye Mo, you better forget you saw anything. Otherwise, what happened last time will happen again.”</p> <p>In Ye Ming and Ye Xiaotian’s hands were several costly medicinal herbs. After threatening Ye Mo to keep his mouth shut, they hurriedly snuck out of the Pill Refining Chamber.</p> <p>Ye Ming was a member of the Main Branch in the Ye Clan. Along with Ye Xiaotian, he often bullied Ye Mo. He also had a history of stealing medicinal herbs, and the ones they stole today were worth about ten silver pieces. To a someone like him, a martial artist of average potential, it was a sizeable sum.</p> <p>Ye Mo once reported their thievery to Elder Yin, but it only resulted in a beating from Ye Ming and Ye Xiaotian.</p> <p>Gazing at their backs, he said with venom in his voice, “Just you wait. Once I open my Gates, I’ll make sure you get a taste of your own medicine.”</p>",
  "Chapter 4: Opening Gates With Dragons": "<p>There were many medicinal herbs within the Pill Refining Chamber. If one or two went missing, Elder Yin would most likely not have noticed unless he did a thorough investigation.</p> <p>If he looked into it and found out that any were missing, chaos would ensue as Elder Yin bore a burning hatred of thieves.</p> <p>“Ye Mo, you little rascal, go and start the fire!” A thundering voice sounded as Elder Yin, with his stark white hair, bustled in.</p> <p>“Yes, sir!”</p> <p>Ye Mo knew Elder Yin rather well and knew that as long as he did what he was told, the old man would be placated.</p> <p>Ye Mo kindled the flames on the stove in preparation for Elder Yin, who added ingredients into a large cauldron, slowly imbuing the concoction with his own Yuanli.</p> <p>Ye Mo continued to fan the flames and blow at them. After an hour, an explosion sounded from the cauldron, indicating the completion of a batch of Pei Yuan pills.</p> <p>One batch of Rank One Priming Pills yielded about 50 pills and were used to enhance training.</p> <p>One day’s work yielded 100 pills. In the remaining time, Elder Yin would conduct research on Rank Two Fortifying Pills.</p> <p>Ye Mo’s task was to fan the fires. After a few hours of hard work, Elder Yin asked Ye Mo to tidy up the room. After Ye Mo finished, he locked up and headed home.</p> <p>Once he got back, he immediately sat down, cross-legged, ready to train once more. The Yuan Chi of Heaven and Earth he absorbed was colorless and as it travelled towards his Energy Center, it remained the same as when it was converted to Yuanli.</p> <p>Only after mastering the Mental Technique would the Yuanli bear a color.</p> <p>For instance, the Hellfire Technique Ye Qing specialized in was a fire-based Mental Technique. The Yuanli, as a result, glowed red. His attacks also carried a blazing fury, mimicking flames.</p> <p>The Rising Dragon Pillar lapped up the Yuan Chi provided by Ye Mo, causing a single black dragon to shoot towards the Gate of Ye Mo’s right hand.</p> <p>The veins of Ye Mo’s right arm began to surface, throbbing with great intensity as if it was bitten by a dragon.</p> <p>Ye Mo clenched his teeth in pain and repeated the process. Another dragon was unleashed and darted towards the Gate.</p> <p>“If only I could awaken two dragons simultaneously, I would greatly speed up the process of opening my Gates!”</p> <p>Ye Mo realized that, despite the numerous dragons on the pillar, he could only awaken the dragon at the very bottom and he could only utilize its powers. If he could awake two simultaneously, he could halve the time he spent opening Gates. As for awakening more than two dragons at the same time? Ye Mo did not even dare to think about it yet.</p> <p>“Let me try a Priming Pill.”</p> <p>From the corner of the room, Ye Mo brought out a small pouch filled with Priming Pills. These were the pills he received during all his years of working at the Pill Refining Chamber. Elder Yin would reward him with several pills whenever he was in a good mood. After five years, Ye Mo had quite a decent collection.</p> <p>Ye Mo swallowed a handful of Priming Pills. The energy from the pills slid smoothly down his throat and travelled directly to his Energy Center. The energy from the pills fused with his Yuan Chi, forming a condensed mass.</p> <p>A single giant obsidian Yuanli dragon emerged from the very bottom of the pillar. Much to Ye Mo’s delight, it was quickly followed by the dragon that rested above it, which let out a great roar. The dragons shot towards Ye Mo’s Energy Center in tandem.</p> <p>Ye Mo internally leapt for joy. These obsidian Yuanli dragons were essentially pure Yuanli, but in the form of a dragon.</p> <p>“I shall name you dragon power!”</p> <p>With two dragons under his control, Ye Mo directed both of them towards the Gate of his right hand.</p> <p>Crack!</p> <p>The sound of breaking bone was heard, and Ye Mo could feel the seal covering the Gate yielding to his attempts. He was certain that in just a few days’ time, he could break through the Gate on his right limb based on the power of the two dragons.</p> <p>Ye Mo’s schedule over the next few days were mostly training in the morning, helping out at Elder Yin’s in the afternoon, and more training at night.</p> <p>Crack crack!</p> <p>The sound of bone cracking sounded once more, and with that, the two dragons dashed through the Gate of his right hand.</p> <p>“I opened the Gate!”</p> <p>Ye Mo opened his eyes, wiped off the sweat on his brow and had a good long look at his right arm. It did not look any different on the outside, but he could feel the power coursing through his veins.</p> <p>He could no longer hold in his excitement. In only ten days, he had already opened the Gate in his right hand, something not even the prodigies of Limestone City could ever dream of achieving.</p> <p>Ye Mo once more enlisted two dragons, one of which was entirely engulfed by the Gate in his right hand. Clenching his fist, he landed a punch on a nearby wall.</p> <p>Bam!</p> <p>The wall cracked under the immense pressure. Long hair-like tendrils snaked down the length of the wall.</p> <p>“Ha! This sort of attack should yield at least two stones of strength.”</p> <p>The dragon power in Ye Mo’s right hand did not vanish after he had used it a moment ago. In fact, the two dragons had assimilated into the Gate. He threw another powerful punch, this time towards the floor. An ear-shattering noise sounded as if the fury of the dragons were unleashed.</p> <p>BAM!</p> <p>Upon impact, the entire house began to tremble as Ye Mo made an indentation the size of a small crater on the ground.</p> <p>“Young master, what happened?” Uncle Fu said as he rushed to the scene, noticing the crater on the ground.</p> <p>“Uncle, I am no longer the ‘garbage’ everyone thinks I am. No one will ever dare to mess with us again,” Ye Mo said with a wide grin, rubbing his arm.</p> <p>“Young master, was that you who made all that commotion?” Uncle Fu asked incredulously.</p> <p>“Don’t tell anyone,” Ye Mo warned.</p> <p>“Young master has inherited Master Ye’s talents!”</p> <p>Uncle Fu sighed with awe and delight. Even those who have reached Spirit Cultivating First Realm would not be able to land a punch as powerful as Ye Mo’s punch.</p> <p>Once a martial artist successfully opened all five Gates and reached First Realm, their strength could reach up to two stones. Once they reached Second Realm, their Yuanli would be more concentrated and their strength could reach up to four stones. Once they reached Ninth Realm, they could produce 18 stones of strength.</p> <p>However, those numbers were only an estimate. Some were born with more strength than others, and, naturally, would have a mightier attack.</p> <p>Once Ye Mo absorbed the power of one dragon, his right fist would yield two stones of strength. But with two dragons, he could reach four stones. In terms of attack power alone, he had already reached the Spirit Cultivating Second Realm.</p> <p>After Ye Mo finished his lunch, he started to make his way to the Pill Refining Chamber.</p> <p>In these 20 or so days of intense training, Ye Mo had almost depleted his collection of Priming Pills. If it weren’t for the pills, with his skill alone at the moment, he still struggled to extract the power of two dragons simultaneously.</p> <p>As Ye Mo arrived at the Pill Refining Chamber, he was shocked to see that the lock had been tampered with. He bristled with anger as he thought about how the thieves escalated from entering through the windows to tampering with the locks, displaying a complete lack of shame.</p> <p>The door swung open, and Ye Mo was greeted by the sight of Ye Xiaotian carrying a bagful of Priming Pills. As Ye Xiaotian knew that Elder Yin had a class at the Alchemist Guild and would not be at the chamber today, he didn’t bother to climb through the window and took the easy way in.</p> <p>“Ye Xiaotian, how dare you steal the Priming Pills!” Ye Mo said angrily.</p> <p>Ye Xiaotian took one look at Ye Mo and threw a small piece of silver at him and giggled. “Ye Mo, Elder Yin won’t be coming in today, so you can just change the locks in the afternoon. He won’t find out.”</p> <p>Ye Mo could avert his eyes if Ye Xiaotian and Ye Ming were only stealing medicinal herbs. After all, Elder Yin seldom inspected his stores. However, the audacity of Ye Xiaotian was simply appalling, as Elder Yin would be furious if any of the Priming Pills went missing.</p> <p>Back in the day, when Ye Mo did not have any powers, he could put up with the bullying. But now that he had opened one of his Gates, in addition to possessing the power of dragons, he no longer bent to Ye Ming’s will—who only opened two Gates himself.</p> <p>As Ye Mo utilized the strength of one dragon, he threw the piece of silver back at Ye Xiaotian, a silver glint flashing along its trajectory.</p> <p>“Save this piece of silver for your dental appointment!”</p>",
  "Chapter 5: Greet and Beat": "<p>Thump!</p> <p>A flash of silver sailed straight towards Ye Xiaotian, a smug grin on his face still as he wouldn’t have predicted that Ye Mo, the “garbage,” would dare do something like that. The piece of silver landed on Ye Xiaotian’s front teeth, causing him to cup his hand over his mouth in pain.</p> <p>Ye Xiaotian looked at his hand, and among the pool of blood, he really couldn’t distinguish between his teeth and the piece of silver.</p> <p>“Ye Mo, you’re asking for it!” Ye Xiaotian cried angrily and threw the congealed mass in his hand on the ground in a huff. His hands shot out towards Ye Mo, like two slithering serpents in attack.</p> <p>The Phantom Serpent Palm!</p> <p>A Low-grade Spiritual Level martial technique in the Ye Clan, suitable for martial artists in training in the Corporeal Strengthening Realm or those in the Spirit Cultivating Realm. Two hands transformed into phantom serpents, and for those who mastered the technique, their hands could literally choke someone to death.</p> <p>But for someone like Ye Xiaotian, the technique’s full potential had yet to be unleashed.</p> <p>Although Ye Mo had not trained in five years, his skill had not deteriorated. Eying the approaching Phantom Serpent Palm, he dodged it cleanly, completely avoiding Ye Xiaotian’s attack.</p> <p>Ye Xiaotian was surprised inwardly, but he sneered as he saw an opening. His two hands snaked towards Ye Mo’s like entangled vines, binding together.</p> <p>However, Ye Mo actually went easy on Ye Xiaotian. Ye Xiaotian could only deal damage equal to one stone of strength, whereas Ye Mo had his dragon power, which dealt damage twice that of Ye Xiaotian. How could Ye Xiaotian possibly immobilize him?</p> <p>Ye Mo’s right hand trembled ever so slightly, the vibrations coursing up Ye Xiaotian’s left arm causing a numbing sensation and forcing Ye Xiaotian to loosen his grip on Ye Mo.</p> <p>Before Ye Xiaotian could react, Ye Mo’s right hand shifted from defense to attack, and, using the Phantom Serpent Palm, his hands slithered up Ye Xiaotian’s left arm. With a squeeze, Ye Xiaotian’s arm crackled with the sound of broken bone.</p> <p>Ye Xiaotian immediately howled in pain and loosened the grip of his right hand. In one swift movement, Ye Mo grabbed Ye Xiaotian’s arm and threw him away like he was tossing away a piece of trash.</p> <p>Thump!</p> <p>Ye Xiaotian landed on the ground with a loud thud. He immediately got up, rubbing his left arm. Amidst the excruciating pain was astonishment. Wasn’t Ye Mo the “garbage?” How could his right arm possibly possess so much strength?</p> <p>“If I ever see you stealing here again, I’ll beat you every time I see you,” said Ye Mo. He didn’t even acknowledge Ye Xiaotian, as crippling one of his arms was merely the punishment Ye Xiaotian deserved. In the Ye Clan, conflicts between trainees often took place. Generally speaking, as long as there were no deaths, the higher-ups would not be involved.</p> <p>“Ye Mo, you absolute human garbage, I will kill you.” Ye Xiaotian was fuming at the arrogance this “garbage” displayed after only opening one Gate. He recklessly rushed towards Ye Mo, hurling his right fist at him vindictively.</p> <p>“Garbage? If it wasn’t for my lack of training in these five years, you lot would have been nothing more than fleas before me!”</p> <p>Hearing the ragged breathing from behind him, Ye Mo internally sneered. He avoided the blow, and, with a swift turn, intercepted Ye Xiaotian’s punch with a fist of his own. The two fists collided with a dull thud.</p> <p>A huge wave of power surged towards Ye Xiaotian’s right arm, causing him to cry out in pain and slowly back away.</p> <p>“You wouldn’t have gotten a beating if you hadn’t asked for it. Today, I’ll make sure you get home—by crawling,” Ye Mo said, and with that, he delivered a swift blow to Ye Xiaotian’s face.</p> <p>Pow!</p> <p>After Ye Mo’s fist hit Ye Xiaotian’s face, Ye Xiaotian rolled on the floor in pain. His nose was fractured, and he felt a surge of fear as he sensed the aura exuded by Ye Mo.</p> <p>Never would he have expected Ye Mo, who hadn’t opened a single Gate in five years, to be to making progress now.</p> <p>“Ye Mo, you garbage, I’ll get you back someday!” Ye Xiaotian threatened weakly and scurried away.</p> <p>Ye Mo didn’t run after Ye Xiaotian. Today’s beating should be enough to keep Ye Xiaotian’s behavior at bay.</p> <p>Suddenly, Ye Mo realized with surprise that the punch he just delivered didn’t have two stones of strength. The dragon power absorbed by the Gate had vanished.</p> <p>“No way! You’ve got to be kidding me!”</p> <p>Ye Mo did some mental calculations and estimated that from since he started absorbing the dragon power, it lasted approximately one minute. Meaning that after one minute, his right hand’s attack would revert back to normal. One minute wasn’t exactly a long period of time, but it wasn’t short either. Definitely a very sticky situation.</p> <p>Now that Ye Mo had erupted one of his Gates, the power of two dragons sufficed. After finishing one, he still had the other as backup. However, if another one of his Gates erupted, the current level of dragon power would be insufficient.</p> <p>Ye Mo’s current skill power was perhaps adequate against martial artists at the stage of the Corporeal Strengthening Realm. However, against opponents of the Spirit Cultivating First Realm, he was still leagues behind.</p> <p>“No, wait, the Rising Dragon Pillar is absorbing the Yuan Chi of Heaven and Earth of its own accord!”</p> <p>Just as Ye Mo used up one wave of dragon power, another dragon from the Rising Dragon Pillar was, in fact, beginning to absorb Yuan Chi automatically, without the need for the Energy Center. Once the dragon completely absorbed all the Yuan Chi, another dragon soared up into the sky, the two dragons circling the air gracefully.</p> <p>“Haha! It can absorb Yuan Chi of its own accord! Now I don’t have to worry about the dragon power vanishing. As long as I store enough backup dragon power in my Energy Center, I can replenish my reservoir as I desire.”</p> <p>At this moment, accompanied by the power of the Priming Pills, Ye Mo could have awakened two dragon forces. Under normal situations, he could only utilize one of the dragons and the other one could be for backup. Once the first one was depleted, the backup dragon could be utilized, and in the meantime, another dragon would be synthesized.</p> <p>More importantly, dragon power held huge potential. It could be stacked up, and in the face of strong opponents, it could even be used in tandem.</p> <p>In this world, no matter how strong one was, no one was capable of automatically absorbing Yuan Chi and converting it into Yuanli.</p> <p>Ye Mo calmed himself down, picked up the bag of Priming Pills on the floor, and walked into the Pill Refining Chamber. Rather than returning the pills into their original spot, he decided he might as well take them.</p> <p>Now that Ye Xiaotian tampered with the lock, and Ye Mo finally gave him a taste of his own medicine, Ye Mo decided to stop faking pleasantries, as a fallout was unavoidable. He had had enough of all those years of Ye Xiaotian and Ye Ming’s abuse. Now that he was beginning to gain powers, he no longer had to live in the shadows.</p> <p>Sitting cross-legged on the floor, Ye Mo swallowed all the pills in the bag. He wanted to see whether he could awaken a third dragon under the influence of the pills.</p> <p>“If I could awaken all of the dragons on this pillar, I wonder how strong the attack would be? Could that monstrous power possibly be an attack of the legendary Divine Realm?”</p> <p>Ye Mo couldn’t help but imagine all the potential it had, but he quickly dismissed the thought, as he was still miles away from the Divine Realm.</p> <p>The strongest martial artist in Limestone City was the head of the Qin Clan, Qin Hao, even he was only at the Energy Shaping Ninth Realm. The Energy Shaping Realm was the realm that followed Spirit Cultivating Realm.</p> <p>However, with the powers of this pillar, Ye Mo was confident that he could avenge his father, as well as fulfil his father’s dying wish, which was to seek out his mother.</p> <p>Once Ye Mo absorbed all the Priming Pills, he stuffed several more into his mouth.</p> <p>“Haha! Ye Mo, hurry up and kindle a fire. I now have the method for synthesizing Fortifying Pills.”</p> <p>Elder Yin walked into the chamber with an air of excitement, his hair resembling a bird’s nest. He seemed to have had an epiphany while at the Alchemist Guild.</p> <p>When his gaze reached Ye Mo, who was popping Priming Pills into his mouth like they were beans, his expression hardened.</p> <p>“Hmph! Ye Mo, turns out it was you who’ve been stealing the pills all this time!”</p> <p>“Uh oh!” Ye Mo cried internally. Initially, he wanted to tattle on Ye Xiaotian and Ye Ming to Elder Yin, blaming the loss of the pills all on them. Now that Elder Yin had caught him red-handed, there was no way he could clear himself of that crime, not even if he jumped into the Huang River and washed his body!</p> <p>“Elder Yin, you’re mistaken! These pills are the ones that I have been saving up all these years,” Ye Mo said, voice quivering with fear. He knew that Elder Yin’s temper was like a raging fire.</p> <p>“The ones you saved?” Elder Yin asked and went to inspect the cabinets. Inside the cabinets, roughly 20 pills were missing.</p> <p>“Don’t you dare defend yourself, I’ll send you to prison! As my assistant, you dare to steal from your own master and take them for yourself. I’m sure you are aware of the punishment,” said Elder Yin.</p> <p>Not being able to defend himself, Ye Mo could only admit to his wrongdoings.</p> <p>“Elder Yin, I’m truly sorry. Please forgive me! After all, I’ve worked so diligently for you all these years!”</p> <p>“Absolutely not, you must sever your own two hands as repentance!” said Elder Yin.</p> <p>Ye Mo was aware that he had angered Ye Xiaotian, and if news that he amputated Ye Mo’s arms spread out, things would end very poorly for him.</p> <p>“Elder Yin, didn’t you just learn of the method to create Fortifying Pills? If my hands were broken, no one would be able to look after the fire for you anymore. I can guarantee that you’ll never be able to find someone as good at the job as I am,” Ye Mo said.</p> <p>Fortifying Pills were Second Rank Pills. Elder Yin was not able to synthesize them before.</p> <p>Elder Yin furrowed his eyebrows. He indeed wanted to make the Fortifying Pills right now, and if Ye Mo’s arms were amputated, it would be hard to train up another assistant.</p> <p>“Don’t threaten me. Alchemy assistants like you are a dime in a dozen in Limestone City,” Elder Yin said as his face hardened again.</p> <p>Ye Mo said, with a smile on his face, “Elder Yin, I know there are plenty of assistants better than me in Limestone City. It would also be very easy for you if you wanted to replace me. But please, as long as you don’t amputate my arms, you can do anything you want to me as punishment.”</p> <p>“Hmph, start the fire first. Once I’ve successfully synthesized the Fortifying Pills, I’ll have a good think about how to punish you, you little rascal!”</p>",
  "Chapter 6: Extracting And Purifying Yuanli": "<p>Ye Mo hurriedly went to start the fire. Although Elder Yin would not cripple his arms, there would still be another punishment waiting for him as Elder Yin definitely was not going to let this slide so easily.</p> <p>The first time Ye Mo started working at the Pill Refining Chamber, he spotted Ye Ming stealing medicinal herbs and informed Elder Yin of it. Ye Ming was a member of the Main House, and his father, Ye Di, was the clan elder Ye Kuang’s brother. Evidently, Ye Ming was among the upper ranks within the clan.</p> <p>Despite Ye Ming’s status in the clan, Elder Yin did not hesitate to give Ye Ming a beating and broke his two legs, causing Ye Ming to be bedridden for an entire week.</p> <p>Once Ye Ming recovered, he sought out Ye Mo and beat him for being a tattletale. After that, Ye Mo never want to be beaten again. All he could do was swallow his pride and pretend he never saw the two stealing from Elder Yin.</p> <p>There were four steps to synthesizing pills: adding the ingredients, kindling the fire, forming the pills, and returning it to the furnace for further refinement.</p> <p>After working under Elder Yin for all those years, Ye Mo knew the procedure like the back of his hand.</p> <p>Priming Pills and the treatment used in first aid, Blood Activating Pills, were rank one pills that Ye Mo knew so well he could find their ingredients with his eyes closed.</p> <p>Although Elder Yin never taught Ye Mo this, Ye Mo knew that the most important step in making the pills was the formation of the pills. If they were not formed properly, the pills that came out of the furnace would essentially be duds.</p> <p>All the Fortifying Pills in the Ye Clan were imported, hence why Elder Yin had a strong sense of urgency to synthesize his own.</p> <p>Once the ingredients were all gathered, Elder Yin began to channel a surge of deep red Yuanli into the furnace while Ye Mo focused on maintaining the flames. Elder Yin’s face strained in concentration as he channeled Yuanli and observed the fire.</p> <p>“Ye Mo, increase the heat!”</p> <p>“No, you need to increase it even more!”</p> <p>“Ye Mo, it’s still not hot enough. The Fortifying Pill is not the same as the Priming Pill. You must keep the flames roaring!”</p> <p>With the current amount of heat, Ye Mo had already reached his limit. He internally sighed and commanded one dragon to erupt through the Gate of his right hand. Ye Mo felt a strong surge of power as the flames in the furnace grew.</p> <p>At the sight of the blazing fires, Elder Yin’s initial reaction of surprise turned into a satisfied grin. After ten minutes, Elder Yin retracted his hands.</p> <p>“You can stop now.”</p> <p>Ye Mo stopped fanning the flames. The action was followed by the sound of a small explosion, an indicator that it had completed its course of refinement. A sweet aroma wafted out from the cauldron as Elder Yin removed the lid. A batch of Fortifying Pills had been successfully created.</p> <p>“Haha! I’ve finally succeeded in making Fortifying Pills!” Elder Yin cried happily.</p> <p>Ye Mo hastily stood up and said, “Elder Yin, you truly are a genius alchemist. With your presence in the Ye Clan, the title of ‘Most Powerful Clan in Limestone City’ will be within reach in no time.”</p> <p>“Flattery won’t get you anywhere. What was that all about? How were you able to sustain such huge flames? Did you open your Gates?” Elder Yin asked stonily.</p> <p>“It was all thanks to your Priming Pills. They helped me open my Gate.”</p> <p>“Excellent news. However, don’t think that you can get away with stealing the Priming Pills. I want to make some more Fortifying Pills, so I want you to buy some Pill Dissociation Powder from the Hundred Treasure Pavilion. Remember, only buy the very best.”</p> <p>Pill Dissociation Powder was an essential component in the synthesis of all pills. It was not an expensive ingredient, but it was not considered cheap either. One piece of gold, which was equivalent to a hundred smaller silver pieces, could purchase one pound of powder.</p> <p>Judging by Elder Yin’s tone, Ye Mo would have to pay for the powder out of his own pocket. To Ye Mo, one hundred silver pieces was such a large expense that even if he sold his own body, he didn’t think he’d have that much money.</p> <p>“But Elder Yin, it’s too costly—!”</p> <p>Before Ye Mo could finish his sentence, Elder Yin interjected, “Don’t tell me you’re expecting me to pay for that too? I’ll look for a new apprentice in a few days. If you still haven’t brought back the Pill Dissociation Powder by the time I’ve found my new apprentice, I will send you to the torture chambers.”</p> <p>“Fine!” Ye Mo pushed through gritted teeth. Not an ounce of sympathy from this old man.</p> <p>After Elder Yin created some more Priming Pills, he stopped synthesizing pills and hid the Priming Pills away, whereas the Fortifying Pills, he decided to carry them himself for safekeeping. Before he left, he gave Ye Mo instructions to clean up the chamber.</p> <p>Once Ye Mo was done cleaning up, he returned to his bedroom.</p> <p>With the Priming Pills gone, an urgent need for one hundred small silver pieces, as well as having to avoid Ye Xiaotian seeking his revenge, Ye Mo could only work hard on increasing his skill and finding a way to earn some quick cash.</p> <p>Ye Mo sat cross-legged on the floor, concentrating on manipulating the two dragons’ into erupting his Mind’s Gate.</p> <p>Originally, Ye Mo had planned to open the Gate on his right leg first, as attack power and speed were the two most important elements in a fight.</p> <p>However, Ye Mo considered the importance of opening the Mind Gate, as it could sharpen one’s senses. Seeing as he possessed dragon power, which was stronger than Yuanli, if he opened his Mind’s Gate, could that possibly mean that his senses would also be sharper than an average person’s?</p> <p>On one hand, Ye Mo was still refining the dragon power. On the other hand, he wanted to harness the power and directed its forces to erupting his Mind’s Gate.</p> <p>Ye Mo’s dark dragon powers were remarkably stronger than the average Yuanli. With two dragons at the Gate, the process would be accelerated tremendously.</p> <p>Ye Mo went through the entire afternoon of training with heavy eyelids. Finally, he could not handle the exhaustion anymore and ceased the attack of the dragons on his Mind’s Gate.</p> <p>To an average martial artist, the Mind’s Gate was the least important and most difficult to open so many chose to open it last.</p> <p>Once all five Gates were opened, a martial artist could start practicing martial techniques and officially making a breakthrough to Spirit Cultivating First Realm.</p> <p>A sudden realization hit Ye Mo. Although he could utilize dragon power, one that could form without his command, what happened to his own Yuanli?</p> <p>“At this current stage, I’ve hit the limit with two dragons. If I utilize my Energy Center to refine the Yuan Chi of Heaven and Earth, wouldn’t the pillar be unable to absorb my Chi? Meaning I could manufacture more Yuanli?”</p> <p>Upon realizing this, he began to utilize the power of the two dragons once more. Two enormous dragons darker than the night sky emerged from the bottom of the pillar, circling around the Energy Center idly.</p> <p>Once more, Ye Mo began to refine Yuanli. True to his prediction, the pillar no longer absorbed the Yuan Chi of Heaven and Earth, and he also successfully converted Yuan Chi into Yuanli. The abundant Yuanli surged towards Ye Mo’s right hand in a constant flow.</p> <p>“Hehe, I can indeed extract my own Yuanli. However, despite it being a constant flow, it’s much less powerful than dragon power.”</p> <p>With the two different energy sources lying deep within his Energy Center, he knew full well that dragon power was far superior to Yuanli, as it could be stacked to maximize its potential.</p> <p>“Let’s see if I can use dragon power and Yuanli together.”</p> <p>As the black dragon surged towards the right hand Gate, it repelled the normal Yuanli that was flowing into the Gate, as if the Yuanli saw a ghost. As the Yuanli retreated from the scene, Ye Mo could only utilize his dragon power, but at this moment it was sufficient.</p> <p>He began to train some more, when suddenly Uncle Fu barged through the door and knelt down before Ye Mo, tears streaming down his face. “Young master, please, please save my poor, sweet granddaughter!”</p> <p>“Xiao Cao!”</p> <p>Ye Mo immediately opened his eyes and helped Uncle Fu up. His expression was icier than winter.</p>",
  "Chapter 7: Xiao Cao": "<p>Xiao Cao was Uncle Fu’s granddaughter, a very cute and sensible girl only one year younger than Ye Mo.</p> <p>Uncle Fu’s son and daughter-in-law racked up a large debt from their gambling habits, which resulted in them being horrifically beaten to death.</p> <p>Xiao Cao was nearly sold to the brothel after her parents’ demise, but fortunately, Uncle Fu arrived at the scene just in time. As the Ye Clan was a distinguished clan, he was able to save Xiao Cao from her horrible fate. Xiao Cao had been staying at the Ye Clan complex ever since and served as Ye Mei’s servant.</p> <p>Xiao Cao would always make garments for Ye Mo; most of the clothes and shoes he owned were made by her.</p> <p>Ye Mo and Xiao Cao had known each other since their childhood so they had a very tight knit friendship.</p> <p>“Uncle Fu, what happened? What happened to Xiao Cao?” Ye Mo asked urgently.</p> <p>“Xiao Cao knew you’ve been feeling quite down recently, so she wanted to surprise you with some new clothes. She even asked me to keep it a secret. But just as she arrived here to give you the clothes, Ye Ming appeared in the fields within the Ye Clan complex’s backyard and blocked her way. Not only did he tear the clothes to shreds, he even physically assaulted her. He said if you don’t show up now, he will beat her to death,” Uncle Fu said with tears in his eyes. Xiao Cao was his only family.</p> <p>Ye Mo furrowed his brows. Ye Ming evidently did this to Xiao Cao because of him. Ye Mo said, “Uncle Fu, you should report this to Ye Mei. As Xiao Cao is her servant, she will most likely interfere. I’ll go find Xiao Cao right now.”</p> <p>Without a moment to lose, Ye Mo ran towards the fields. Since he beat up Ye Xiaotian, Ye Ming’s actions were clearly an attempt to get back at him.</p> <p>Although Ye Ming did not have much natural talent, he was still someone who had unlocked four of his Gates. Among those who were still in the Corporeal Strengthening Realm, he was considered the strongest ones. Ye Mo might have had dragon power as an advantage, but his speed was below Ye Ming’s. If Ye Mo had opened his Mind Gate, he might have stood a chance.</p> <p>Nevertheless, Ye Mo had no time to mull over things now. Xiao Cao was Uncle Fu’s granddaughter and someone he considered his little sister. He had no other option but to save her.</p> <p>A servant girl being beaten to death was not an uncommon occurrence in the Ye Clan.</p> <p>As Ye Mo worried about all of this, he realized that he had already arrived at the fields. Ye Ming stood there, an arrogant grin on his face, and behind him was the silhouette of a cowering young girl, Xiao Cao. Ye Mo noticed the blood stains on Xiao Cao’s face and began to feel his blood boil with rage.</p> <p>Xiao Cao was merely a civilian with no powers. This kind of beating would take a huge toll on her body.</p> <p>On the other hand, Ye Ming, a member of the Main House, would not suffer any serious consequences even if he killed Xiao Cao. Standing behind Ye Ming was Ye Xiaotian, his hands bound with fresh bandages, his face twisted with savagery.</p> <p>Ye Ming took one look at Ye Mo and sneered. “I can’t believe you really came to die. Xiaotian, what say you?”</p> <p>“If you want this little servant girl to live, I want you to break your own four limbs and lick my toes,” Ye Xiaotian said, and with that, he kicked off his shoe and dug his feet into the mud.</p> <p>“Young master Ye Mo, don’t worry about me! You’re a man of status in this family, whereas I am only a servant,” cried Xiao Cao as she mustered up her remaining strength, her delicate features marred by blood stains and her slightly hollowed cheeks.</p> <p>“Ye Ming, beating up an unarmed servant girl, don’t you have any shame?” said Ye Mo coldly.</p> <p>“Shame? You beat up Xiaotian, which is equal to you beating me up. In our clan, no one crosses me,” said Ye Ming, who lifted a foot and slammed it down onto Xiao Cao’s face. He continued, “Xiaotian, step forward and let him lick your toes. If he refuses, I will smash this girl’s brains out.”</p> <p>He wanted really badly to humiliate Ye Mo. The sheer audacity of this garbage! How dare he walk all over them! He must have a death wish.</p> <p>“Hehe, thank you brother Ye Ming!” Ye Xiaotian said, gleefully stepping forward.</p> <p>“Ye Mo, hurry up and lick this. Otherwise she will die.”</p> <p>“Don’t do it!”, Xiao Cao said weakly as she curled up into a ball.</p> <p>Ye Mo clenched his fists and stared at Ye Ming and Ye Xiaotian with burning rage, and then spat out, “Fine, I’ll lick it!”</p> <p>Ye Mo slowly approached Ye Xiaotian and knelt down before him, his right hand having already stored up the power of one dragon. Ye Xiaotian grinned smugly at Ye Mo, and Ye Ming had a similar expression on his face, as if he was watching a farce.</p> <p>“Hahaha, Ye Mo, weren’t you so arrogant before? Weren’t you saying how you would beat me every time you saw me?” Ye Xiaotian taunted, snickering with glee.</p> <p>“Lick it!”</p> <p>Ye Mo hung his head low. As he narrowed his eyes, a glint appeared in the air. He grabbed Ye Xiaotian’s leg and applied some light pressure. The crisp noise of breaking bones resounded as the two stones of strength made their way onto his leg, causing Ye Xiaotian to cry in pain.</p> <p>Ye Ming’s face grew dark. He had not predicted that Ye Mo would dare to fight back. Not only was Ye Mo’s skill much inferior to his, he also had a hostage.</p> <p>Ye Mo pulled Ye Xiaotian up, and before Ye Ming could react, he hurled Ye Xiaotian like he was throwing a weapon at Ye Ming. Ye Ming caught Ye Xiaotian, who was already unconscious. Ye Ming was caught off guard by the power of the attack and lost his footing for a moment.</p> <p>Ye Mo rushed towards Xiao Cao, picked her up and ran away as quickly as his legs could carry him.</p> <p>“Escape? You wish!” Ye Ming quickly put Ye Xiaotian down and ran towards Ye Mo with explosive force.</p> <p>Windward Dash!</p> <p>A martial technique of mid-grade spiritual level in Ye Clan, suitable for those below the Spirit Cultivating Realm. If performed correctly, one’s body could transform into a gust of strong wind, greatly increasing their speed.</p> <p>As Ye Ming had opened the Gates in his two legs, his speed was already faster than that of Ye Mo’s. Coupled with Windward Dash, he caught up to Ye Mo within the blink of an eye. His hand shot towards Ye Mo’s head.</p> <p>“Die!” Two channels of dragon power were completely absorbed by the Gate on Ye Mo’s right hand. He turned around and aimed his fist towards Ye Ming and channeled all four stones of strength into Ye Ming’s arm, causing a loud collision of fist and palm .</p> <p>Ye Ming’s face was drained of all color as the pain rippled up his arm, causing him to fly backwards and fall onto the ground with a loud thud. His face was contorted in pain.</p> <p>“All of you, come out and beat Ye Mo to death!” Ye Min shouted and grasped his injured arm as he tried to suppress the pain.</p> <p>With that, the five servants that had hide in the bushes beforehand swiftly formed a ring around Ye Mo, trapping him. These five servants had all opened at least three to four Gates, and among them, one had already ascended into the Spirit Cultivating Realm. All five servants held a wooden baton.</p> <p>One of the servants swung at Ye Mo’s head with their baton, the baton making whipping sounds as it slashed through the air. Clearly, it was a rather powerful weapon.</p> <p>Wham!</p> <p>Ye Mo’s right fist intercepted the blow, but the baton did not crack into two. In fact, the impact sent tremors down his right hand.</p> <p>The baton was a Mortal Weapon!</p> <p>Weapons also had ranks. In ascending order of power were: Mortal Weapons, Magic Weapons, Spirit Weapons, Bejewelled Weapons, Celestial Weapons, Immortal Weapons, and Legendary Artifacts. Mortal Weapons and Magic Weapons were both rather common, and although Mortal Weapons could not be infused with Yuanli, they were extremely durable. Most normal weapons would have broken ages ago.</p> <p>“Don’t just stand there! Keep beating him!”</p> <p>Apart from the servant, who had already reached Spirit Cultivating Realm, all of the others continued to mercilessly beat Ye Mo with their batons. Ye Mo’s left hand was holding Xiao Cao, and with four people around him, he could only use his right hand to shield the attacks.</p> <p>It was true that as long as the Energy Center was intact, any injury would lead to recovery with good treatment. However, if the head was under substantial damage, it might cause mental retardation or other similar issues.</p> <p>Whack! Whack!</p> <p>The batons continuously pounded on Ye Mo’s right arm, and the dragon power within him also began to slowly fade away.</p> <p>“Oh no! I’ve used up my dragon power.” Once the dragon power was depleted, Yuanli surged into the right hand Gate, replenishing Ye Mo’s energy. But how could Yuanli alone resist the attacks of multiple Mortal Weapons?</p> <p>Whack!</p> <p>Another hit him, sending Ye Mo falling straight to the ground.</p>",
  "Chapter 8: The Power in His Blood": "<p>Ye Ming jumped to one side while holding his right arm. He could feel the pain coming from it. As soon as he saw that Ye Mo was struck to the ground, he shouted angrily, “Don’t stop! I’ll take full responsibility if he dies!”</p> <p>The four servants received their order and continued to hit Ye Mo with no mercy.</p> <p>“Young Master Ye Mo, please leave Xiao Cao alone. They will kill you if this keeps up.” Xiao Cao was pained from seeing Ye Mo getting hurt.</p> <p>One of the servants hit Ye Mo in his back, and that angered Ye Mo. The Eye of the Blood Ruby appeared again. Ye Mo felt his blood boil. The spiritual energy from the Blood Ruby surged out from Ye Mo’s blood.</p> <p>“Argh!” Ye Mo roared. A wave of red spiritual energy exploded from Ye Mo’s body, sending all four of the servants flying. They laid on the ground and spat blood from their mouths, groaning in pain.</p> <p>Ye Mo stood up slowly. The Eye of the Red Ruby was intimidating. Ye Ming began to back off a little. He felt that the guy standing in front of him could be stronger than the Young Lord, Ye Changsheng.</p> <p>He quickly ordered the servant that was in the Spirit Cultivating First Realm to stop Ye Mo. “So-someone stop him! Now! That guy must’ve eaten some high-grade pill from Elder Yi!”</p> <p>Ye Ming stared at Ye Mo’s changes and continued to back up.</p> <p>The servant acknowledged the order from Ye Ming and blocked Ye Mo’s path. He rushed towards Ye Mo as he threw his fist so fast, Ye Mo saw doubles.</p> <p>Yet Ye Mo did not even try to evade the incoming attacks and took them head-on. Just as the servant’s fist was about to hit Ye Mo, red ripples began to form around him, shielding him from the attacks.</p> <p>The power from the dragon’s bloodline held the strength of ancient creatures. Ye Mo was like a beast in human skin, strong and impenetrable. A mere Spirit Cultivating Realm martial artist posed no threat to him.</p> <p>Ye Mo wrapped his fist with red spiritual energy and threw a punch with the force of a cannon.</p> <p>Bang! Ye Mo’s punch had put a hole in the servant’s chest and blood began to spew everywhere. Ye Mo withdrew his hand. The red spiritual energy had changed into a dragon claw. He started to stroll towards Ye Ming, one step at a time.</p> <p>The scene that Ye Ming had just seen made him piss his pants. His legs began to shake as he noticed Ye Mo was walking towards him.</p> <p>“P-please, Ye Mo. Don’t kill me!”</p> <p>But Ye Mo could not hear anything. Ye Qin’s death had deeply affected Ye Mo’s reasoning and led him to fully activate the power of the Dragon’s Bloodline. Though strong, he still lacked the will to control the newfound power and had become a killing machine. All he could think of at that moment was to kill Ye Ming, who was standing in front of him.</p> <p>Xiao Cao was lying on the ground as she raised her head and saw what Ye Mo was doing. She could feel that something evil was lurking inside Ye Mo and knew that he was going to kill Ye Ming. “Young Master Ye Mo! You mustn’t kill Ye Ming!” Xiao Cao shouted.</p> <p>Ye Ming was the son of Ye Qiu. Ye Mo would have to dig his own grave if he’d killed Ye Ming.</p> <p>“Stop! Don’t think for one second that you could live if you kill me!”</p> <p>Ye Ming backed up as fast as he could, keeping the last of his cool in front of the terrifying Ye Mo. What kind of pill did he take to become like that?</p> <p>“Ye Mo!”</p> <p>The shout from Xiao Cao pierced through Ye Mo’s mind. The red spiritual energy that was surrounding him started to fade back into his blood. The Eye of the Blood Ruby was also gone. Ye Mo stood still on the ground and looked around him. “What just happened?” Ye Mo asked.</p> <p>Ye Ming noticed that the effect from the pill has started to fade. He tried to talk his way out of trouble. “Ye Mo! I’m going to let whatever happened today slide. None of us are going to owe one another!”</p> <p>Ye Mo looked around. All four of the servants were on the ground. A hole could be found around the heart of the servant that had reached the Spirit Cultivating Realm. He was lying in a puddle of blood.</p> <p>Ye Mo glanced at his right hand, which was dyed red, and was shocked when he realized what had happened. Did I do all these? What in the world just happened?</p> <p>Yet Ye Mo was quick to grasp the situation. “Let this slide? It won’t be that simple, Ye Ming,” Ye Mo said coldly.</p> <p>“Ye Mo! You’d better not push it. You just killed one of my servants that has already reached the Spirit Cultivating Realm. That alone is a huge crime. You’ll be in serious trouble if I report this to the Legal Division!” Ye Ming said.</p> <p>“Report to the Legal Division?” Ye Mo snorted. “A guy that hasn’t even reached the Spirit Cultivating Realm managed to defeat all these people. Who do you think the higher ups in the Legal Division would help? They definitely won’t blame it on me. Instead, they will try to help me reach a higher level as much as possible,” Ye Mo replied. Now that he had mastered two channels of Dark Dragon Energy, killing Ye Ming would be easy.</p> <p>“What do you want then?” Ye Ming started to worry.</p> <p>“I don’t mind that you hurt me, but I won’t overlook the fact that you hurt Xiao Cao too. 100 silver pieces should be enough as compensation.”</p> <p>“What? 100 silver pieces?!” Ye Ming was furious. Ye Mo was trying to suck him dry. 100 silvers were still a considerable amount of fortune, even for Ye Ming.</p> <p>“Too little? You’re right, I suppose a young master of the Ye Clan is worth far more than that,” Ye Mo said.</p> <p>Ye Ming took out a piece of gold from his pocket unwillingly and threw it to Ye Mo. He felt his heart wither as he did so. “At least you will be dead before you get to use the money,” Ye Ming threatened.</p> <p>Ye Mo laughed off the threat and caught the gold. He put it into his pocket and carried Xiao Cao off the grass field.</p> <p>After Senior Fu had heard that Xiao Cao was being bullied from Ye Mo, he quickly ran and told Ye Mei. As soon as she heard that Ye Ming had actually beaten Xiao Cao, she ran to the grass field only to find no one there. But it was clear as day that someone had fought there not long ago.</p> <p>“Looks like we’re late, Senior Fu,” said Ye Mei. Ye Mo hadn’t even passed the Entrance Exam yet; coming here could only lead to his death.</p> <p>Senior Fu started to worry. “I’ll go back and check. Maybe the young master has already saved Xiao Cao.”</p> <p>Ye Mei shook her head and followed Senior Fu. Ye Ming, that b*stard! He could only come back and bully Ye Mo as he was always intimidated by young masters from other clans. But Ye Mo didn’t possess enough strength to save Xiao Cao?</p> <p>Ye Mo carried Xiao Cao back to his room and let her swallow a Revitalize Pill. After helping her to recover through his spiritual energy, her internal injuries were almost cured, but her external injuries still hadn’t been treated and they needed to take care of it as soon as possible or it will risk infection.</p> <p>Ye Mo went and fetched a bucket of water to help Xiao Cao clean her face. Ye Ming’s footprint could still be seen on her refined face and it pained Ye Mo to see it.</p> <p>Ye Mo immediately applied some medicine on Xiao Cao’s injuries. When he was done and ready to leave the room, Senior Fu and Ye Mei came running towards his room.</p> <p>“Young Master! Are you all right? Where’s Xiao Cao?”</p> <p>“I’m fine. Xiao Cao has sustained some minor injuries. She’s asleep now and should wake up in around six hours,” Ye Mo replied.</p> <p>After confirming the situation with Ye Mo, Senior Fu and Ye Mei let out a sigh of relief and went inside the room.</p> <p>“Ye Mei, I’ll leave Xiao Cao to you. I have something to do in the town,” Ye Mo said as he was leaving. The gold that he’d blackmailed from Ye Ming would be enough to buy him a Pill Refining Powder at the Hundred Treasure Pavillion.</p>",
  "Chapter 9: The Hundred Treasure Pavillion": "<p>Fights within the Ye Clan usually weren’t reported to the Legal Division unless someone died. Even though Ye Ming had lost a servant of the Spirit Cultivating Realm, it didn’t affect him that much.</p> <p>There was another reason that Ye Ming was afraid of telling the higher-ups. If the higher-ups knew of Ye Mo’s strength, they would definitely put him in an important position. Of course, Ye Ming wouldn’t be that dumb.</p> <p>Even if Ye Ming wanted to take care of him, he would definitely take the matter into his own hands. If the news spread that Ye Mo had defeated Ye Ming, it would embarrass Ye Ming. He would become a laughing stock if the news spread to other clans.</p> <p>That’s why Ye Mo didn’t worry of any retaliation from Ye Ming. As long as he could get his hand on the Pill Refining Powder, he could continue his training without worry. If he was able to break through the Mortal Gate in his mind, then he himself would be more than enough to deal with 10 people at Ye Ming’s level.</p> <p>After he had taken a first-grade Revitalization Pill, he began to meditate for 12 hours. With the combined efforts, his injuries were completely healed. As long as their Energy Center was not injured, any martial artists would be able to recover using these pills.</p> <p>The Hundred Treasure Pavillion was a sanctuary for martial artists. As long as they had the money, they could buy all sorts of martial arts techniques, weapons, pills, and charms there. It was said that the Hundred Treasure Pavillion didn’t belong to any of the Limestone clan but belonged to the wealthiest clan in the kingdom, the Qi Clan, a clan with tremendous power with businesses all around the Tianwu Kingdom.</p> <p>Ye Mo left the Ye Clan’s mansion through the back door. After a few turns here and there, he finally saw a pavilion made of gold. “Hundred Treasure Pavillion” was written on the sign in front of the three story building. Guards could be found at every corner of every floor.</p> <p>Ye Mo walked into the pavilion. Many displays were laid out in the building with many eye-attracting products and materials on them.</p> <p>A woman dressed in Chinese gown walked slowly towards Ye Mo’s direction, her sexy figure moving with every step she took.</p> <p>Ye Mo was dumbstruck by the woman as soon as he saw her. Every inch of her body shouted sexuality, attracting quite a few pairs of eyes.</p> <p>The woman noticed Ye Mo and asked, “Little brother, do you need any assistance?”</p> <p>“For your information, I’m not little,” Ye Mo replied.</p> <p>The woman were intrigued by Ye Mo’s reply. “That’s funny. You look like you haven’t reached adulthood yet,” teased the woman.</p> <p>“What a nymph! Dad was right, beautiful girls will only be a man’s downfall.” Ye Mo stared at the woman’s face and immediately said, “I’m here to buy a Pill Refining Powder.”</p> <p>“I’m sorry, little boy, all of our Pill Refining Powders are sold out. You’ll have to wait a few days before we stock up,” the women apologized.</p> <p>Some of the sellers in the building sighed and wondered why the beauty of Hundred Treasure Pavilion, She Qiyin, suddenly changed her taste in man.</p> <p>“Sold out! You’ve got to be kidding me…” Ye Mo replied in surprise. The Hundred Treasure Pavilion was the largest merchant guild in the city. It was impossible for anything to be sold out.</p> <p>“Someone from Qin Clan came and bought out all of our Pill Refining Powders around noon yesterday.” Qiyin smiled.</p> <p>The four biggest clans in Limestone City were formed by the Qin Clan, the Ye Clan, the Xiao Clan, and the Mo Clan. Of course, there were other smaller clans in the city, but they were nothing when compared to any of these clans.</p> <p>The Qin Clan, the strongest clan in Limestone city, was the head of the four biggest clans. The head of the Qin Clan, Qin Hao, was the city lord of Limestone City and his younger sister was the concubine of the Tianwu Kingdom’s own emperor. To put it simply, the head of the Qin Clan is one of the emperor’s relatives.</p> <p>Why would the Qin clan buy such a massive amount of Pill Refining Powder? Ye Mo wondered. The amount of powder used in pill refining was one of the most important aspects. Even though a mere five ounces of powder might seem little, it was more than enough to refine hundreds of cauldrons worth of pills. Is the Qin clan going to mass produce pills or something?</p> <p>Ye Mo had to leave without the Pill Refining Powder, but just as he was leaving, he noticed a piece of charm was sitting on one of the counters. The charm was drawn using spiritual energy itself and was emitting waves of energy. Even though Ye Mo could not understand what was drawn on the charm, he could feel the lightning element energy emitting from the charm.</p> <p>A charm! Ye Mo shouted in his mind. It was a charm that sealed his father’s Energy Center.</p> <p>Occupations like alchemy or crafting were some of the most common professions, but a charm master was the most dignified job in the whole Lingwu Continent. They have the skills to create charms with different effects, some even able to control beasts to fight for them.</p> <p>In all of the millions of people in Limestone City, there were only a total of three charm masters.</p> <p>“What does this charm do?” Ye Mo went to the counter and asked.</p> <p>“This is a level one lightning attack charm. It holds the power of lightning in it, and by placing it on a person’s palm, it enables that person to use a high damage lightning spell once,” explained the shopkeeper. “The power of the charm will go up if it is used by a martial artist who specializes in lightning elements. Most martial artists that haven’t reached the Spirit Cultivating Fifth Realm won’t dare to take the attack from this charm head-on.”</p> <p>“That’s way too strong. How much does it cost?” Ye Mo asked.</p> <p>“One gold.”</p> <p>Ye Mo was instantly defeated by the extremely high price. Being a Charm Master does really fills one’s pocket. A simple charm like this one here could sell for one gold! Ye Mo was not stupid enough to spend a piece of gold on some charm. If he did not return with some Pill Refining Powder, Elder Yin would definitely be furious. “I’ll come again tomorrow.”</p> <p>Ye Mo returned to his room to find that Ye Mei has already taken Xiao Cao back to her room. Even though Ye Mei was like a spoilt princess, she cared for her personal servant a lot. Also, Xiao Cao was hardworking and caring. Anyone would’ve loved her as long as they weren’t too spoilt.</p> <p>Senior Fu has already prepared Ye Mo his dinner. He went straight back to training. Even without the help of a Spirit Cultivating Pill, Ye Mo was able to awaken two of his dragon energy channels. But Ye Mo’s training had become slower. It was still too far fetched for a person to open his mind’s Mortal Gate in a short time.</p> <p>Ye Mo spent the whole night trying to break through his mind’s Mortal Gate with the two channels of dragon power. Experiencing headaches and dizziness were norms when a martial artist tried to break through this mind’s Mortal Gate. That could very well be the reason why most chose to target that specific area after they had broken through all other Mortal Gates.</p> <p>Ye Mo switched to targeting his legs’ Mortal Gates when he had reached his pain threshold. When his dizziness had cleared, he went back to his mind’s Mortal Gate again. If the two channels of Dragon Energy ran out, the Rising Dragon Pillar would automatically absorb natural energy to replenish the two channels of Dragon Energy.</p> <p>The next day, Ye Mo practiced martial arts the whole morning. He rushed to the Pill Refining Room after he had his lunch and waited for Elder Yin to arrive.</p> <p>“Ye Mo! Prepare the fire! I’m going to refine 10 cauldrons worth of Spirit Fortifying Pills today,” Elder Yin shouted with his rough voice and came in carrying various herbs.</p> <p>“Why are we making such a huge amount of pills today?” asked Ye Mo.</p> <p>“The Limestone Champion List’s Tournament is in two months time. The clan leader has asked me to make more Spirit Fortifying Pills for the young masters hoping to break through their current limits before the tournament,” replied Elder Yin as he suddenly felt something was off. “You little brat! Don’t ask so much! Hurry up and start the fire! By the way, did you get the Pill Refining Powder?”</p> <p>The Limestone Champion List is a list of the most powerful martial artists under the age of 16. Only the top 10 strongest of the whole city could make it to the list.</p> <p>Even though the four big clans were peaceful on the outside, they had been comparing each other in secret for as long as anyone could remember. The top spots of the Champion List were one of the things that they always fought over. The top five martial artists of the list had the chance to be scouted by one of the Three Major Alliance.</p> <p>“I went to the Hundred Treasure Pavillion yesterday, Elder Yin. Their powders were all bought by the Qin Clan,” Ye Mo replied.</p> <p>As soon as he heard the reply, Elder Yin continued his shouting, “You better go and find me some Pill Refining Powder! I won’t be able to refine any pill without it. If that happens, I’m going to send you to the Legal Division and charge you with embezzlement! And why isn’t the fire made yet?!”</p> <p>“Hmph! That’s it! I’m quitting after I get him his Pill Refining Powder!” Ye Mo rued and went to start the fire. Even though they belonged to the same clan, people like Ye Changsheng got a free pass from all the hard labor; they had the privilege to use both the Spirit Enhancing Pill and Spirit Fortifying Pill while Ye Mo was relegated to starting fires in the Pill Refining Room. “Power! This was all because of the difference in power!</p>",
  "Chapter 10: The Third Dragon Energy": "<p>Ye Mo was beat after he finished helping Elder Yin refine 10 cauldrons of pills. His Spiritual Energy was exhausted.</p> <p>As Elder Yin saw the situation Ye Mo was in, he pitied him and gave him five Spirit Fortifying Pills. These pills were second-grade pills, 10 times stronger than the Spirit Cultivating Pill.</p> <p>Ye Mo was touched by Elder Yin’s gesture and kept those pills in his pocket. After seeing Elder Yin off, Ye Mo tidied the Pill Refining Chamber and went back to his own room.</p> <p>Ye Mo quickly sat down and ate a Spirit Fortifying Pill. As soon as he swallowed the pill, he felt a surge of heat from his throat go straight to his Energy Center. The effect of the pill merged with his own Spiritual Energy, allowing him to access his energy 10 times faster than before. The concentration of the energy was also denser than what he could summon. It was at a whole new level.</p> <p>Ye Mo began to manifest his Dragon Energy and tried to break through his mind’s Mortal Gate before the pill’s effect disappeared. When the first channel of Dragon Energy was gone, Ye Mo manifested the second Dragon Energy and continued to charge his Mortal Gate until his head began to ache.</p> <p>“This Spirit Fortifying Pill sure is something. No wonder those geniuses could be that strong; it was really all because of the pill,” Ye Mo sighed. But in the meantime, he had the incredible Dragon Energy in his arsenal, and with enough time, he believed he could surpass all of them. He wanted to prove that he was far stronger than his father.</p> <p>Ye Mo spent the whole evening training and meditating and eventually consumed all five Spirit Fortifying Pills.</p> <p>He felt that if he had a few more pills, he could’ve broken through his mind’s Mortal Gate in one go.</p> <p>When Ye Mo had completed his training, it was already nightfall. Senior Fu had already prepared his dinner for him. Ye Mo was deeply touched by his gesture. He ate his dinner and went straight to sleep.</p> <p>Any form of training required the martial artist to be flexible and understand their own limits. If they trained too long or too intensely without rest, the training backfired. High-intensity training actually harmed the martial artist’s body.</p> <p>Ye Mo woke up early the next day. After he’d brushed his teeth and washed his face, he went out to purchase Pill Refining Powder. If he could get on Elder Yin’s good side, he might just give him a few more pills.</p> <p>Ye Mo arrived at the Hundred Treasure Pavillion. The beautiful Qi Yin walked towards him, her body once again moving sensually. She’d changed into a white Chinese gown, a very different style than what Ye Mo had seen last time.</p> <p>“Little brother, you’re right on time. We just stocked up on some Pill Refining Powder.” Qi Yin had a smile on her face that could attract any man she wanted.</p> <p>Ye Mo was glad to hear the good news. “Great! Can I get two ounces of it?”</p> <p>Even though two ounces sounded little, any alchemist knew that it was more than enough. As the manager of the Hundred Treasure Pavillion, Qi Yin had already guessed that Ye Mo was just an assistant. She smiled at Ye Mo and said, “Follow me.”</p> <p>Qi Yin led Ye Mo to a counter and asked the staff there for two ounces of Pill Refining Powder. Just as the staff was about to hand Ye Mo the powder, a hand stretched out and grabbed the powder from the staff.</p> <p>“All of the Pill Refining Powders here now belong to me, Mo Feng!”</p> <p>Ye Mo turned and saw where the voice came from. The guy had long black hair and the face of a warrior. He wore a black robe and stood proudly. A guy and a girl followed behind him, both of them with an air of arrogance about them.</p> <p>Ye Mo knew who Mo Feng was. He was a member of the Mo clan who held the tenth spot on last year’s Limestone Champion List. He was not only a martial artist but also an alchemist.</p> <p>“My apologies, Mr. Mo. These two ounces of powder were bought by this little brother here first.” Qi Yin flaunted her sexiness as she spoke and made Mo Feng stagger.</p> <p>“There’s been a shortage of Pill Refining Powder in the Mo clan recently. I’ll pay double for those two ounces.” Even though Mo Feng looked elegant and refined, his eyes were glued to Qi Yin’s half-covered rack.</p> <p>“I don’t think that’s a good idea.” Qi Yin hesitated in front of the arrogant Mo Feng. Even though the trust of the customers was important in doing business, it was not worth it to offend the Mo clan over a mere assistant. Also, even though the Qi Clan was the strongest in the whole kingdom, they were still inside the Mo Clan’s territory.</p> <p>“Miss Qi Yin, I hope you will consider the matter carefully,” Mo Feng said as he saw Qi Yin begin to hesitate.</p> <p>Mo Feng was clear about what he wanted. Qi Yin acknowledged the situation and spoke in her sensual voice, “Of course. There’s nothing to consider. All the powders are yours to take.”</p> <p>Mo Feng nodded in satisfaction and took the powders. He never looked at Ye Mo even once.</p> <p>Ye Mo saw the whole thing, but he was not angry. This was how the world was: justice is futile in front of the powerful. This was a world where the strong preyed on the weak.</p> <p>Suddenly, a loud, sharp slap rang out and stunned the whole crowd.</p> <p>Ye Mo snatched the powder from Mo Feng and said calmly, “I’m the one who purchased it first. It’s mine.”</p> <p>Mo Feng was also stunned by the slap from Ye Mo. He looked at Ye Mo and saw a boy wearing a black robe that was starting to lose its color and a pair of canvas shoes with patches on them. From Ye Mo’s appearance, Mo Feng understood that he was not an apprentice of an alchemist but only a mere assistant.</p> <p>Mo Feng never thought that a mere assistant would dare to stand up to him.</p> <p>Qi Yin opened her mouth slightly, stunned by what had just happened. She thought to herself, Little brother, are you out of your mind? This is the young master of the Qi clan you’re offending.</p> <p>Even the crowd was rendered speechless. The alchemist’s assistant in front of them had no idea of his place. Mo Feng was one of the top members in the Mo Clan; he had already reached the Spirit Cultivating Second Realm. On top of that, he was an alchemist.</p> <p>The top five of the previous Limestone Champion List had already joined the Three Major Alliance. The man that Ye Mo was staring at had the potential to become one of the new top five.</p> <p>“Little brother, I think you should let this slide. I’ll save some for you when the new stock arrives tomorrow,” Qi Yin suggested as she did not want to see Ye Mo do something offensive towards Mo Feng.</p> <p>“Thanks, but if this keeps happening, then the powder will be taken by the Ye Clan or the Xiao Clan tomorrow. I’m taking this powder back, no matter what it takes.”</p> <p>“Then take it if you can.” Mo Feng smirked as he grabbed Ye Mo’s arm, unleashing all of his Spirit Cultivating Second Realm powers.</p> <p>Martial artists of the Spirit Cultivating Second Realm possessed the the strength of four stones, which equalled to about 1050 pounds. The hand of an average person would be pulverized by that kind of force.</p> <p>The people around them started to pity Ye Mo.</p> <p>Ye Mo felt Mo Feng gathering his power. He instantly manifested the Dragon Energy to the Mortal Gate on his right hand to increase his grip strength. A dragon’s roar could be heard from his Mortal Gate, and Ye Mo unleashed a force that was on par with four stones.</p> <p>Mo Feng felt the pressure coming from Ye Mo, and his face darkened. How is it possible for this little assistant to reach the Spirit Cultivating Second Realm? It’s presumptuous!</p> <p>The two kept testing each other’s strength, determined to win the fight.</p> <p>Both of their faces reddened. They were putting all their powers into this test of strength. The crowd began to wonder how the alchemist’s little assistant was able to reach the Spirit Cultivating Second Realm; he looked younger than Mo Feng.</p> <p>“So, he actually has something up his sleeves!” Qi Yin exclaimed.</p> <p>“Little brat! Looks like I mistook you for some weakling but I’m still not giving up the powder!” Of course, Mo Feng would not back off. If the power of those two were at the same level, then it was going to be a battle of their Spiritual Energy reserves.</p> <p>Ye Mo began to waver. Even though the two channels of Dragon Energy were able to fight toe to toe with Mo Feng, he wouldn’t last very long. The Rising Dragon Pillar would able to replenish his energy, but it still needed some time. And what’s more was that he was using both channels at the same time.</p> <p>As he started to feel the Dragon Energy fading, Ye Mo began to panic a little.</p> <p>“Hmph! Can’t hold on any longer, can you? There is no way that I’m going to lose to a mere assistant!” Mo Feng laughed as he started to feel Ye Mo’s strength lessen.</p> <p>The two people standing behind Mo Feng abegan to smirk. If the young master of the Mo Clan could not even defeat a helper, they would definitely become a laughing stock.</p> <p>Ye Mo kept urging the energy in his Energy Center to pour their power into the black Dragon Pillar. Suddenly, Ye Mo felt a surge of energy rush to the pillar and out came a third channel of Dragon Energy.</p> <p>“Rargh!” Ye Mo shouted as the dragon began to roar in his Energy Center. The third Dragon Energy rushed towards the Mortal Gate in his right hand.</p>",
  "Chapter 11: Xiao Yue": "<p>A smile began to form on Ye Mo’s face. He was excited. He’d never thought that the third channel of the Dragon Energy would be awakened in such a situation. With that, his power had now risen to six stones, and he could stand toe to toe with someone of the Spirit Cultivating Third Realm. That power was enough for him to defeat Mo Feng without breaking a sweat.</p> <p>Crack!</p> <p>The sound of shattering bone rang through the crowd, and with it came a painful scream. Most of the people averted their eyes as they thought Ye Mo was defeated at the hands of Mo Feng. Even Qi Yin was on the verge of turning her head.</p> <p>Yet the scream came from Mo Feng.</p> <p>His right hand was crushed, and blood was dripping from it. Even the white bone underneath could be seen with naked eyes.</p> <p>“How is this possible?” The crowd reacted, shocked by what they had just seen.</p> <p>Ye Mo snatched the Pill Refining Powder and snorted. “So weak. Did you have too much fun last night?”</p> <p>As soon as he finished his sentence, the girl that was standing behind Mo Feng hid her face, and the crowd burst into laughter.</p> <p>Ye Mo looked at the state of Mo Feng’s hand and began to wonder if he should retreat. The fight he had a few moments ago was a fight to the death. If the Dragon Energy had suddenly rushed to his Mortal Gate, it meant that his body was in danger of collapsing from fatigue.</p> <p>And now that he’d crushed the hand of a young master from the Mo family, he was going to be in deep trouble.</p> <p>“The payment for the powder,” Ye Mo said as he threw the gold piece on the counter and rushed out the Hundred Treasure Pavillion.</p> <p>“Hey! Where do you think you’re going?” The two people that were standing behind Mo Feng shouted. They began sprinting towards Ye Mo. Before they’d even raise their feet, Mo Feng stopped them.</p> <p>Mo Feng stood up while holding his crushed arm. His face was as cold as ice.</p> <p>“That person is very suspicious,” Mo Feng said. “He only broke through his right hand’s Mortal Gate recently, yet he has the power to defeat a martial artist of the Spirit Cultivating Second Realm. Go and investigate who he is first. Don’t act rashly.”</p> <p>“No matter who you are, you’re going to pay for what you’ve done to me!” Mo Feng said.</p> <p>Ye Mo walked out of the Hundred Treasure Pavillion, regretting that he had acted on impulse a few moments ago. But Mo Feng was a bully. Even if Ye Mo had no hidden powers, he would’ve done the same thing</p> <p>Well, what’s done is done. There’s no use regretting it. But just as Ye Mo arrived outside the shop, he was stopped by a middle aged man with spiky hair and a muscular body.</p> <p>A Spirit Cultivating Seventh Realm martial artist! Ye Mo felt the energy coming from the man. His face darkened as he worried the man was a member of the Mo Clan.</p> <p>A Spirit Cultivating Seventh Realm martial artist could already be considered one of the strongest in Limestone City.</p> <p>“Relax, little brother. I’m not from the Mo Clan. My name is Xiao Feng. The lady I serve wishes to meet you,” the man said.</p> <p>“You’re from the Xiao Clan?” Ye Mo asked. “Who do you serve?”</p> <p>“M’lady’s name is Xiao Yue. She has quite the reputation in Limestone City. I suppose you’ve heard of her?”</p> <p>“Xiao Yue?” Ye Mo’s face grew even darker. Heard of her? She’s famous!</p> <p>Even though Ye Mo had yet to meet her, he’d heard about her from other Ye Clan members. She was already a beauty even though she was only 15 years old and was ranked number eight on last year’s Limestone Champion List. The most important part was that she was a Charm Master herself.</p> <p>Alchemists like Mo Feng were rare in the city, but a Charm Master like Xiao Yue was even rarer.</p> <p>That was because becoming a Charm Master was 10 times harder than becoming an alchemist.</p> <p>Xiao Yue was one of the three Charm Masters in all of Limestone City. The reason for her fame was not only due to her beauty, but also due to her job as a Charm Master.</p> <p>“Of course I’ve heard of her. But a mere assistant like me shouldn’t have anything to do with someone like Miss Xiao,” Ye Mo replied. Xiao Yue was like an angel sitting in heaven while Ye Mo was just some peasant on Earth. Even if Ye Mo did not think lightly of himself, the strength he had was nothing compared to Xiao Yue.</p> <p>“M’lady and I were in the Hundred Treasure Pavillion when you made that scene. For someone who hasn’t even reached the Spirit Cultivating Realm, you did quite a marvelous job of shutting Mo Feng up. That’s not common,” Xiao Feng smiled.</p> <p>Ye Mo shrugged and smiled, not giving Xiao Feng any answers.</p> <p>“M’lady is waiting for you at the Shining Moon Pavillion. Please come with me,” Xiao Feng said.</p> <p>Ye Mo nodded and followed Xiao Feng. The Shining Moon Pavillion was one of the most luxurious restaurants in the city. One meal could cost someone’s yearly salary.</p> <p>Xiao Feng led Ye Mo up into a private dining room where a girl was sitting inside, silent and elegant. The girl wore a snow white dress, her long dark hair hung like the Milky Way, her eyebrows were like two crescent moons, her beauty could outshine the stars, her skin was white like snow, and her aura was of pure elegance. She was like an angel that had come down from heaven.</p> <p>The only thing that upset Ye Mo was that the girl was wearing a mask that covered the bottom half of her face.</p> <p>But from the shape of her face, Ye Mo guessed that behind the cloth was a beauty to which no other could compare.</p> <p>Xiao Yue stood up as she saw Ye Mo approaching, her eyes shining. “My friend, please, sit.”</p> <p>Ye Mo took seat in the chair. “Miss Xiao, what do you need from this little assistant?”</p> <p>“Let’s get straight to the point, shall we? I’d like to work with you,” Xiao Yue replied.</p> <p>“Work with me?” Ye Mo startled. “Miss Xiao, I’m just an average assistant.”</p> <p>“Could a normal assistant possess the strength to crush the hand of the Mo Clan’s young master?” Ye Mo replied with an awkward smile.</p> <p>“May I know of your name?” Xiao Yue asked.</p> <p>“Ye Mo.”</p> <p>“You’re from the Ye Clan?” Xiao Feng asked in surprise.</p> <p>“Yep. Just an assistant in the Ye Clan.”</p> <p>“Such a treasure was wasted on an assistant! What was Ye Kuang thinking?” Xiao Feng said.</p> <p>“Beats me.” Ye Mo has already given up all hope on the Ye Clan. His father Ye Qin used to bring them such glory, but they didn’t even give him a proper funeral after his death.</p> <p>“Looks like the Ye Clan wasn’t treating you well. A genius like you shouldn’t be wasted just being an assistant,” Xiao Yue smiled.</p> <p>“Skip the formalities. What do you need me to work with you on?” Ye Mo asked.</p> <p>“Since you hurt Mo Feng, he’ll definitely come back for revenge. He could easily find out who you are, and Ye Kuang wouldn’t be that stupid to offend the Mo Clan just for some assistant,” Xiao Yue explained. “But I can even give you proper resources for you to train. As long as you promise me one thing.”</p> <p>What Xiao Yue offered was tempting. Yet, Ye Mo kept his cool and asked, “And what would that be?”</p> <p>“That you help me get into the top five in this year’s Limestone Champion List.”</p>",
  "Chapter 12: Limestone Champion List": "<p>The Tournament of the Limestone Champion List was held once every year. The rankings on the list reflected the strength of each clan in the city.</p> <p>Martial artists that were in the top five were scouted by one of the Three Major Alliance of Tianwu Kingdom.</p> <p>It was normal for the list to be monopolized by the four biggest clans of Limestone City, but once in a while, members of one of the minor clans fought their way onto the list.</p> <p>The tournament was a stage for lesser members of each clan to show off their skills. If they performed well in the tournament, their status in the clan rose with them.</p> <p>And those who stood in one of the top 10 spots of the list were the best of the best in Limestone City.</p> <p>The tournament’s prospects consisted of only a handful of people. The two geniuses from the Qin clan, Qin Tianmu and Qin Shaoyang, both of whom were Spirit Cultivating Fifth Realm martial artists; Ye Changsheng and Ye Ming’s brother, Ye Hou, of the Ye Clan, a Fifth Realm and Third Realm respectively; Mo Wujiang and Mo Feng of the Mo Clan, Fifth Realm and Second Realm respectively.</p> <p>The only prospect from the Xiao clan was Xiao Yue who was a Spirit Cultivating Second Realm martial artist, but her ability as a Charm Master allowed her to control a beast that had the strength of a Spirit Cultivating Third Realm martial artist.</p> <p>Yet her strength was not enough to win against the geniuses from other clans.</p> <p>If Ye Mo wanted to secure at least fifth place, he needed the power equivalent to a Spirit Cultivating Third Realm martial artist at a bare minimum. And now he had to help Xiao Yue achieve a top five ranking, too.</p> <p>Because only then will they get the chance to join one of the Three Major Alliance.</p> <p>“Miss Xiao, you’re not joking right now, are you?” Ye Mo forced a smile. With his current power, he had to rely purely on luck to defeat a First Realm martial artist.</p> <p>Even though Ye Mo had the strength of six stones, which was equivalent to a Third Realm, he still didn’t have the necessary martial art technique, skills, agility, and reaction speed.</p> <p>“No, I’m not joking. You’re from around here, you should know the situation the Xiao family is facing right now,” Xiao Yue explained. “Every other one of the three big clans has sent out at least two participants while we Xiao clan has only one. Plus, you don’t want to be ignored by others any longer, am I right?”</p> <p>“What if I fail to help you get into the top five?” Ye Mo asked. He had intended to join the tournament. Ye Qin joined the tournament at the age of 14 and won first place.</p> <p>As soon as she had heard the hint of Ye Mo agreeing, her eyes lit up. Her smile was too attractive for Ye Mo to avert his gaze.</p> <p>“You’re not a failure. With enough practice and help from the Xiao Clan, you might have a chance to get into the top five of the list.”</p> <p>“Fine. Since the beauty asked, there’s no reason for me to decline.” Ye Mo smiled.</p> <p>“Beauty? You haven’t even seen my face. How are you sure that I’m a beauty? It’s possible that I’m hiding an ugly face under this mask, you know?” Yue Xiao asked.</p> <p>“Man’s intuition!” Ye Mo replied.</p> <p>Xiao Yue replied to his comment with a smile and said, “Starting tomorrow, come to the Xiao’s mansion when you have time. Xiao Feng will personally teach you. Be prepared. The next two months won’t be easy.”</p> <p>After Ye Mo left the Shining Moon Pavillion, he went straight back the Ye’s mansion. Xiao Cao was waiting for Ye Mo in his room. Her hand was holding a set of new clothes. As soon as she saw Ye Mo return, she smiled and said, “Young Master Ye Mo, you’re finally back.”</p> <p>“Xiao Cao, didn’t I tell you not to leave Ye Mei’s side?” Ye Mo said.</p> <p>“You don’t have to worry about me, young master. Miss Ye Mei has already warned Ye Ming not to come near me again.” Ye Mei handed Ye Mo the new clothes and continued, “Here. The shirt I made last time was torn by Ye Ming. I’ve made you a new set. Try it on.”</p> <p>The clothes were made of a high quality purple fabric. It must have cost quite a fortune to make them. Ye Mo’s eyes started to tear up. All of the things that he wore were made by Xiao Cao.</p> <p>“Thank you, Xiao Cao.”</p> <p>Ye Mo took off the faded shirt in front of Xiao Cao and changed into the purple clothes. He stood in front of the mirror, admiring his new, charming looks. Ye Mo was handsome to begin with, but with these new clothes, people won’t mistake him for a poor villager ever again.</p> <p>“You look more stunning already,” Xiao Cao said and blinked.</p> <p>“It’s all thanks to you, Xiao Cao.” Ye Mo smiled.</p> <p>“Oh no! I forgot to make a new pair of shoes, too. I’ll go back and make them now and have them sent to you tomorrow.” As soon as she finished her sentence, she turned around and ran out of the room.</p> <p>Ye Mo looked at the shoes that he was wearing. They really didn’t match the top he was wearing.</p> <p>“That busy body.” Ye Mo sat down and began to meditate. He focused the three channels of Dragon Energy in his Energy Center. He was ready to break through his mind’s Mortal Gate again.</p> <p>The three channels to Dragon Energy began to roar in his Energy Center and started to rush towards his mind’s Mortal Gate.</p> <p>Buzz. When the three channels of Dragon Energy collided, it made a buzzing sound in Ye Mo’s head.</p> <p>After six hours of meditating, the three channels of energy merged together and rushed towards Ye Mo’s head. Suddenly, Ye Mo felt a surging pain coming from his head. He quickly threw his eyes wide open and grabbed his head.</p> <p>The pain kept getting worse until he finally couldn’t take it anymore and screamed in pain.</p> <p>The pain lasted for one whole minute. After that, it began to ease up slowly. Ye Mo laid on his bed head down while breathing heavily. A smile began to form on his face. “I’ve finally opened my mind’s Mortal Gate.”</p> <p>Ye Mo sat up again and guided his Spiritual Energy to his brain.</p> <p>When he opened his eyes, he finally realized the importance of opening one’s mind’s Mortal Gate. He was able to see much clearer with a heightened awareness. The mosquito that was flying in front of him even seemed slower than usual.</p> <p>“So the mind’s Mortal Gate helps boost a person’s reaction speed. Let me try using my Dragon Energy on it.”</p> <p>He controlled the three channels of Dragon Energy to rush towards the Mortal Gate. Naturally, his Spiritual Energy made way for the Dragon Energy to pass through. With all three channels in use, everything was even clearer than before. The mosquito moved even slower.</p> <p>After one month of training with the Dragon Energy, Ye Mo finally understood its theory. One channel of Dragon Energy had the attack power equivalent to two stones and possessed two times faster reaction speed than a Spirit Cultivating First Realm martial artist.</p> <p>The next morning, a dark-haired man wearing purple clothes was seen practicing martial techniques in the bamboo hill behind the Ye’s mansion. The Ye Clan had only taught Ye Mo two martial techniques, the Low-Grade Spiritual Level martial technique, the Spirit Serpent’s Palm, and the Mid-Grade Spiritual Level martial technique, the Wind God’s Kick.</p> <p>Martial art techniques were divided into four levels: Spiritual Level, Mortal Level, Supreme Level, and Deity Level. Each level was then divided into low-, mid- and high-grade.</p> <p>Ye Mo was considered lucky as a collateral member to have been able to learn the Mid-Grade Spiritual Level martial technique, the Wind God’s Kick.</p> <p>Yet, the Wind God’s Kick required the user to have at least broken through both of their legs’ Mortal Gates to maximize its potential. For now, Ye Mo could only focus on training the Spirit Serpent’s Palm.</p> <p>Ye Mo’s arm moved like a venomous snake through the air, looking for its prey. When it located its prey, his palm moved forward and struck the ironwood tree.</p> <p>Bang! Half of Ye Mo’s palm drilled itself into the wood.</p> <p>“Even though the Spirit Serpent’s Palm is a Low-Grade Spiritual Level martial technique, it’s not as bad as the Mid-Grade techniques through balancing both softness and prowess.” Ye Mo withdrew his palm and nodded. He had fully mastered the Spirit Serpent’s Palm. With just the power from his Spiritual Energy, he had dug half of his palm into the tree.</p> <p>“It’s really something that a mere collateral member could produce such force with the Spiritual Serpent’s Palm.” It was Ye Ming who spoke. Ye Mo knew that Ye Ming must have been up to something.</p> <p>“Nice shirt. Too bad your shoes are all ruined. Why don’t you change into these new shoes? It’ll make you look better,” Ye Ming said as he took out a new pair of canvas shoes.</p>",
  "Chapter 13: Stealing His Master’s Technique": "<p>Ye Mo stared at the purple shoes that Ye Ming was holding and remembered that Xiao Cao had mentioned that she wanted to make him a new pair. Ye Mo was furious. Making a pair of new shoes required a lot of time. She must’ve stayed up all night working on them.</p> <p>Ye Ming was digging his own grave.</p> <p>“Stop right there, Ye Mo,” Ye Ming said as he noticed Ye Mo’s anger. “I didn’t do anything to that servant. It seems that she’s treating you quite well.” Ye Ming waved his arms around, acting all innocent.</p> <p>“What do you want? Are you trying to use a girl as a hostage? Why not just come at me?” Ye Mo roared.</p> <p>“I was waiting for you to say that,” Ye Ming said and threw Ye Mo the shoes. “Tonight, right here, we’ll settle everything once and for all.”</p> <p>“Fine! No matter who wins tonight, you’re not to harm Xiao Cao again. If you do, I’m going to kill you,” Ye Mo said and licked his lips.</p> <p>“You better show up tonight,” Ye Ming said as he ignored Ye Mo’s threat and left.</p> <p>Ye Mo felt that Ye Ming seemed different, but chose to ignore his intuition. Now that he had awakened three channels of Dragon Energy and his mind’s Mortal Gate, a Spirit Cultivating Second Realm martial artist posed no threat to him.</p> <p>Since Ye Mei had warned Ye Ming to not touch Xiao Cao, he must not have kidnapped her, but instead took the shoes she was making for Ye Mo.</p> <p>When Ye Mo had returned to his room, he found Xiao Cao crying on the table.</p> <p>“Why are you crying again?” Ye Mo held the shoes in front of her and smiled.</p> <p>As soon as she heard Ye Mo’s voice, she quickly got up. Her eyes were filled with tears. Yet, when she noticed the shoes in Ye Mo’s hand, she quickly smiled. “Young master, you got the shoes back.”</p> <p>“Yup. Now hurry up and go get some rest. You stayed up all night making these, didn’t you?”</p> <p>After Ye Mo consoled Xiao Cao, she went back to her room. Ye Mo ate his lunch and went to the Pill Refining Chamber. A few moments after he arrived, Elder Yin came in with a few packs of herbs.</p> <p>“Ye Mo, start the fire. I still have to go to the Alchemist Guild later.”</p> <p>“Okay,” Ye Mo replied and started the fire, using the fan in his hand to keep the fire alive.</p> <p>Elder Yin threw all the ingredients into the cauldron and put the lid on. After that, he began to transfer his Spiritual Energy into the cauldron.</p> <p>Ye Mo thought as he was fanning the flame, The hardest part of pill refining is forming the shape. It depends on the how well the alchemist controls his Spiritual Energy. Each type of pill requires a different strength. Wait, what if I focus my Dragon Energy to my mind’s Mortal Gate? Would I be able to see how Elder Yin controls his Spiritual Energy?</p> <p>That said, Ye Mo diverted a channel of the Dragon Energy to his mind’s Mortal Gate, increasing his reaction speed and eyesight. This allowed him to barely see Elder Yin’s Spiritual Energy.</p> <p>Ye Mo focused a second channel of Dragon Energy into his mind’s Mortal Gate. This time, his reaction speed and eyesight tripled, and he could clearly see how Elder Yin controlled his red Spiritual Energy.</p> <p>In his mind, Ye Mo cheered. By using his photographic memory, he memorized the method used to form the Spirit Fortifying Pill.</p> <p>When Elder Yin had finished refining the cauldron of pills, he took them and left the chamber. Ye Mo was not rushed to try and refine the pills as he had to meet up with Xiao Yue at the Xiao’s mansion later that evening. He could try it next time when he had the chance.</p> <p>Ye Mo cleaned the Pill Refining Chamber and left the Ye’s Mansion through its backdoor. He brought a tiger face mask along on his way to the Xiao’s mansion and had put it on. If a member of the Ye Clan was seen going in and out of the Xiao Clan, it would bring him certain trouble.</p> <p>The Xiao’s mansion was located in the southern part of the city, which Ye Mo was walking towards. After a few minutes, a huge mansion came into his view, a mansion that was more luxurious than the Ye’s mansion.</p> <p>Ye Mo approached two of the servants guarding the door and said, “My name is Ye Mo. Miss Xiao Yue is expecting me.”</p> <p>“Yes, Master Xiao Feng has already informed us. You may enter,” one of the servants said.</p> <p>“Thank you,” Ye Mo said to the servant and entered Xiao’s mansion. The layout of the mansion was almost identical to the Ye’s mansion. Past the front gate was the training ground where a few members of the Xiao Clan were training their martial art techniques.</p> <p>“Hey, look. A weird guy in a tiger mask just came in,” one of the members said.</p> <p>“I think he’s the outside help that sister Yueyue has requested. But don’t you think he’s too weak?”</p> <p>“From the movement of his Spiritual Energy, it seems to me that he has only broken through his right hand’s Mortal Gate.”</p> <p>“Are you sure? Why would sister Yueyue invite this kind of weakling?”</p> <p>“Hmph! Let me test him. If he can’t even beat me, then he doesn’t have what it takes to help us out,” a man with dark skin said as he marched towards Ye Mo.</p> <p>“My name is Ye Mo. I was invited by Miss Xiao Yue to act as a foreign aid.” Ye Mo cupped his palm and said to the dark-skinned man. “Could you please help me inform Xiao Feng that I’ve arrived?”</p> <p>“You’ll have to go through me first before you can meet Master Xiao Feng.” The dark-skinned man let out all of his Spiritual Energy as he crouched down like a tiger and pounced towards Ye Mo.</p> <p>Spirit Cultivating First Realm! Ye Mo was still cautious when facing a Spirit Cultivating First Realm martial artist. He instantly summoned a channel of the Dragon Energy to his mind’s Mortal Gate.</p> <p>Even though the Landing Tiger was a simple technique, it required high muscle density on the legs and arms. If one had mastered its form and technique, they could very well be a fierce tiger from the wild.</p> <p>With the help of the Dragon Energy, Ye Mo’s reaction speed had increased. Ye Mo saw the accurate and powerful Landing Tiger technique, but he didn’t have the power to counter the attack, as he hadn’t yet opened the Mortal Gates in both of his legs. He could only twist his body and evade the incoming attack.</p> <p>The man relaunched his attack on Ye Mo and was once again evaded by him.</p> <p>The member of the Xiao Clan was slightly shocked by the sight of Xiao Pojun, who was a Spirit Cultivating First Realm, missing all of his attacks.</p> <p>“Are you only capable of running?!” Xiao Pojun screamed. He stabilized his position and his palm shot like a cannon towards Ye Mo’s head.</p> <p>High-grade Spiritual Level martial art technique, Air Splitting Palm!</p> <p>As soon as the martial art technique was evoked, the air exploded and torrents of wind roared towards Ye Mo.</p> <p>“Looks like the tiger-faced kid has forced Xiao Pojun to use the Air Splitting Palm. He’s good as dead.”</p> <p>Ye Mo’s expression tensed. The attack range was too wide for him to evade. He focused two channels of Dragon Energy into his right hand’s Mortal Gate. His right arm charged forward like a snake, piercing through the multi-layered winds.</p> <p>As soon as Xiao Pojun saw his attack dispelled, his expression changed and he prepared to evoke another attack.</p> <p>But Ye Mo was not going to give him the chance to attack again. The Spirit Serpent’s Palm could break through strong forces with its agile attack. What’s more was that Ye Mo’s right hand currently had the power of four stones. Ye Mo’s palm quickly wrapped around Xiao Pojun’s right arm, and with a push, Xiao Pojun was thrown back by sheer force.</p> <p>The fight ended in an instant. The members of the Xiao Clan stared at Xiao Pojun, who was now lying on the ground, unable to believe what they’d just witnessed.</p> <p>Xiao Pojun was considered second only to Xiao Yue. Even with the help of the Air Splitting Palm, he lost to a foreign aid in a matter of seconds.</p>",
  "Chapter 14: Heaven-Piercing Thrust": "<p>“Now, can anyone tell me where Xiao Feng is?” Ye Mo smiled.</p> <p>Now that he had broken through the Mortal Gates in his mind and right hand, he could easily win against Spirit Cultivating First Realm martial artists with the help of the three Dragon Energies.</p> <p>“Master Xiao Feng is in the Martial Pavilion. I’ll bring you there,” one of the disciples said as he recovered from the shock.</p> <p>“Thank you,” Ye Mo replied and followed him to the Martial Pavillion.</p> <p>In the far corner of the mansion stood the huge Martial Pavillion. Xiao Yue and Xiao Feng were standing on the balcony on the top floor and had witnessed everything that had happened a few moments ago.</p> <p>“Miss, you really know how to choose your people. At first, I wondered if it was just pure luck that Ye Mo defeated Mo Feng. Looks like I was mistaken,” Xiao Feng said.</p> <p>“He’s Ye Qing’s son. Of course he’s good,” Xiao Yue said and smiled.</p> <p>“Wait, he’s Ye Qing’s son?” Xiao Feng asked, his face full of shock. Almost everyone who lived in the Limestone City has heard of Ye Qing’s story. He won the first place of the Limestone Champion List at the age of 14 and was scouted by one of the Three Major Alliance, the Qingyun Alliance.</p> <p>During his training at the Qingyun Alliance, he’d shown extraordinary talents. In three years, he’d made himself known to the whole Tianwu Kingdom.</p> <p>“I’ve sent someone to investigate his background beforehand,” Xiao Yue said. “Just before Ye Qing went to participate in the Battle of Yidao, he had a child. And that child is Ye Mo. I’m just not sure why he remained silent for the past 15 years.”</p> <p>“Ye Mo’s already 15 now and he’d just broken through his right hand’s Mortal Gate. Are you sure that we should put our hopes on him?” Xiao Feng questioned.</p> <p>Ye Mo had already missed the golden age for him to break through all of his Mortal Gates. Martial artists that have not reached the Spirit Cultivating First Realm before the age of 15 usually failed as martial artists in the future.</p> <p>“I hope so. If he can help me get into the top five, then I don’t have to marry Man Tai anymore,” Xiao Yue said as she went back into the pavilion.</p> <p>Xiao Feng watched Ye Mo from above and sighed. “I hope she’s right about him.”</p> <p>Ye Mo followed the Xiao Clan’s disciple to the Martial Pavilion as Xiao Feng came out from it.</p> <p>“Ye Mo, follow me,” Xiao Feng said. Ye Mo nodded and followed him inside.</p> <p>“I’ve already taken care of your problems with Mo Feng, you don’t have to worry about him coming for revenge anymore. Train as much as you want at our clan’s mansion.”</p> <p>“Thank you.”</p> <p>“It will be hard for you to break through another Mortal Gate in two months. We’ll have to work on your martial techniques,” Xiao Feng said as he took out two skill books, one with the word Heaven-Piercing Thrust on it. Xiao Feng pointed to the book and said, “This book was bought for you by Miss Xiao Yue. It contains the secret to a High-grade Spiritual Level martial technique, the Heaven-Piercing Thrust.”</p> <p>Ye Mo eyes shone as soon as he heard that it was a High-grade Spiritual Level martial technique. That was the most powerful martial technique he’d ever learned.</p> <p>“What’s the other book in your hand?” Ye Mo asked curiously.</p> <p>“M’lady also bought this from the Hundred Treasure Pavilion. She pitied the guy that was selling it and bought it. But it’s an incomplete skill book. However, the guy boasted that it contained a Mid-grade Mortal Level martial technique.”</p> <p>The Qin Clan didn’t have any Mid-grade Mortal Level martial techniques.</p> <p>“Incomplete? Can I study it?” Ye Mo asked.</p> <p>“It’s incomplete. It might help with your training, but I don’t think you should waste your time on this martial technique.”</p> <p>“I just want to study it. It won’t use up a whole lot of my time.”</p> <p>Xiao Feng could not do anything but nod to Ye Mo’s persistent. He handed the second book to Ye Mo too.</p> <p>“Here are 10 Spirit Fortifying Pills. Take them and start training,” Xiao Feng said as he took out 10 pills and gave them to Ye Mo.</p> <p>“You can train here. Oh right, by the way, we also have two other foreign aids training on the second floor,” Xiao Feng said as he headed towards the second floor.</p> <p>Ye Mo clenched his teeth and crushed the pills in his hand as he heard what Xiao Feng had said.</p> <p>And here I thought Xiao Yue wanted my strength, but in the end, I’m just some back-up.</p> <p>There were a total of three foreign aids, and only the one person who could defeat the other two had the right to participate in the tournament in the name of the Xiao Clan. Since the other two were training on the second floor, it meant their power must’ve surpassed Ye Mo’s.</p> <p>“Looks like I have to defeat those two on the second floor before I can join the Limestone Champion List Tournament. No worries, they are just going to be mere stepping stones for me.”</p> <p>Ye Mo put away the incomplete skill book and opened the Heaven-Piercing Thrust skill book. The Heaven-Piercing Thrust is a finger martial technique suitable for anyone in the Spirit Cultivating Realm. It allowed the user to shape the energy around their fingers into swords. Martial artists in the Energy Shaping Realm could even conjure Blade Auras from their Spiritual Energy to kill people without any solid weapons.</p> <p>Even though the introduction to the Heaven-Piercing Thrust might have been exaggerated, Ye Mo studied the whole book and learned the secrets of the martial technique in his hand.</p> <p>Ye Mo extended his index and middle fingers and posed according to the book. He imagined his fingers were a sharp sword, and he thrust them towards the open air. A burst of cracking sound could be heard from where he’d struck and a thin layer of Spiritual Energy could be seen covering his fingers.</p> <p>“The book said that if I were to reach the Energy Shaping Realm, this Heaven-Piercing Thrust could shoot out energy bolts,” Ye Mo said as he kept thrusting towards the tree in front of him.</p> <p>“This technique sure is something. Even if the Spirit Serpent’s Palm was useful, it lacked in damage. This Heaven-Piercing Thrust could be my main attacking technique from now on.”</p> <p>“You’ve mastered the basics of the Heaven-Piercing Thrust in under an hour. Impressive,” Xiao Feng said as he came down from the second floor. “Let’s see how much you’ve improved, shall we?”</p> <p>As soon as Xiao Feng finished his sentence, Ye Mo’s fingers formed into a sword and thrust towards Xiao Feng. Xiao Feng manifested his Spiritual Energy on both of his palms and smiled. Just as Ye Mo’s attack was about to reach his eyes, Xiao Feng caught it between his two fingers.</p> <p>“I’ll suppress my power to Spirit Cultivating First Realm,” Xiao Feng said as he pushed Ye Mo away.</p> <p>“First Realm, huh?” Ye Mo focused two channels of Dragon Energy to his mind’s Mortal Gate and one to his right hand’s Mortal Gate. He shifted his stance while his hand acted like a viper, striking towards Xiao Feng.</p> <p>“The Spirit Serpent’s Palm from the Ye Clan fights raw power with swift movements.” Xiao Feng identified Ye Mo’s technique with just a glance, yet he remained where he stood. Just as Ye Mo’s Spirit Serpent’s Palm was about to hit Xiao Feng, Xiao Feng disappeared from in front of him.</p> <p>Behind me! Ye Mo shouted in his mind, but Xiao Feng’s fist was already closing in on him. Ye Mo quickly bent over to evade the attack and turned, his Spirit Serpent’s Palm gliding towards Xiao Feng once again. Even though Ye Mo had a good reaction speed, his movement was still slow compared to Xiao Feng.</p> <p>Xiao Feng withdrew his fist, focused his Spiritual Energy to his leg and side-kicked Ye Mo’s waist. But it was at that moment Ye Mo’s Spirit Serpent’s Palm changed its direction. He focused two channels of the Dark Dragon Energy to his index and middle finger and shot the Heaven-Piercing Thrust towards the incoming kick.</p> <p>Boom!</p> <p>Both of them were sent back flying three steps.</p> <p>But Xiao Feng’s face was full of surprise. Even though he had suppressed his power, his battle senses were still of a Spirit Cultivating Seventh Realm. This kid’s reaction speed is way too fast!</p>",
  "Chapter 15: Flying Daggers? Don’t Even Think About It": "<p>“My speed is still too slow. If I can break through the Mortal Gates in both of my legs, I can increase my speed and fight against Spirit Cultivating First Realm martial artist without breaking a sweat.”</p> <p>Ye Mo did not bask in the fact that he had just stood his ground against Xiao Feng. Instead, he began to analyze the match he just had. Ye Mo had not reached the Spirit Cultivating Realm yet, thus he wasn’t able to utilize his energy as fast as he wanted to.</p> <p>“Not bad. Looks like your senses are quite sharp. What’s lacking is your speed, but we can’t blame you for that,” Xiao Feng said.</p> <p>“I’ll try my best to open one of the Mortal Gates in my legs before the tournament,” Ye Mo said.</p> <p>“The two on the second floor are Spirit Cultivating Second Realm martial artists. You better give it all you’ve got. M’lady has high hopes for you,” Xiao Feng said and left the Martial Pavilion.</p> <p>After practicing the Heaven-Piercing Thrust for a few more hours, Ye Mo left the Xiao’s mansion. He still had a duel with Ye Ming later that night in the bamboo forest. Even though Ye Mo knew Ye Ming must’ve prepared something, he would still go as it was about time they ended their rivalry once and for all.</p> <p>The night came and the temperature dropped. Ye Mo finished his dinner and went to the bamboo forest, not forgetting to warn Senior Fu to stay indoors that night.</p> <p>The forest was empty when Ye Mo arrived. The atmosphere was ominous, like a sleeping lion would wake up any moment and jumped its prey. Ye Mo became cautious as he knew what type of person Ye Ming was.</p> <p>“So he’s just all talk and no show?” Ye Mo said as he looked around. Suddenly, a flash came from deep inside the forest, and a flying dagger shot towards Ye Mo.</p> <p>Ye Mo was shocked by the sudden attack. He focused his sight and used his Dragon Energy to evade the attack. The dagger flew past him and struck down the bamboos behind him.</p> <p>“A Mortal Weapon!”</p> <p>The assailant did not wait for Ye Mo to recover. Ten other flying daggers formed a straight line in the air and shot towards Ye Mo.</p> <p>The dagger that was shot at Ye Mo first had red Spiritual Energy on it, appearing like a thin barrier wrapping around the dagger. The energy was not fully activated, which could only mean that it came from someone in the Spirit Cultivating Realm.</p> <p>If all 10 of the daggers were to hit Ye Mo, he’d definitely be dead. He moved two channels of the Dragon Energy to his mind’s Mortal Gate, doubling his reaction speed. Every dagger that was shooting towards Ye Mo slowed down to the point where he could easily evade them.</p> <p>But Ye Mo chose not to do so. Like a serpent, he reached out his hand and caught all of the daggers. The red energy on them began to evaporate. One of the Dragon Energy roared in his right hand and with one flick, he threw a dagger towards the direction from which it came.</p> <p>The bamboo around the spot where the dagger struck all broke down.</p> <p>“Don’t hide like a coward. Come out and face me,” Ye Mo scorned.</p> <p>“Never thought that you would be able to evade those daggers.” The voice came from the forest. Ye Ming walked out from the darkness, his arm folded in front of his chest.</p> <p>Ye Mo scanned the forest and did not spot anyone else. “So, you dare to come alone?”</p> <p>“Now that I’ve broken through my mind’s Mortal Gate, I’ve reached the Spirit Cultivating First Realm. I’m now strong enough to deal with you alone.” Ye Ming smirked and began to charge towards Ye Mo.</p> <p>Martial artists in the Spirit Cultivating Realm were able to manifest Spiritual Energy outside their body. They were also able to add elements to their Spiritual Energy through mental cultivation and increase their speed by absorbing the natural energy. A person can only be considered a martial artist once they have reached the Spirit Cultivating Realm.</p> <p>Ye Mo smiled and evoked the Spirit Serpent’s Palm to counter Ye Ming’s attack.</p> <p>“The Spirit Serpent’s Palm? Taste my Buddha’s Palm!”</p> <p>Ye Ming smirked as he saw Ye Mo using the Spirit Serpent’s Palm. He diverted his red Spiritual Energy to his right palm and pushed forward. Wind sprouted from Ye Ming’s attack and the bamboo behind Ye Mo shook drastically.</p> <p>The Buddha’s Palm was a High-grade Spiritual Level martial technique that had made the Ye Clan famous. Ye Mo had always wanted to learn that technique but never had the chance as it was only taught to direct disciples of the Ye Clan.</p> <p>“Let’s see if your Buddha’s Palm’s stronger than my Heaven-Piercing Thrust!” Ye Mo’s hand was cut by the wind blade but he withstood it. He diverted one channel of the Dragon Energy into his right hand’s Mortal Gate and thrust two fingers towards Ye Ming’s palm.</p> <p>Swish!</p> <p>Ye Mo’s fingers cut through the air. With the help of one Dragon Energy, his attack had the power of Spirit Cultivating First Realm attacks. Who would win the clash between the two High-end Spiritual Level martial techniques depended solely on who would be able to use their technique better.</p> <p>“The Buddha’s Palm!”</p> <p>“The Heaven-Piercing Thrust!”</p> <p>Bang!</p> <p>Ye Mo’s fingers collided with Ye Ming’s palm, the pressure from the clash blowing all the leaves around them away. The two were each thrown back six feet, yet an indent could clearly be seen on Ye Ming’s palm.</p> <p>Ye Mo fought the palm with his fingers. The Dragon Energy had much more power than normal Spiritual Energy. A mere Buddha’s Palm would not be enough to stand toe-to-toe to the mighty dragon. It was a beast of ancient times, one that could fight the gods themselves, the lord of all creatures.</p> <p>Ye Ming was confident that he was able to defeat Ye Mo now that he’d reach the Spirit Cultivating First Realm. He never thought that he would lose upon their first collision. Angered, he sprinted towards Ye Mo, as if his legs had merged with the wind itself.</p> <p>The Wind God’s Kick!</p> <p>Ye Mo’s vision was not able to catch up with Ye Ming’s speed. All he could see were shadows of Ye Ming’s movement.</p> <p>From the right! Ye Mo stepped back a little, but he was too late. Ye Ming has already arrived at his right side, landing countless kicks into Ye Mo.</p> <p>Ye Mo kept using his hands to shield himself.</p> <p>“Die!” Ye Ming put in extra effort in his final kick and sent Ye Mo flying. He took out another dagger in his hand. The dagger was different than the one he’d used before. A powerful Spiritual Energy vibrated throughout the whole blade.</p> <p>Swish!</p> <p>The dagger cut through the air and flew straight towards Ye Mo with extraordinary speed. With only one channel of Dragon Energy in his mind’s Mortal Gate, Ye Mo was not fast enough to react.</p> <p>The dagger went straight through Ye Mo’s chest and blood began to spew out. Yet the dagger did not stop, but instead made a weird U-turn and flew towards Ye Mo again.</p> <p>Ye Mo quickly focused the third channel of the Dragon Energy to his right hand and tried to catch the dagger.</p> <p>“You’re seeking your own death. Do you think you can catch a Magic Weapon with your bare hands?” Ye Ming smirked. Even though there was only a level difference between Mortal Weapons and Magic Weapons, the Magic Weapons allowed the user to infused their Spiritual Energy into it. Such weapon could cut through hair or slice through steels.</p> <p>Any martial artist of the Spirit Cultivating First Realm could fight toe-to-toe with a Second Realm if they were wielding a Magic Weapon.</p> <p>Ye Mo caught the dagger with his hands, but barely. Both of his Dragon Energies roared and exploded, ejecting the original Spiritual Energy that was in the blade and sent it flying towards a row of bamboo, slicing all of them in half.</p> <p>Ye Ming expression changed as he saw what was happening in front of him. How was he able to catch the dagger? Even a Spirit Cultivating Second wouldn’t dare to attempt that.</p> <p>Ye Ming noticed that the dagger was now in Ye Mo’s hands and shouted angrily, “Ye Mo! Return the dagger at once and I’ll spare your life!”</p> <p>“Don’t even think about it. You’ve made a hole in my body. What makes you think I’m giving it back?” Ye Mo smiled. Magic weapons were expensive and powerful. They could even attack someone in the dark.</p> <p>“Hand over the dagger!” A cold voice shouted from Ye Ming’s back. A guy with long hair walked out from the woods. He had facial features identical to Ye Ming and the face of a strong martial artist.</p>",
  "Chapter 16: Pill’s Markings": "<p>The person that emerged was no other than Ye Ming’s own older brother, Ye Hou. He was one of the Ye Clan’s prodigies and had reached the Spirit Cultivating Third Realm at the age of 16. He was the second strongest disciple in the Ye Clan, next to Ye Changsheng.</p> <p>“Ha! I was wondering why you would even come to face me alone! So you actually called in your older brother as well, you loser!” Ye Mo snorted.</p> <p>“I’ve heard of what Ye Ming has done to you. Why don’t you return his dagger, shake hands, and leave it as it is?” Ye Hou said with authority.</p> <p>“Who do you think you are? This Magic Weapon would have cost you more than 100 gold piece, am I right? I’m keeping it.” Ye Mo turned and ran as soon as he finished his sentence.</p> <p>Ye Hou laughed and sprinted towards Ye Mo. He was like a fierce wind, kicking all of the dust on the ground up around him.</p> <p>In truth, Ye Mo had never thought of running from the beginning. It was a feint to trick Ye Hou. He knew that Ye Hou would still kill him even if he had returned the dagger.</p> <p>If one could infuse their Spiritual Energy into the dagger, that meant that Ye Mo could also infuse it with his Dragon Energy and make it stronger. He diverted all of the two channels of Dragon Energy in his right hand into the dagger, turned, and threw the dagger towards Ye Hou. Infused with the Dark Dragon Energy, the blade turned into a Dark Dragon mid-air, piercing through the woods.</p> <p>Ye Hou had not expected Ye Mo to take such actions. He quickly stopped and evoked the Spirit Serpent’s Palm to try and catch the dagger. He used all of his Spirit Cultivating Third Realm powers and caught the dagger, but to his surprise, he could only change the trajectory of the dagger. The dagger changed its angle and shot the other direction.</p> <p>Ye Hou’s right hand was cut by the dagger as he attempted to catch it. The wound was so deep that the white bone under his flesh was visible.</p> <p>And within those few seconds, Ye Mo had already ran out of the woods.</p> <p>“Brother, are you alright?” Ye Ming rushed to his brother’s side and asked. He was shocked by the condition of Ye Hou’s right hand and shouted in disbelief, “How is this possible?!”</p> <p>“It’s as you’d said, Ye Mo’s strength has suddenly increased. Ye Qing must’ve given him some treasures before he passed,” Ye Hou guessed.</p> <p>The power in Ye Mo’s right hand’s Mortal Gate was tremendous. If he was to reach the Spirit Cultivating Realm, the outcome would be unbearable for the Ye Clan.</p> <p>Ye Ming suddenly remembered something and told his brother, “Brother, the day he killed our Spirit Cultivating First Realm servant, he’d swallowed some high-grade pill that increased his strength by many times over instantly.”</p> <p>“Don’t tell anyone about this. He must be hiding some treasure behind his back,” Ye Hou warned. “Let’s kill him when we have the chance. With that treasure, I might even have the chance to take the first spot in this year’s Limestone Champion List Tournament.” A devilish smile began to form on Ye Hou’s face as if he’d already won the tournament.</p> <p>“You’re a dead man, Ye Mo!” Ye Hou smirked.</p> <p>Ye Mo ran back to his room covered in blood. Ye Ming and his brother would not act harshly if they were in the Ye’s mansion, which made Ye Mo sigh in relief. The Dragon Energies that he’d diverted to his mind and right hand were gone, but the Rising Dragon Pillar had replenished three new channels of Dragon Energy in his Energy Center.</p> <p>“Young master! Are you alright?” Senior Fu was shocked by Ye Mo’s appearance.</p> <p>“I’m fine, just some minor scratches. I’ll be good as new after a good night’s rest,” Ye Mo explained. “Listen, I think it’s best if you avoid going out as much as possible for the next few days. Oh, and could you help me send a message to Xiao Cao? Just tell her that after I’ve reached the Spirit Cultivating First Realm. We’ll be leaving this place. This place is not safe for us anymore.”</p> <p>With his understand of Ye Ming and his older brother, Ye Mo knew they would never let this matter slide.</p> <p>Ye Mo took a few Revitalization Pills and began to meditate, focusing all of his energies in his Energy Center. His wound began to heal slowly, but a wound left by a Magic Weapon was harder to heal than those left by a Mortal Weapon.</p> <p>“Let’s try the recovery abilities of the Dragon Energy.”</p> <p>Ye Mo channeled one Dragon Energy to his wound, and with the help of the Revitalization Pills, his recovery rate doubled. He then focused the other two channels of Dragon Energy to his wound and, as expected, his recovery rate quadrupled.</p> <p>“This Dragon Energy sure is something! It’s not only stronger than your normal Spiritual Energy, but it can also increase my recovery rate!”</p> <p>With the help of the Dragon Energy, Ye Mo’s wound closed in just two hours. He was exhausted and went straight to sleep.</p> <p>Ye Mo woke up early the next day and went to the Pill Refining Chamber. He wanted to try and create some Spirit Fortifying Pills before Elder Yin came in. All of the ingredients for the pill could be found in the room, but Ye Mo was reluctant to use many of them. He’d only threw in enough ingredients to make 10 pills as he was afraid that Elder Yin might find out what he was doing.</p> <p>Ye Mo started the fire and directed one of his Dragon Energies into the cauldron.</p> <p>“Ye Mo! Prepare the ingredients. We’re going to make more pills today!” Elder Yin shouted from outside. His sudden appearance scared Ye Mo. He quickly took his right hand off the cauldron.</p> <p>What’s with him! Always appearing at the wrong time! Ye Mo cried in his mind. He was forced to stop his little experiment since Elder Yin came in early. Looks like I’ll have to buy myself a cauldron.</p> <p>Ye Mo squatted beside the cauldron, pretending to be tending the flame. “Elder Yin, I guessed you might come in early today. I’ve already prepared all the ingredients and threw them into the cauldron.”</p> <p>Elder Yin nodded in delight. “Not bad, not bad at all. You just might be worth teaching. After we’ve finished with today’s work, I’ll give you a few more pills.”</p> <p>“Thank you, Elder,” Ye Mo replied.</p> <p>Elder Yin placed both of his palms on the side of the cauldron. He began to channel his red Spiritual Energy into the cauldron, preparing to form the shape of the pills.</p> <p>The Rising Dragon Pillar automatically replenished the Dragon Energy that Ye Mo had just used. He focused one of the channels into his right hand and the other two into his mind.</p> <p>Ye Mo peeked at what was happening inside the cauldron and noticed the Dragon Energy that he was using before Elder Yin came in circling inside the cauldron. All of the ingredients melted into liquid under the intense heat coming from beneath the cauldron. With the guidance from the red Spiritual Energy, the pills began to take shape.</p> <p>“Put out the fire,” Elder Yin instructed as he withdrew his hand from the cauldron. He took a deep breath and turned to Ye Mo. “Ye Mo, why are there only ingredients enough for 10 pills inside the cauldron?”</p> <p>“Well… That’s because I was worried that you would be tired from all the work you’ve been doing,” Ye Mo said.</p> <p>“You little brat. After all these years as my assistant, is flattery all that you’d learned?” Elder Yin scolded.</p> <p>“But you’ve never taught me anything,” Ye Mo muttered.</p> <p>“You…” Elder Yin raised his hand and was about to slap Ye Mo when he realized what Ye Mo had said was true. He’d never taught Ye Mo anything before. “Fine. After the Limestone Champion List Tournament has ended, I’ll teach you how to make some pills.”</p> <p>“Thank you!” Ye Mo removed the lid from the cauldron and handed Elder the 10 Spirit Fortifying Pills that were inside it.</p> <p>Elder Yin took the pills and was stunned by what he saw.</p> <p>“Pill’s Markings!” Elder Yin exclaimed. “I’ve finally created Spirit Fortifying Pills with marking on them!”</p> <p>Pill’s Markings literally meant markings on the pill. The clearer the markings were, the higher its price was.</p> <p>Even though the Spirit Fortifying Pills were second-level training pills, every type of pills could still be divided into different quality grades. The Spirit Fortifying Pills that Elder Yin made could at most be referred to as an average grade. Only Spirit Fortifying Pills with Pill’s Markings on them could be considered pills of higher grades. Those could not only enhance a person’s training experience but also reinforce their blood flow and strengthen their Mortal Gates. Its effects were far more stronger than an average grade Spirit Fortifying Pill.</p> <p>Alchemists who could refine pills with markings on them must have extraordinary control over their Spiritual Energy. They were those who would succeed in their profession as an alchemist.</p> <p>This must be the Dragon Energy’s doing! Ye Mo thought to himself with excitement.</p>",
  "Chapter 17: The Price Should be Higher": "<p>This must be the Dragon Energy’s doing! Ye Mo smiled in his mind. The Dragon Energy had performed beyond his expectations. It’s stronger than the usual Spiritual Energy, it could heal wounds quicker, and now, it could help refine pills with Pill’s Markings on them.</p> <p>Even though the second-level Spirit Fortifying Pills with markings weren’t as strong as the third-level Spirit Establishing Pills, alchemists who could create them were more important than alchemists who could create Spirit Establishing Pills.</p> <p>Any alchemist could refine a high-level pill by understanding the procedure, but with pills with markings, it required the alchemist to have full control over their Spiritual Energy.</p> <p>Ye Mo laughed with joy in his heart while Elder Yin’s laughter echoed throughout the chamber.</p> <p>“I’d never thought that I’d be able to create pills with Pill’s Markings one day. Looks like I’m now able to show off in front of those geezers at the Alchemist Guild.” Elder Yin couldn’t hold his excitement and laughed.</p> <p>“Elder Yin, you might be old, but you still sure are vigorous. Not only can these pills speed up the training process, but they can also strengthen our body,” Ye Mo said, flattering Elder Yin again.</p> <p>“You’re damn right about the strengthening body part. I’m going to use these pills to advance myself to a Phase 3 Alchemist at the guild.”</p> <p>Elder Yin kept the pills carefully in his pockets as if they were treasures. He took out 10 normal Spirit Fortifying Pills from his other pocket and gave them to Ye Mo. “Here, take these as your reward. We’ll be skipping our afternoon schedule. I have to go to the guild right away.”</p> <p>Elder Yin stopped as he approached the door and said, “I forgive you for not bringing me the Pill Refining Powder. And since you were the one who tended the flames, I’m also overlooking the fact that you stole those Spirit Cultivating Pills from me. But only this once, you understand me?”</p> <p>“Thank you, Elder Yin! I’ll remember not to make any of those mistakes again!” Ye Mo cupped his hand and thanked Elder Yin. Looks like Elder Yin was testing him. And since he was in a good mood, he’d offered Ye Mo 10 Spirit Fortifying Pills and even forgave him for his mistakes.</p> <p>It was just as the wise once said, “You do something to make someone happy, that person will repay you with 10 times more happiness.”</p> <p>“I wonder what kind of face he will make when he realizes he won’t be able to achieve those Pill’s Markings next time…”</p> <p>Ye Mo looked at the pills in his hand, and an idea sprung to his mind. He focused all three Dragon Energies into the 10 Spirit Fortifying Pills. After a few moments, three small dark dragons hovered for a few seconds and then dug themselves into the pills.</p> <p>A dark light shone in his hand. As the light began to fade, a slight aroma began to drift out from his palm.</p> <p>“Pill’s Aroma!” Ye Mo yelled excitedly as soon as he recognized the smell.</p> <p>A wise alchemist once said that the Pill’s Markings represented the Earth while the Pill’s Aroma represented the Heaven. A pill that had both markings and an aroma could fetch a hefty price.</p> <p>“I wonder how much I could get if I sold these,” Ye Mo said.</p> <p>A Spirit Cultivating Pill costed around one silver piece while a Spirit Fortifying Pill was priced around 10 silver piece. As for a third-level Spirit Establishing Pill, the price would be too high to count.</p> <p>Ye Mo kept those Spirit Fortifying Pills and went back to his room. He sat down on his bed and wondered if he should try the effects of the Spirit Fortifying Pills with both markings and an aroma.</p> <p>Ye Mo took one of them, and a faint aroma began to fill his mouth. He could feel the strong and pure energy flow through his throat and into his Energy Center.</p> <p>Ye Mo started to cultivate his Energy Center, absorbing the Spiritual Energies and combining them with the power of the pill. His Spiritual Energy’s concentration and absorption level increased by a few dozen folds while the pill’s power flowed throughout his body and into his Mortal Gates, strengthening his body.</p> <p>“Let’s see if I can awaken the fourth channel of Dragon Energy before the pill’s effects disappear.”</p> <p>Ye Mo kept diverting his own Spiritual Energy to the Rising Dragon Pillar. With the help of the Spirit Fortifying Pill, his Spiritual Energy surged towards the Dragon Pillar like a tsunami as if the energy was trying to drown the pillar.</p> <p>And the Rising Dragon Pillar was like a black hole, taking in every last inch of the incoming energies. The fourth Dragon that was lying dormant on the pillar began to glow with dark light as if it was trying to break free from the pillar’s captivity.</p> <p>Ye Mo quickly swallowed four more Spirit Fortifying Pills. The fourth dragon roared. He had finally awakened his fourth Dragon Energy. All four channels of Dragon Energy were circling his Energy Center. Below them laid Ye Mo’s own colorless Spiritual Energy. It was as if four dragons were soaring in the sky.</p> <p>Ye Mo felt like his body was filled with infinite power. The Dragon Energies could shake not only the Earth but also the Heavens.</p> <p>Ye Mo manipulated all four channels of Dragon Energy into his right arm and punched the air. The air where the punch had landed exploded. But suddenly, Ye Mo’s legs burned with pain, and he quickly withdrew his arm.</p> <p>“Even though the four Dragon Energies have the power of Spirit Cultivating Fourth Realm, the power of eight stones, my body wasn’t strong enough to host this power.” Ye Mo instantly understood where the pain came from. The Dragon’s powers were too much for his body to handle. Only once Ye Mo has reached the Spirit Cultivating Realm would his body have the ability to host its full power.</p> <p>But Ye Mo was still glad that he was able to awaken the fourth Dragon Energy with the help of the Spirit Fortifying Pill. He could now divert two Dragon Energies into both his mind and right hand, which would boost his reaction speed and attacks to the same level as a Spirit Fortifying Second Realm martial artist.</p> <p>If Ye Mo could break through the Mortal Gates in both of his legs and awaken another two Dragon energies, he would have the chance to win against a Spirit Fortifying Second Realm martial artist.</p> <p>“Now that I fully understand the effects of these pills, I can create as many as I want.”</p> <p>Ye Mo took the remaining five pills and left Ye’s mansion. Spirit Fortifying Pills with both markings and an aroma were two times stronger than the average Spirit Fortifying Pills. The price on those pills was very high. He could sell the pills in his hand and use the money he gained to buy more average Spirit Fortifying Pills. The cycle would never end as long as he could make more pills of this caliber.</p> <p>He was already uninterested in refining more pills.</p> <p>Ye Mo went to the Hundred Treasure Pavilion. One of the staff saw Ye Mo coming in and was stunned for a while before saying, “Aren’t you the assistant that crushed Mo Feng’s arm last time?”</p> <p>“That’s me. What? You aren’t telling me that you won’t be doing business with me after what I did, are you?” Ye Mo asked.</p> <p>“Of course not! Manager Qi has already ordered us to give you some Pill Refining Powder as a gift when you come in,” the staff said.</p> <p>Ye Mo wasn’t surprised to hear that. Qi Yin was a businesswoman. It was clear as day that she would want to get on the good side of an assistant who hasn’t reached the Spirit Fortifying Realm but has the power to hurt Mo Feng.</p> <p>“I don’t need those powders anymore.”</p> <p>“Little brother, are you angry at me?” Qi Yin said as she walked towards Ye Mo with an innocent face. “You should know that a weak little girl like me wouldn’t dare to offend anyone in this city.”</p> <p>“So you aren’t afraid of the Mo Clan now?” Ye Mo smiled coldly. It wasn’t that Ye Mo had no interest in pretty girls, but Qi Yin was a coquettish woman that he shouldn’t get close to.</p> <p>“You must come from some huge background, or else you wouldn’t have the power to defeat someone like Mo Feng. You’re just not a simple helper, am I right?” Qi Yin smiled.</p> <p>“Let’s get back to the main topic, shall we? I have five Spirit Fortifying Pills with me. Do you want to buy them?” Ye Mo said. In truth, it was Xiao Yue who took care of the matter between him and Mo Feng.</p> <p>“Of course we’re buying them. Xiao Wu, get a piece of gold for this little brother,” Qi Yin ordered the staff. The staff took out a piece of gold from his pocket and gave it to Ye Mo.</p> <p>The market price for the Spirit Fortifying Pill was 10 silver pieces for one pill. Five pills would normally only fetch Ye Mo 50 silver pieces at most. Qi Yin was obviously trying to get on Ye Mo’s good side.</p> <p>“You’re giving me 20 silver pieces for a pill before even taking a look at them. Are you even taking this seriously?”</p> <p>“Little brother, the market price for the Spirit Fortifying Pill is 10 silver pieces for one pill. The other 50 silver pieces are for what happened the other day,” Qi Yin explained while she pulled up her dress a little bit and flaunted one of her attractive, pale white legs.</p> <p>Ye Mo glanced at her leg, which would make any man drool, and said, “I’m not saying that the price was too high, I’m saying that you might be paying too little.”</p> <p>Ye Mo took out the five Spirit Fortifying Pills from his pockets. There were clear Pill’s Markings on them, and the room soon began to fill with the Pill’s Aroma.</p> <p>The pills in Ye Mo’s hand quickly caught Qi Yin’s attention. Her beautiful face was filled with disbelief.</p>",
  "Chapter 18: High-grade Magic Weapon": "<p>Qi Yin had seen many treasures before in her career as the manager of the Hundred Treasure Pavilion. She understood the quality of the Fortifying Pills in Ye Mo’s hand. They have markings on them while aromas seeped out from them. Only a high phase alchemist or someone with extraordinary talents could create pills of such caliber.</p> <p>Even though the Stabilizing Pills could produce much stronger effects than the pills Ye Mo was holding, Fortifying Pills with Pill’s Markings had the ability to strengthen the user’s body.</p> <p>Qi Yin quickly recovered from her shock and said, “Little brother, looks like you have a very talented alchemist backing you up. The Fortifying Pills that you are holding have both markings and aroma. Extraordinary. But I still have to give them to our appraiser to check their qualities. How about we discuss the price after that?”</p> <p>“No problem!” Ye Mo handed over the pills to Qi Yin. She unconsciously (or consciously) touched his hand when she took the pills and left.</p> <p>Ye Mo’s heart fluttered when touched by her cold hand and scolded himself in his mind. After that, he went over to the weapon’s shop. Ye Mo finally understood the importance of weapons after his battle with Ye Ming, especially weapons which the users could infuse with their Spirit Energy.</p> <p>The shopkeeper saw Ye Mo coming in and smiled. “Good morning. What do you need? We sell all sorts of daggers, swords, spears, halberds, canes, maces, and forks.”</p> <p>“Are there any Magic Weapons?” Ye Mo asked as he was not interested in Mortal Weapons. If he could infuse all three Dragon Energies into a Magic Weapon, he could unleash attacks that have the forces of a Spirit Cultivating Fourth Realm.</p> <p>“Magic Weapons? Those are quite rare. I don’t have them. You might want to try your luck at the auction house,” the shopkeeper replied.</p> <p>“Little brother, if you’re looking for Magic Weapons, I might be able to help you,” Qi Yin said as she walked towards them.</p> <p>“So, you do have Magic Weapons here?” Ye Mo asked, surprised.</p> <p>Qi Yin shook her head and said, “No, we don’t. You can only get Magic Weapons from the Muyang Auction house. According to my sources, they are going to sell a High-grade Magic Weapon in three days.”</p> <p>“A High-grade Magic Weapon?” Ye Mo exclaimed.</p> <p>“The news has been spreading like wildfire.” Qi Yin smiled. “Quite a few young masters have their eyes locked on that particular weapon.”</p> <p>“Then that’s a pity,” Ye Mo said, shaking his head. The price of the Magic Weapon would sky-rocket. The money he had on him wouldn’t even be enough to buy the hilt of the weapon.</p> <p>“I think you might be able to fight on even grounds with them though. A High-end Magic Weapon is even a rare sight in the whole Tianwu Kingdom.”</p> <p>The appraisal results of the pills were more than what Qi Yin expected. The pills have already reached the highest quality. The one who created those pills, Ye Mo’s master, must be some genius.</p> <p>“What do you mean by that?” Ye Mo wanted the Magic Weapon badly, but before that he needed money and power. Even if he had the money, people would still attempt to steal it away from him before he could even leave the auction house.</p> <p>“I’ve already appraised the five Fortifying Pills you handed me,” Qi Yin explained. “They are the highest-quality pills, which means that you must have quite the master backing you up. If you could ask your master for help, winning the auction wouldn’t be much of a problem.”</p> <p>But there was always a hidden rule at the auction house for bidding on items that everyone wanted. Money was not the only thing a person needed. They would also need to have the power and ability to get it out of the auction house.</p> <p>“My master is very odd. He doesn’t like to get out much,” Ye Mo said.</p> <p>“Let me warn you first, little brother. If you want to enter the Muyang Auction House, you’ll need to prepare at least one Purple Gold,” Qi Yin warned. “Oh, and we’re still unable to put a price on the pills you gave me. Why don’t I put it up at the auction in three days? We’ll only charge you a 20% handling fee.”</p> <p>Ye Mo nodded. “Fine with me.”</p> <p>“Here, take these two gold pieces as a deposit. I’ll give you the rest of the money once the auction has ended,” Qi Yin said as she handed Ye Mo two pieces of gold.</p> <p>Ye Mo took the gold pieces and left the Hundred Treasure Pavilion.</p> <p>“Miss, do you want to send someone to check on his background?” An uncanny old man in his 60s came out from the back and asked.</p> <p>“That won’t be necessary. This young man and his master are not from around here,” Qi Yin said. “Limestone City doesn’t have any alchemists with the potential to reach such levels. And the better the alchemist, the weirder he is. If they were to notice that we are poking around behind their backs, they might send us trouble. Next time, try and get on the young man’s good side as much as possible. He’s going to bring us, the Qi Clan, many benefits.”</p> <p>The enchanting smile on Qi Yin’s face began to fade and her expressions became more serious.</p> <p>“Understood.” The old man also knew that an alchemist with such talent could be a terror. It would be best if he were on their side.</p> <p>After Ye Mo had left the Hundred Treasure Pavilion, he put on his tiger mask and went straight to the Xiao’s mansion. Xiao Feng and Xiao Yue were nowhere to be found in the Martial Pavilion at the Xiao’s mansion. One of the disciples handed Ye Mo five Fortifying Pills and told him to train.</p> <p>Ye Mo took the pills but did not use them. If he could refine the pills even further with his Dragon Energies, the best course of action would be taking them after doing so.</p> <p>But since Ye Mo was still in Xiao’s mansion, he did not want anyone to see what he was capable of, so he put away the Fortifying Pills and went to the second floor, curious of what he would find there.</p> <p>Xiao Feng had told him there were two Spirit Cultivating Second Realm foreign aids on the second floor, and that both of them were prodigies too. Now that Ye Mo had awakened four channels of Dragon Energy, he wanted to test the strength of those two foreign aids.</p> <p>Ye Mo strolled towards the second floor and saw a guy and a girl sparring. Both of them were around Ye Mo’s age, yet they had already reached the Spirit Cultivating Second Realm. Spirit Energies burst from their every clash and shook the air around them, slightly shaking the whole Martial Pavilion.</p> <p>“The Spirit Cultivating Second Realm sure is something!” Ye Mo sighed. Even though he could produce forces equal to a Spirit Cultivating Second Realm, he had still yet to reach the Spirit Cultivating Realm. A fight between two martial artists does not only focus on their strength but also their overall performance.</p> <p>The palms of the two martial artists slammed together, and both of them took a few steps back from the reacting force. Suddenly, the girl in black robes noticed there was another person in the same room.</p> <p>“Who’s there?!” The girl shouted and started to sprint towards Ye Mo. Ice blue Spiritual Energy covered her right hand as she shot it towards him.</p> <p>What a vicious girl! She did not even give me the chance to reply and straight on attacks me! Ye Mo quickly focused three channels of Dragon Energy into his right hand’s Mortal Gate as it mimicked a Spirit Serpent and swirled around the girl’s hand, ignoring the incoming attack.</p> <p>“Ahhh!” The girl shrieked before she could even react.</p>",
  "Chapter 19: The Leng Siblings": "<p>The girl in the black robe was short and petite. Ye Mo’s Spirit Serpents Palm quickly coiled around her thin arm and grabbed it.</p> <p>When the girl shrieked, Ye Mo blushed and quickly let go of her arm.</p> <p>The girl sat on the ground and cried. After a few seconds, the girl stood up, her pretty face full of murder as she punched towards Ye Mo. Ye Mo was not about to be punched by some girl, so he quickly evaded the attack.</p> <p>The girl was both angry and anxious about not being able to hit Ye Mo. She turned towards the boy behind her and said, “Brother! Help me kill this pervert!”</p> <p>“Miss, aren’t you misunderstanding something?” Ye Mo asked with an innocent face. Why did the girl want to kill him suddenly?</p> <p>“Misunderstanding?! You grabbed my arm with that filthy hand of yours!” The girl was a neat freak. The only man who’d touched her before this was her father. Now she was angered because she was touched by a pervert.</p> <p>“You started to attack me before asking who I was. I would be dead if I were a normal person,” Ye Mo argued. What a troublesome girl! How did she even advance to the Spirit Cultivating Second Realm with that temper?</p> <p>“You!” The girl stared at Ye Mo like her eyes were on fire and would explode any moment. “Brother! Punish him!”</p> <p>“Stop it, Leng Leng,” the guy said and shook his head.</p> <p>Leng Leng understood that Ye Mo was stronger than her and just stared at Ye Mo viciously.</p> <p>“You must be the third foreign aid for the Xiao Clan. My name is Leng Feng, and this is my sister, Leng Leng. We’re both from the Leng clan of Limestone City,” the guy said and cupped his hand.</p> <p>“You guys are from the Leng Clan? Why are you helping the Xiao Clan?” Ye Mo asked curiously. Even though the Leng Clan was not one of the four biggest clans, they still had respectable strength.</p> <p>“Brother, look, he’s wearing a tiger mask. He must be some thief or pervert. Let’s take him down and send him to the guards. Maybe we could even get rewarded by the city lord.” Leng Leng was still furious at Ye Mo. She was going to take every chance she had to make his life miserable.</p> <p>Leng Feng could not help but shake his head and smile. “Please forgive my sister’s behavior. She was spoiled from the moment she was born. Even though the Leng Clan has power, with our strength, it’s hard for us to get into the top five of the Limestone Champion List. Only with the help from Xiao Clan’s resources do we have the chance to get into the top five. Plus, I’m kind of into Miss Xiao Yue, so of course we’ll be helping her.”</p> <p>Even though there were 10 spots in the Limestone Champion List, the Three Major Alliances would only scout the top five martial artists. Two for the Qingyun Alliance, two for the Tiandi Alliance and one for the Wushuang Alliance. The only way to get into these alliances was to get into the top five rankings.</p> <p>“Nice to meet you, brother Leng Feng. My name is Ye Mo. I’m also one of the foreign aids. But I’ll say this first, the foreign aid spot will be mine to take,” Ye Mo said as he took off his tiger mask and showed his handsome face. His face was bright with friendly smile. Leng Feng seemed like a good guy to him, someone who was worthy of being called a friend.</p> <p>“As long as you can win against me before the tournament, then I’m willing to give you the spot. But let me warn you, I’m not that weak myself,” Leng Feng said and laughed, not showing any hostility.</p> <p>“You pervert, don’t even think you can defeat my brother!” Leng Leng smirked. “Even though he’s only in the Spirit Cultivating Second Realm, he will reach the Third Realm in one month. What’s more, he has a Low-grade Magic Weapon. He could easily wipe out martial artists who were on his level.”</p> <p>A Spirit Cultivating Third Realm martial artist with a Low-grade Magic Weapon definitely could wipe out any martial artist of the same realm.</p> <p>“We won’t know for know!” Ye Mo shrugged. He would rather prove himself through his strength rather than wasting time with her.</p> <p>Leng Leng got angrier from Ye Mo’s expression. This guy! Wait… Did he say his name is Ye Mo? She suddenly remembered something and mumbled, “You’re Ye Mo? Ye Qing’s son? The trash that didn’t even break through a single Mortal Gate after five years of training?”</p> <p>Not everyone in the Limestone City knew who Ye Mo was, but that didn’t mean he wasn’t famous. Ye Mo was born with expectations to be someone powerful like his father. The news of him not being able to break through a single Mortal Gate after five years of training had spread throughout the whole city.</p> <p>Leng Feng remembered who Ye Mo was after Leng Leng has called out who Ye Mo was. Rumors had it that Ye Mo was trash, yet he was able to break Leng Leng’s attack with ease.</p> <p>“Looks like I’m known throughout the city as trash, huh? But mark my word, in two months, I’m going to be known as a genius who has surpassed Ye Qing!” Ye Mo said with confidence.</p> <p>Leng Leng stared at Ye Mo’s confidence and became slightly gentler towards him.</p> <p>“You’re just a pervert who would submit to only parlor tricks. You’ll have to defeat my brother first before you get to make that statement.” Leng Leng shook her head and thought, That’s right. He’s just a pervert controlled by his lust.</p> <p>“We’ve finished our training, so we’ll be taking our leave,” Leng Feng said as he headed towards the stairs. Leng Leng smiled and followed her brother, leaving Ye Mo behind.</p> <p>“Brother, if we could win the bid on the High-grade Magic Weapon at the auction, our chances of getting into the top five will be even higher,” Leng Leng whispered as she followed behind Leng Feng. Yet Ye Mo was still able to hear what she was saying.</p> <p>“How could we win the bid when the four biggest clans are going to bid for it too? Our father has ordered us not to participate in the auction,” Leng Feng said as they walked towards the first floor.</p> <p>“Come on, the auction will be crowded with all different kinds of stuff. I want to go!”</p> <p>Even the Leng Clan wouldn’t dare to place their bid on the Magic Weapon. Looks like it won’t be easy for me to get the weapon… Ye Mo thought. If he were able to get his hands on the High-grade Magic Weapon, it would make him stronger.</p> <p>Ye Mo trained his martial technique in the Martial Pavilion for some time and left. He kept the tiger mask in his pocket and walked towards Ye’s Mansion. He met Elder Yin on his way back. Elder Yin hung his head low and was letting out sigh after sigh.</p> <p>“Elder Yin!” Ye Mo shouted and ran towards him.</p> <p>“Oh, Ye Mo. Looks like it was only pure luck, me creating those Fortifying Pills with Pill’s Markings,” Elder Yin said with another sigh.</p> <p>It was natural that Elder Yi was not able to create more pills of that level since they were created with Ye Mo’s Dragon Energies.</p> <p>“Don’t give up just yet, Elder Yin. I believe you’ll be able to create Fortifying Pills with markings again!” Ye Mo smiled as he consoled Elder Yin and clapped a hand upon Elder Yin’s shoulder.</p> <p>“Of course, a mere helper like you wouldn’t understand how hard is it to create those pills,” someone scorned. It came from an old man wearing a grey robe. He wore a pin in front of his chest like Elder Yin. The only difference was that it was a pin for a Phase 3 Alchemist.</p> <p>There were only two Phase 3 Alchemist in all of Limestone City. One of them was Qin Mo, the guild master of the Alchemist Guild and the lord of Limestone City.</p> <p>“Old man Yin, don’t come and show your face at the guild if you don’t have the skills. What’s more, you’re bringing a helper that doesn’t have a basic understanding of pill refining. If I were you, I would have just found another helper.”</p>",
  "Chapter 20: True Energy Pill": "<p>“Let’s go, Ye Mo.” Elder Yin did not retort to the old man’s taunt but instead urged Ye Mo to leave. But Ye Mo felt guilty as he was responsible for Elder Yin’s humiliation at the Alchemist Guild.</p> <p>Ye Mo thought of all the time he had spent with Elder Yin. Other than Elder Yin’s temper, he’d actually been treating Ye Mo well. Now that Elder Yin was humiliated by others, how could Ye Mo not get angry?</p> <p>“Master, is it possible that you were low on energy when you were taking the guild’s test? It’s possible since you just created a whole cauldron of Fortifying Pills with Pill’s Markings on them,” Ye Mo suggested.</p> <p>“Master?” Ye Mo asked again as Elder Yin did not respond. Elder Yin was stunned by what Ye Mo had said and didn’t know how to respond. His old face was full of shock.</p> <p>“A whole cauldron of Fortifying Pills with Pill’s Markings? Do you think it’s that easy?” The old man in grey robe questioned his assistant, who was spouting a bunch of nonsense in front of him. “There are a total of 10 alchemists in the Alchemist Guild, but only the guild master was only able to create them. Even he cannot achieve a 100% success rate. Are you telling me that this old man is better than the guild master?”</p> <p>“Ye Mo, stop spouting nonsense. Let’s go.” Elder Yin pulled Ye Mo away. He understood how proficient he was in pill refining. He’d only just learned how to create Fortifying Pills. It was impossible for him to create Fortifying Pills with Pill’s Markings in such a short time. Ye Mo was only trying to pressure Elder Huo, but Elder Huo was still a Phase 3 Alchemist who could create Rank Three pills.</p> <p>“Master, if he’s criticizing your skills, that means he’s also criticizing my skills. If you don’t want to punish him for that, then let me help you out. I’ll show him what a Fortifying Pill with Pill’s Markings looks like,” Ye Mo said.</p> <p>“Stop it, Ye Mo. I haven’t even taught you any pill refining technique. It’s impossible for you to create pills yet,” Elder Yin said.</p> <p>Elder Huo heard what Ye Mo had said and smiled coldly. “What a brat! Even my apprentice Mo Feng wouldn’t dare say he has the skills to create Fortifying Pills, and here you are saying you could create them with Pill’s Markings? Looks like you’re no different from your master, always boasting!” Elder Huo said.</p> <p>“Mo Feng? Is he any good? Why haven’t I heard of him yet? He’s at most a trust in front of me,” Ye Mo said coldly.</p> <p>“Elder Yin! Only if your apprentice’s refining skill was as good as his mouth, then he might be worth teaching!” Elder Huo said as he turned to leave. A Phase 3 Alchemist arguing with a 15 year old boy was unprofessional.</p> <p>“Master, these five pills are the Fortifying Pills that you had created last night. There are Pill’s Markings on all of them,” Ye Mo said as he took out five Fortifying Pills that he had further refined using the Dragon Energies. All of them had clear markings on them.</p> <p>Elder Yin looked at the pills in Ye Mo’s hand. He was surprised by what he was seeing. How did this kid that has only been tending flames all this time create pills of this caliber? Does he have the talent to create such pills?</p> <p>That was not possible. Mo Feng had already been acknowledged as a genius for being able to create Rank Two Fortifying Pills at his age. It wasn’t possible for Ye Mo to achieve something greater than that.</p> <p>“Did you think that would scare me?” Elder Huo naturally doesn’t believe what Ye Mo had said.</p> <p>“Then let’s go to the guild again. My master will recreate these pills in front of you and the guild master,” Ye Mo said with confidence.</p> <p>“Fine! Do you think I’m intimidated by you?” Elder Huo swung his sleeves and headed straight towards the Alchemist Guild first.</p> <p>“What are you doing, Ye Mo? I tried it just now. It’s impossible for me to create pills of this level,” Elder Yin whispered, afraid that Elder Huo would hear what he was saying. Elder Yin was already at an age where his dignity mattered the most.</p> <p>“Elder Yin, you’ll just have to focus on refining the pills later. I’ll take care of the rest for you. Be ready for a huge surprise!” Ye Mo smiled.</p> <p>“… Fine. I’ve already embarrassed myself once. Why not let you try?” Elder Yin sighed.</p> <p>The three of them walked towards the Alchemist Guild. The Alchemist Guild in Limestone City had only 10 members. It was created by the best alchemist in Limestone City, Qin Mo. Qin Mo was a member of the Qin Clan and was a Phase 3 Alchemist. Even though Qin Mo had the same rank as Elder Huo, their skills were miles apart.</p> <p>The three arrived at an unsophisticated pavilion. Ye Mo raised his head and noticed the word “Pill” written on the signboard.</p> <p>“Here we are at the Pill Pavilion. Let’s see how you created those pills, shall we?” Elder Huo said and went inside. Elder Yin led Ye Mo into the building with a worried face.</p> <p>The three of them arrived in a room filled with aromas from the herbs. A huge cauldron was placed in the center of the room. The cauldron was so huge that it required four people to fully hug it, and it was over six feet tall. An old man with white hair and a long beard stood at one, focused on a book in his hand.</p> <p>“Elder Huo, Elder Yin, why are you two here?” The old man asked. He had heard people walking by.</p> <p>“Guild master, Elder Yin’s still insisting that he’s able to create Fortifying Pills with Pill’s Markings. I want to see how he does it and learn something from him,” Elder Huo said in a respectful tone.</p> <p>Elder Yin was flustered by what Elder Huo had said. He’d embarrassed himself in front of a few alchemists not long ago. Now that he was in front of the guild master, he had nowhere to hide.</p> <p>“Elder Yin, didn’t you take the test not long ago? Your control over the Spiritual Energy is far from creating such pills. If that’s it, then leave. I’m trying to study the method to create a Rank Three True Energy Pill,” Qin Mo said.</p> <p>“Guild master, are you seriously trying to create the True Energy Pill?” Elder Huo and Elder Yin were both surprised by what Qin Mo had said. Pills could be separated into three different categories, healing pills, training pills, and limit-breaking pills. The True Energy Pill had the power to help martial artists break into the True Energy Realm.</p> <p>Martial artists such as the city lord Qin Hao, Ye Clan’s Ye Kuang, and Mo Clan’s Mo Rulong were all stuck in the Energy Shaping Ninth Realm in Limestone City with no method to advance into the True Energy Realm.</p> <p>Even though it was only one step away from the True Spirit Realm, these Energy Shaping Ninth Realm martial artists had been looking for ways to break through their limits for a long time.</p> <p>Each of the aforementioned martial artists wanted to break into the True Energy Realm and then into the Unified Energy Realm. Because only then could they be the strongest clan in all of Limestone City.</p> <p>Everybody below the True Energy Realm were mere peasants to them. The True Energy Pill was the best pill to help any Energy Shaping Ninth Realm martial artist achieve what they’d longed for.</p>",
  "Chapter 21: Phase 3 Alchemist": "<p>“Master, what is this True Energy Pill for?” Ye Mo asked in a low voice.</p> <p>“This pill is for breaking through your limits. It can help martial artists that are stuck in the Energy Shaping Ninth Realm to reach the True Energy Realm,” replied Elder Yin.</p> <p>A strong warrior in the True Energy Realm must have mastered the spiritual energy before starting to turn those forces into true energy.</p> <p>These warriors had full control over their own strength. For example, the warriors in the Energy Shaping Realm gathered spiritual energy in their palms to strike their enemies while warriors of the True Energy Realm gathered the power of the true energy to not only send enemies flying but also feel the attack patterns of the enemy.</p> <p>Martial artists of the True Energy Realm could control anything. The true energy that emitted from their body helped them to master everything around them.</p> <p>“This kind of pill exists? Doesn’t this mean that everyone will be able to step into the True Energy Realm?” Ye Mo exclaimed in surprise. Every realm had its own nine layers that acted as barriers. If this pill had the ability to help people to break through these barriers with ease, then the pill was too overpowered.</p> <p>“Calm down, young one. This Nine Layer Pill and True Energy Pill are more like accessories to help people break through their limits,” said Qin Mo as he ignored the other three in the room and started to read again. “It still requires the realization of the martial artist himself. If there’s nothing else you would like to know, then scram.”</p> <p>“Let’s go back to Ye Clan for now, Ye Mo. It seems that President Qin is quite busy at the moment,” said Elder Yin apologetically.</p> <p>Don’t even think of leaving. I’m going to embarrass you to death today! Elder Huo thought to himself. He smirked as he turned around to face Qin Mo and crossed his arms. “Mr. President, Elder Yin has mentioned that he was unable to create the Spirit Fortifying Pill with markings due to his injuries. Now that he has recovered, he should easily be able to create a Spirit Fortifying Pill with markings.”</p> <p>“Oh, is that so?” Qin Mo exclaimed with slight surprise. He turned and looked at Elder Yin.</p> <p>As Ye Mo noticed that Elder Yin was not going to take any action, he decided to take out the Spirit Fortifying Pills with markings on them and said, “President Qin, please have a look. These Spirit Fortifying Pills were created by my master. If you don’t believe us, then we can show you how my master makes them right here, right now.”</p> <p>Only a glance at the Spirit Fortifying Pill in Ye Mo’s hand made Qin Mo stand up and run towards Ye Mo. His face was filled with surprise. The Spirit Fortifying Pills that Ye Mo was holding were of high quality. Even Qin Mo himself was not able to produce pills of such quality. Could it be that these pills were really created by Elder Yin? But with the skills that Elder Yin had shown a while ago, he should not have been at this level yet.</p> <p>“Master.” Ye Mo glanced at his master, sending him a signal. Elder Yin had no choice but to act strong and walk towards the cauldron. If he was going to act, then he should act like a master alchemist.</p> <p>“He’s right, president. These pills were all made by me,” said Elder Yin with dignity.</p> <p>Ye Mo was dying inside as he saw Elder Yin lying like it was nothing. Man, Elder Yin sure knows how to lie better than me.</p> <p>“Pills of this caliber are rare. Please, use this cauldron here. I want to see how you made them,” said Qin Mo. Of course, he was half suspicious of Elder Yin’s skill. The only way for him to confirm it was to see it with his own eyes.</p> <p>Hmph! Time for you to embarrass yourself! Elder Huo grinned and stood aside to wait for the outcome.</p> <p>“Master, let me pick the herbs,” offered Ye Mo. He found all the herbs needed for the pill, threw them into the cauldron, and put the lid on. Then, he began to prepare the fire for the pill refinement. Qin Mo nodded his head as he noticed the boy’s movements were that of a skilled alchemist.</p> <p>This kid is too skilled to be an assistant!</p> <p>“Master, I’m going to start the fire.”</p> <p>As soon as Ye Mo finished his sentence, the fire began to blaze. He secretly infused three channels of the Dark Dragon Energy into the cauldron and another into his right hand. As all four powers exploded, the flame beneath the cauldron shot up like dancing flames and the temperature in the cauldron began to rise.</p> <p>Elder Yin quickly placed both of his palms on the cauldron, infusing it with fire red Spiritual Energy.</p> <p>Elder Huo began to worry that Elder Yin might have had the skills to produce a Spirit Fortifying Pill with markings on it.</p> <p>“Refining a pill requires the alchemist to focus both his mind and spirit. Even though the technique is important, the power of the alchemist’s spirit must not be ignored too. Yet Elder Yin has not improved since the last time I saw his skill,” Qin Mo murmured. Qin Mo was both an alchemist and an Energy Shaping Realm martial artist. He was able to identify Elder Yin’s control over his spiritual energy.</p> <p>“Wait, something’s not right. What are those three channels of Dark Energy that look like dragons?”</p> <p>Qin Mo was shocked by the three Dark Dragon Energies that were circling the cauldron and dancing in the flame. When the process was almost complete, the energies infused themselves into the pills. With that, a total of 10 pills were completed under the red spiritual energy, and on them were clear markings.</p> <p>Only Qin Mo and Ye Mo knew what was happening under the lid.</p> <p>Boom! A loud explosion came from within the cauldron and pulled Qin Mo back to reality. Elder Yin had withdrawn his hands from the cauldron and was staring at them anxiously.</p> <p>“So it’s done. Let me check if there are markings on the pills or not,” said Elder Huo. He smiled while he rubbed his hands together.</p> <p>Elder Yin clearly heard the insult in Elder Huo’s voice. Yet there was nothing he could do except wish for a miracle to happen.</p> <p>Just as Elder Huo was about to open the lid, the quiet Qin Mo began to speak, “There’s no need to confirm it. Elder Yin has successfully created pills with markings on them.” He said this as if Elder Yin had succeeded without any doubts.</p> <p>“That’s not possible, I don’t believe it!” Elder Huo questioned.</p> <p>Even Elder Yin was surprised by Qin Mo’s comment. Did I really succeed in creating pills with markings on them? But President Qin’s spiritual energy is stronger than any of us. He could have seen what was happening in the cauldron when I was making the pills. If President Qin believes that there are marked pills inside, then it must be true!</p> <p>Elder Yin thought of the possibilities and turned to smile at Ye Mo in secret. Is this the kid’s doing? But where did he learn to create pills with markings on them?</p> <p>“Hey, if you don’t believe us, why don’t you open the lid and check them yourself?” Ye Mo challenged as he folded his arms in front of his chest.</p> <p>“Fine! Then I’ll open it!” Elder Huo pushed open the cauldron and retrieved some of the Spirit Fortifying Pills. There were clear markings on the pills. To any alchemist, these markings were very appealing. They reflected the skills of the alchemist who created them.</p> <p>“There are markings! Ha! You old fool! Now do you understand?! I’m able to create pills with markings on them!” Elder Yin laughed like he had lost his mind. Maybe he was trying to let out all the pent up anger from being embarrassed by Elder Huo.</p> <p>Elder Huo stood beside the cauldron, shocked. He turned and accused Elder Yin of cheating. “Impossible! Impossible! You just became a Phase 2 Alchemist not long ago. It’s impossible for you to make pills with markings in such a short time! You must’ve cheated!”</p> <p>“Elder Huo, my master refined the pills right in front of you and President Qin. Even if you were unable to notice my master cheating, I’m sure President Qin would’ve noticed it. Are you saying that you doubt President Qin’s skills?” Ye Mo replied coldly.</p> <p>“You smart little brat! Fine! I admit I’ve lost this time!” Elder Huo threw up his hands and left, his face filled with anger.</p> <p>“Elder Yin, quite the helper you have there.”</p> <p>After analyzing the situation for some time, Qin Mo believed that these high-quality pills were created with the dragon-shaped energy that he had just seen. That energy definitely didn’t belong to Elder Yin. The only explanation was that they belonged to Ye Mo.</p> <p>Yet Qin Mo did not expose the truth. He had no reason to. The dragon energies were beyond his understanding. All he could have done was to go and consult the castellan.</p> <p>“Right?” Elder Yin hugged his assistant. “I’ve taught him quite a lot, and he was always eager to learn new stuff.”</p> <p>“Since you were able to create Spirit Fortifying Pills with markings on them, I now promote you to a Phase 3 Alchemist. Congratulations on becoming the third Phase 3 Alchemist in Limestone City.”</p>",
  "Chapter 22: Ye Chansheng": "<p>There were only a total of three Phase 3 Alchemists in Limestone City, namely Elder Huo from the Mo Clan, Qin Mo from the Qin Clan, and the most recent addition, Elder Yin. The other seven alchemists were either Phase 1 or Phase 2 Alchemists. With his promotion to Phase 3, Elder Yin’s status in the city also rose drastically.</p> <p>“Thank you, President Qin!” Elder Yin cupped his hands and bowed.</p> <p>Qin Mo handed Elder Yin a pin that designated a Phase 3 Alchemist and said, “You better treat your assistant right, he might rise above you one day.”</p> <p>“He’s smarter than your average kid. He could very well be the reincarnation of the Great Alchemist himself,” said Elder Yin with a laugh as he rubbed Ye Mo’s head.</p> <p>Not a peep came from Ye Mo, but from President Qin’s words, he vaguely felt that President Qin had begun to suspect something.</p> <p>“Now that everything is settled, both of you may see yourself out. I still have to go back to my study on the True Energy Pill,” said Qin Mo as he returned to his book.</p> <p>Elder Yin left the Alchemist Pavilion with a huge smile on his old face. “Ye Mo, what was that just now?”</p> <p>“Why Elder Yin, you had just created pills with markings by yourself!” Ye Mo said with a smile.</p> <p>“Don’t joke with me. I’m fully aware of my alchemy skills. The pills must be your doing,” said Elder Yin. His voice was not as proud as it had been in the Alchemy Pavilion, but he spoke to Ye Mo like he was his old friend. Elder Yin fully understood that Ye Mo had the ability to enhance the quality of Spirit Fortifying Pills.</p> <p>“Fine, let me tell you the truth, Elder Yin. It was really me who helped you create the pill just now. But please don’t ask me how I did it,” replied Ye Mo.</p> <p>“But what if I want to refine more pills in the future?” Elder asked, smiling like a kid.</p> <p>“If you follow my instructions in the future, you should be able to keep the Phase 3 title. You of all people should know how noble it is to become a Phase 3 Alchemist in Limestone,” replied Ye Mo.</p> <p>“Of course, Ye Mo, or should I be calling you Brother Ye? As long as they are within my capabilities, I will follow all of your instructions in the future!” Elder Ye exclaimed, still smiling.</p> <p>“Please, just call me Ye Mo like you always do.”</p> <p>The two returned to the Ye’s mansion, but little did other people know, their relationship had taken a 180 degree turn.</p> <p>The news of Elder Yin advancing to Phase 3 had spread like wildfire. Ye Kuang had even invited all of the famous people in Limestone City to dinner to celebrate Elder Yin’s promotion. Elder Yin had become one of the most well-known people in Limestone City, a Phase 3 Alchemist that was able to create Spirit Fortifying Pills with markings on them.</p> <p>Even if he stood in front of the Three Major Alliance, the status that Elder Yin held still played an important role among them.</p> <p>Elder Yin was the star of the day. Even the heads of the four big clans had to treat him with respect, never forgetting to express their willingness to cooperate with him peacefully. Yet Elder Yin understood all that he had received had come from Ye Mo. If Ye Mo were to leave him one day, all of his fame would disappear instantly.</p> <p>The Ye Clan hosted guests for a few days. Every member of the Ye Clan was worked to their bones. Only a few people were seen on the training grounds.</p> <p>Ye Mo was on his way to Ye Mei’s place to meet Xiao Cao. A few days were enough for him to miss her. As Ye Mo passed by the training ground, two other people were walking in the opposite lane.</p> <p>“Brother Ye! Now that Elder Yin has become a Phase 3 Alchemist and was able to create pills with markings, we could use his pills to help us break through our limits in two months’ time! Then we will be able to secure the first two places in the Limestone Champion List!”</p> <p>Ye Hou was talking to the guy beside him. He was actually sucking up to him.</p> <p>The person walking beside Ye Hou wore a white robe and had long dark hair and perfect facial features. He was very handsome, and, naturally, Ye Mo knew exactly who he was: the young master of the Ye Clan, prodigy Ye Changsheng. At only the age of sixteen, he had reached the Spirit Cultivating Fifth Realm.</p> <p>Ye Changsheng smiled and said, “If I can become number one in the Limestone Champion List, our Ye Clan could have a chance at becoming the strongest clan in all of Limestone City.”</p> <p>“And by then, you’ll be scouted by one of the Three Major Alliance. You have a bright future ahead of you, brother. You might even surpass Ye Qin!”</p> <p>Almost every genius loved to compare themselves to Ye Qin. Even though Ye Qin had died, his achievements earned him respect amongst all the prodigies.</p> <p>“Ye Qin was strong, I won’t deny that. But in the end, he never left Tianwu Kingdom. I’m different! One day, I’ll be stepping outside of this kingdom!” Ye Changsheng laughed. No matter how intellectual one was, if they died, then all was lost.</p> <p>“Of course,” said Ye Hou with a nod.</p> <p>“You’re not bad yourself actually. You’re now a Spirit Cultivating Third Realm martial artist, and you’ve learned the traditional sword style of Ye Clan, the Six Pillar style. No one from your same year can defeat you with your current strength,” said Ye Changsheng with a smile.</p> <p>“But I’m still far from being your opponent.” As soon as Ye Hou finished his sentence, he saw Ye Mo walk towards them and noticed that the servants greeted him with respect. He remembered how Ye Mo had toyed with him a few days ago and could still feel his right hand shaking from pain.</p> <p>“Brother Ye, that is Ye Qin’s son, Ye Mo. He has been Elder Yin’s helper for quite some time now,” said Ye Hou. “And now with Elder Yin’s promotion to Phase 3, his status has also risen quite a lot.”</p> <p>Ye Changsheng examined the incoming Ye Mo but remained quiet. He was not interested in a martial artist that hadn’t even reached the Spirit Cultivating Realm. helper will always remains a helper, regardless of their status.</p> <p>That’s funny! To think that the likes of you would even dare to try and surpass my father! Ye Mo thought and smirked.</p> <p>Ye Mo did not even look at them and walked past them. Whether it was Ye Hou or Ye Changsheng, they were all just stepping stones to him.</p> <p>As Ye Hou saw that Ye Mo did not even greet them, he couldn’t contain his anger. “Did you see that, Brother Ye? After Elder Yin became a Phase 3 Alchemist, that brat didn’t even greet us!”</p> <p>“Ignore him. He’s just some minor person who suddenly got a little fame. He’s doomed to be an assistant forever. Why should we argue with someone like that?” Ye Changsheng said as they approached the main hall. The main hall was filled with guests. Naturally, the young master had to be there to entertain them.</p> <p>Ye Hou was somewhat angry at Ye Changsheng for not minding Ye Mo’s disrespectful manners. Ye Chansheng only viewed Ye Mo as someone lower than him, an assistant, but Ye Hou knew that Ye Qin’s treasure was still with him. He was determined to find of a way to steal it.</p> <p>And with Elder Yin’s new status, Ye Mo also gained some recognition himself. This made it harder for Ye Hou to steal the treasure, which made him decide that he had to dispose of Ye Mo. The sooner, the better.</p> <p>“Brother Ye, my younger brother Ye Ming will break through to the Spirit Cultivating First Realm tomorrow. I’m thinking of letting him become a helper for Elder Yin,” said Ye Hou as he followed Ye Changsheng to the hall.</p> <p>“You’re right. Since Elder Yin has become a Phase 3 Alchemist, he should have a better helper. Even though your younger brother doesn’t have any raw talent, he should be good enough for Elder Yin. I’ll make a suggestion to Elder Yin once we’ve reached the main hall.”</p>",
  "Chapter 23: Why Should I Kneel?": "<p>Ye Mo arrived at Ye Mei’s house but was unable to find her and Xiao Cao. One of the servants there told him that both of them had gone to the main hall.</p> <p>“A Phase 3 Alchemist sure is something, huh? Almost all of the important people in the clan are gathering in the main hall. That Elder Yin must be overjoyed.”</p> <p>Ye Mo walked out from the room and smiled. Yet Ye Mo wasn’t interested in the celebration. This is just a stage for some of the important people in Limestone City to come and get on our good side.</p> <p>Well, since Xiao Cao is in the main hall, I think I should go back and train. Now that Ye Mo has awakened four channels of his Dragon Energy, he could break through all of his Mortal Gates faster. He wanted to complete the feat as soon as possible and reach the Spirit Cultivating Realm. Only then could he fight geniuses like Ye Changsheng.</p> <p>Just as Ye Mo was on his way back to his room, Senior Fu came running and shouted, “Young master, Elder Yin was looking everywhere for you.”</p> <p>With Elder Yin advancing to a Phase 3 Alchemist, Ye Mo’s status had also risen with it, and this lessened some of Senior Fu’s worries.</p> <p>“Why is he looking for me?” Ye Mo asked.</p> <p>“He wants you to go to the main hall,” Senior Fu replied.</p> <p>“Tell him I’m busy training and don’t have the extra time to go to some noisy place,” Ye Mo said and began to leave.</p> <p>“Please, young master. Now that Elder Yin has risen to a Phase 3 Alchemist, he’s become a significant person in Limestone City. If he views you highly, you should at least meet his expectations. The training can wait,” Senior Fu said. “Our main hall is filled with prominent people from the city. You should go and meet them and make some friends your age. Please don’t let your late father down.”</p> <p>Ye Mo looked at Senior Fu. He was speechless. He wondered how Senior Fu would react if he knew Elder Yin’s advancement was all thanks to him. But since Senior Fu was worried about him, Ye Mo did not have the heart to refuse him. “Alright. I’ll head over there now.”</p> <p>Ye Mo dragged his feet to the main hall while Senior Ye stood and watched him leave. He would not go until he had confirmed that Ye Mo has entered the main hall.</p> <p>All of the seats in the main hall were taken by some of the most important people in Limestone City.</p> <p>Elder Yin and Ye Kuang sat in the middle while the Martial Arts Division master Ye Zhantian, Ye Mei’s father Ye Xiao and Ye Hou’s father Ye Di stood beside them with Ye Mei and Ye Changsheng.</p> <p>Ye Mei was not wearing her usual combat shirt but had instead changed to a pink dress. Her smile bloomed like a flowers. She held her chest as high as two mountains. Anyone would agree that she was the attention of the whole room.</p> <p>Most of the young men from other clans had their eyes glued to Ye Mei. On the other hand, many young women were staring at Ye Changsheng, the prodigy of the Ye Clan who had reached the Spirit Cultivating Fifth Realm.</p> <p>“I would like to express my gratitude to everyone for coming!” Ye Kuang said and laughed. Since his clan now had a Phase 3 Alchemist, his standing in Limestone City had risen as well.</p> <p>“No, it should be us who must thank you,” said one of the clan leaders. “Now that Elder Yin has advanced to Phase 3 and is able to create Spirit Fortifying Pills with markings on them, we other clans will have to rely on the Ye Clan from now on.”</p> <p>Even though it was a third level training pill, the Spirit Stabilizing Pill would yield better results than a Spirit Fortifying Pill with marking and the latter was still able to strengthen a person’s Meridian Energy and Mortal Gate.</p> <p>“He’s right!” Other clan leaders applauded.</p> <p>“You’re too generous.’ Ye Kuang smiled. “We’ve known each other for quite some time now. As long as all of you will take my side when it matters, I’ll definitely repay that debt. Elder Yin, do you have anything to say to them?”</p> <p>Ye Kuang turned and faced Elder Yin. With Elder Yin’s current status, even Ye Kuang had to take a step back when he was in Elder Yin’s presence.</p> <p>Elder Yin scanned the crowd and noticed Ye Mo standing in the crowd. “Let Ye Mo in!” Elder Yin said.</p> <p>“Who’s Ye Mo?” The crowd began to wonder who Elder Yin had summoned.</p> <p>“He’s the son of the late Ye Clan’s genius, Ye Qin. But he’s trash, unlike his father. He has been training for five years and still hasn’t broken through one of the Mortal Gates. He’s now an assistant under Elder Yin,” one of the students of Ye Clan said.</p> <p>“Oh, you mean the trash of Ye Clan!”</p> <p>“So this is what’s left of Ye Qin’s son, an assistant.”</p> <p>“Now that Elder Yin has become a Phase 3 Alchemist, he should get a better assistant. I would love to stay at his side and help him with his daily chores.”</p> <p>“Same here. Mo Feng from the Mo Clan used to be an assistant under Elder Huo. Now he’s about to become a Phase 2 Alchemist.”</p> <p>As soon as he heard Ye Mo’s name, Ye Kuang’s face tightened. Did Ye Mo do something to upset Elder Yin?</p> <p>“Ye Xiao, bring Ye Mo in,” Ye Kuang ordered.</p> <p>“Yes, lord.” Ye Xiao went into the crowd and brought Ye Mo in. Every single person had their eyes focused on Ye Mo, yet they weren’t able to sense any Spiritual Energy from him.</p> <p>“He sure is trash.”</p> <p>Ye Mo smiled at the malicious remarks made about him. In two months, he’ll show everyone present that he was better than his father.</p> <p>“Ye Mo, why aren’t you kneeling?” Ye Kuang asked.</p> <p>“Why should I kneel?” Ye Mo replied.</p> <p>“You dare act all high and mighty in front of Elder Yin?! You’re his assistant, act like one!” Ye Kuang snarled as he sent a force of wind towards Ye Mo, forcing him to take two steps back.</p> <p>As soon as Xiao Cao saw what was happening, she quickly ran out and kneeled in front of Ye Kuang with her head on the ground. “Clan lord! Please don’t punish him, I’ll take his place instead.”</p> <p>Xiao Cao kept banging her head on the floor until she was about to bleed.</p> <p>Shocked by Xiao Cao’s actions, Ye Mo quickly pulled her up and said, “Stop it, Xiao Cao. I did not kneel because I’ve done nothing wrong.”</p> <p>“At least he has some guts,” Ye Hou snarled. It seemed to him that the clan lord would take care of Ye Mo where he stood.</p> <p>“What are you doing, clan lord?” Elder Yin asked.</p> <p>Everyone was shocked by Elder Yin’s interference. Could it be that Ye Mo had not upset him?</p> <p>Ye Kuang’s eyes and he forced a smile, “Elder Yin, if Ye Mo had done anything to upset you, it’s natural for me to punish him.”</p> <p>“Who said that he had upset me? It was all thanks to him that I was able to become a Phase 3 Alchemist. I summoned him because I wanted to thank him in front of the crowd.”</p> <p>Everyone gulped, stunned by what Elder Yin had just said. Did he say that he was able to become a Phase 3 because of Ye Mo? When did Ye Mo become an alchemist?</p> <p>“Impossible!” Ye Kuang shouted. Don’t tell me Ye Mo is gifted as an alchemist. Even Ye Xiao and Ye Di were stunned by the fact the Ye Mo had the potential to become an alchemist, the same Ye Mo that wasted five years and had not even broken through one of his Mortal Gates.</p> <p>“How is this possible? Elder Yin wanted to thank Ye Mo in front of everyone?” Ye Hou clenched his fists tightly as his face became paler. There shouldn’t be anyone who knew that Ye Mo was regaining his power except for me. Now his ability is going to skyrocket if he gets the attention of Elder Yin. This is bad. I’ve to take care of him as soon as possible.</p>",
  "Chapter 24: Formation-Breaking Spear Technique": "<p>“Ye Mo has been by my side for three years already, hence he has also conducted a lot of research on alchemy. We often exchange thoughts on alchemy, and if it weren’t for Ye Mo’s reminders, I wouldn’t have been able to synthesize this Fortifying Pill with markings.”</p> <p>What Elder Yin spoke of again shocked everyone in the room.</p> <p>Elder Yin would not have become a Rank Three alchemist if it were not for Ye Mo’s reminders and his discussions with him. Did that mean Ye Mo’s alchemy skills were even better than Mo Feng’s? Everyone who was present was shocked and looked at Ye Mo with faces of disbelief.</p> <p>“Ye Mo, what had just happened was my fault. You may stand together with Changsheng and others,” Ye Kuang admitted</p> <p>Ye Mo did not pay attention to Ye Kuang, took Xiao Cao’s hand, and said, “Xiao Cao, are you alright?”</p> <p>Xiao Cao ceased her tears, shook her head, and said: “Master Ye Mo, I am alright, Master Ye Kuang is calling you.”</p> <p>“Standing with them? I am not interested at all. Elder Yin, if there’s nothing else, I’ll be on my way now,” Ye Mo said while holding Xiao Cao’s hand and walking to the living room door.</p> <p>Thud! Ye Kuang slammed his fists on the table, exclaiming with a cold voice, “Ye Mo, do not be too arrogant, Elder Yin had only said so just because he recognizes your talent.”</p> <p>“Is it not okay for me to not want to stay here? I am just a rubbish martial artist, and I am not used to standing with the geniuses of the Ye Clan,” Ye Mo said in an unconcerned tone. He didn’t have any positive feelings towards Ye Kuang and others since the beginning, and he wanted to leave this place even more after Xiao Cao was forced to knock her head against the ground due to those men.</p> <p>“This Ye Mo is an unsensible person. Brother Ye, let’s teach him a lesson,” Ye Hou said with a light smile.</p> <p>Ye Changsheng stood up and said to Ye Kuang, “Father, I think that people like Ye Mo who do not obey the rules are not qualified to be Elder Yin’s assistant. Ye Ming has already reached the Spirit Cultivating First Realm, and he also has some prior knowledge of alchemy. I recommend him to be Elder Yin’s assistant instead.”</p> <p>“Ye Ming has already reached the Spirit Cultivating First Realm?” Ye Kuang was shocked, then he nodded and smiled. “Changsheng is right, let’s replace Ye Mo then.”</p> <p>“Haha, replacing me? Let’s see if Elder Yin is willing to accept.” Ye Mo laughed sarcastically.</p> <p>Of course Elder Yin was going to refuse without a doubt. Without Ye Mo, his identity as a Rank Three Alchemist would instantly be uncovered as phony.</p> <p>“This Ye Mo is too arrogant, despite his usefulness to Elder Yin. Elder Yin has already successfully synthesized the Fortifying Pill with markings, so even without Ye Mo now, Elder Yin will still be able to synthesize the pill.”</p> <p>“Ye Mo’s temper is a bit like his father.”</p> <p>Ye Kuang also laughed coldly and said to the Elder Yin, who was by his side, “Elder Yin, this Ye Mo is just too arrogant, not paying you any respect.”</p> <p>“Well, the young are always a bit hot tempered. If he wants to leave, let him leave. As for the issue of replacing my assistant, please do not speak of it anymore. I’ve raised Ye Mo since his childhood, so I’ll be angry with anyone who wants to replace and take him away from me,” Elder Yin said with great pride.</p> <p>“Elder Yin? What?” Ye Kuang said hurriedly without hesitation, but paused at once. If Elder Yin were a Rank Two alchemist, he would have disregarded Elder Yin’s feelings and punished Ye Mo right away, but this is not the case anymore. Elder Yin had become a Rank Three alchemist, with a status maybe even higher than himself. He did not dare to neglect Elder Yin’s opinion.</p> <p>Ye Mo took Xiao Cao’s hand and left the living room in front of everyone’s dumbfounded eyes.</p> <p>“Xiao Cao, I’ll accompany you to my room. I will look for some Blood Activating Pills for you,” Ye Mo said.</p> <p>“Master Ye Mo, that was a great opportunity for you to become successful just now. Why did you do that?” Xiao Cao didn’t pay attention to the wound on her forehead; she was distracted, and her face slightly reddened as Ye Mo was her hand.</p> <p>“Regarding the Clan, I had never had any favorable impressions of them. How much glory did my father bring to the Ye Family during his youth? Despite it all, once my father had fallen ill, how did those people treat my father? If it wasn’t for my powerlessness, I would have left this Ye Clan a long time ago,” Ye Mo said while getting increasingly agitated.</p> <p>Xiao Cao held Ye Mo tightly in both hands. She knew how much humiliation Ye Mo had been enduring over the years, but she was helpless and could only hide silently in a corner. She was afraid of implicating Ye Mo with her clumsiness.</p> <p>“Master Ye Mo, in light of your talents in alchemy and Elder Yin’s recognition of you, you have to work hard!” Xiao Cao said.</p> <p>“Xiao Cao, I don’t really appreciate alchemy that much. With enough time, I will bring you and Uncle Fu away from the Ye Clan, and we live a prosperous life together,” Ye Mo said.</p> <p>“As long as Master Ye Mo is well, it doesn’t matter if Xiao Cao tires or suffers.” Xiao Cao shook her head.</p> <p>“Such a silly girl.” Ye Mo gently rubbed Xiao Cao’s head, at the same time vowing in his heart that he must help Xiao Cao and Uncle Fu live better lives, at least so neither of them would have to work as servants any longer.</p> <p>Ye Mo used some Blood Activating Pills to treat Xiao Cao, and Xiao Cao’s forehead fully healed. For this reason, Xiao Cao was happy for a while, as who would want to have a scar on the forehead? Ye Mo stared at Xiao Cao, who was jumping up and down with a smile on his face.</p> <p>After Xiao Cao left, Ye Mo took out the incomplete book of martial technique. Ye Mo quickly looked through the book and found out that there were several parts missing.</p> <p>This book of martial technique was missing a few pages in every chapter, so many of the tricks were missing pieces.</p> <p>Ye Mo knew that this martial technique was called the Formation-Breaking Spear technique, which is a spear martial technique created by a Tianwu Kingdom marshall. The technique was designated to break enemy army formations, allowing one person, among thousands of enemies, with only a spear to kill enemies and captivate enemy generals from a thousand miles away with ease.</p> <p>“This fragmented Formation-Breaking Spear technique grants one the ability to directly decapitate enemy generals in the middle of an army. Perhaps this is a martial technique of a Mid-grade Mortal Level, but unfortunately it has fallen to pieces.”</p> <p>Ye Mo could not help but be disappointed. If it were the first or last half that was incomplete, Ye Mo could have learned a trick or two; one martial technique trick of the Mid-grade Mortal Level would certainly be a lot stronger than a complete Spiritual Level martial technique. However, this book of martial technique was missing so many pages, how would he possibly be able to learn anything?</p> <p>“If this was a complete martial technique, and I had a nice spear, my combat power will definitely soar.”</p> <p>Ye Mo came up with an idea. His dragon power could observe alchemists’ control of Yuanli during pill synthesis, so he might be able to simulate the martial technique on his own.</p> <p>Ye Mo immediately took action after the thought. He first provoked three dragon powers to his brain mortal gate, which resulted in an increase nerve reaction speed. He then started to flip through the pages of the book.</p> <p>The tricks of the Formation-Breaking Spear technique started to imprint in his mind. Although the tricks were incomplete, through Ye Mo’s increased nerve reaction speed, he could see the tricks automatically play out in his mind. Nevertheless, given that the spear technique is fragmented, despite its great power, the tricks do not flow together smoothly.</p> <p>“Let me use another dragon power to see if I can simulate the whole spear technique.”</p> <p>Ye Mo transferred his last dragon power to his mind’s mortal gate, and Ye Mo’s nerve reaction speed was accelerated once again, but it was followed by violent stings of pain. Simultaneously, the complete spear technique was also forming in his mind.</p> <p>“Ah!”</p> <p>All of a sudden, there came a wave of intense pain in his head. Ye Mo screamed aloud in pain, but in that moment, at the same time, the four dragon powers dissipated from his mind’s mortal gate.</p> <p>“Damn, I can’t bear the full strength of the four dragon powers with my current physical strength. I almost completely simulated the full spear technique just now.”</p> <p>As with the right hand mortal gate, with Ye Mo’s current physical state, hce ould only withstand three dragon powers, and bearing four dragon powers caused excessive damage to his body.</p> <p>“It seems like I will be able to simulate the complete Formation-Breaking Spear technique after reaching the Spirit Cultivating Realm, but it is already enough for me to fight with this half of the spear technique. I should probably start to look for a weapon that’s suitable for me.”</p>",
  "Chapter 25: Ye Mo’s Means": "<p>After the end of the banquet, Elder Yin immediately looked for Ye Mo, worried that Ye Mo would become angry and refuse to cooperate with him any longer.</p> <p>Nonetheless, Ye Mo did not fuss with him about it. For now, Elder Yin was still a lot of help to him, so of course Ye Mo would not turn Elder Yin away. After using several dragon powers to help Elder Yin to synthesize a few Fortifying Pills with markings, Ye Mo left the Ye mansion.</p> <p>In hiding, Ye Mo put on a tiger mask and departed for the Xiao mansion. He had not come to practice his techniques that today, but, instead, to prepare for tomorrow’s auction.</p> <p>One must have at least one purple gold piece–that is, a hundred gold pieces–in order to enter the auction. Although Ye Mo could get such amount of money from Elder Yin, it would definitely raise Elder Yin’s suspicions. After all, Elder Yin was of the Ye Clan, so Ye Mo did not dare to take the risk.</p> <p>Moreover, Ye Mo had found another subject to borrow money from, and that was Leng Leng. Furthermore, Ye Mo did not look for Leng Leng simply to borrow money from her.</p> <p>Ye Mo came to the Martial Pavilion and sparred with Xiao Feng for a bit. Ye Mo, who had already awakened four dragon powers, could easily defeat Xiao Feng, who limited his Yuanli to the Spirit Cultivating First Realm. Xiao Feng would have to raise his Yuanli to the the Spirit Cultivating Second Realm in order to win Ye Mo.</p> <p>“How your strength increases with such incredible speed!” Xiao Feng said with amazement. It had only been a few days, and Ye Mo could already go toe-to-toe with Spirit Cultivating Second Realm martial artists. If Ye Mo could open up the mortal gates in his legs, his strength would continue to increase.</p> <p>“Thanks to the Fortifying Pills given to me by Miss Xiao.” Ye Mo said.</p> <p>“I heard that a few days ago, Elder Yin of your Ye Clean became a Rank Three Alchemist. He could only reach Rank Three because of his alchemy assistant’s help. Are you that alchemy assistant?” Xiao Feng asked.</p> <p>“Yes.” Ye Mo admitted and nodded. Everyone knew he was Elder Yin’s alchemy assistant, and that there was no need to hide it any longer.</p> <p>“What about the alliance between us?” Xiao Feng said.</p> <p>“Please rest assured, I have nothing to do with the Ye Clan anymore. The Xiao Clan has helped me a lot, so of course I stand on the side of your family,” Ye Mo said.</p> <p>Xiao Feng was then relieved. It seemed that Ye Mo felt hopeless about the Ye Clan. Who knew what happened to him there before.</p> <p>“Are the Leng siblings still upstairs?” Ye Mo asked.</p> <p>“Leng Feng has already gone home. Leng Leng is now with the lady.”</p> <p>“Where is she now? I was looking for her.”</p> <p>“The two of them should be in the backyard.”</p> <p>Ye Mo passed through the rock garden, walked on slate paths, and finally reached the backyard of the Xiao mansion. With one glance, Ye Mo saw Xiao Yue, who was in a white dress.</p> <p>Xiao Yue, as usual, had a veil over the face, but the veil was wet. Her soft eyes appeared as if covered with a layer of fog, which blurred her moon-like eyes. Xiao Yue sat on the gazebo sobbing, and Leng Leng was by her side, comforting her.</p> <p>Standing in the distance, Ye Mo witnessed the scene with a heavy heart. Xiao Yue, who on the outside was an ice queen, was hiding in her gazebo, weeping.</p> <p>Her pitiful appearance made Ye Mo feel the need to protect her, but Ye Mo immediately stomped down on this desire.</p> <p>If his father had yet been avenged, how could he even start to think about love?</p> <p>Ye Mo shook his head and considered whether he should enter the scene. However, as soon as he took his first step, Xiao Yue noticed him. As a charms master, her power was different from the ordinary person, thus she discovered Ye Mo in an instant.</p> <p>“Who is it?” Xiao Yue’s misty eyes suddenly froze, and Leng Leng, who was standing by her side, was also surprised as she stared vigilantly at Ye Mo.</p> <p>Ye Mo walked over slowly and said apologetically, “I had originally been looking for Leng Leng, but when I saw Miss Xiao crying here, I didn’t dare to bother.”</p> <p>“Yue Yue, let me warn you, this guy is just a leech. He wanted to rape me a few days ago! How could you find such a person to be your foreign aid? You should be careful with him in the future,” Leng Leng exaggerated while glancing at Ye Mo with a face of annoyance, which was kind of cute.</p> <p>Xiao Yue certainly did not believe Leng Leng’s words. She took out her handkerchief, wiped her eyes, and said, “Sorry about that. You came looking for Leng Leng?”</p> <p>“Correct. What is the matter with this leech who has come looking for me?” Leng Leng asked.</p> <p>“This is for the auction tomorrow.” Ye Mo said.</p> <p>Tomorrow, there would be a high-grade magic weapon being auctioned off. This news has most likely spread throughout the Limestone City by now, so Xiao Yue surely would know.</p> <p>The Xiao Clan had not planned on participating in the competition for this weapon, as their clan did not have the wealth to compete with the other three clans, and in overall power, the Xiao clan was also the weakest amongst the four.</p> <p>Xiao Yue’s eyes revealed a trace of surprise, and she asked, “Are you planning to try and get your hands on that high-grade magic weapon?”</p> <p>“As long as we can get our hands on that high-grade magic weapon, it may not be impossible for both of us to enter the top five during the Limestone Champion List competition,” Ye Mo said as he nodded.</p> <p>Xiao Yue smiled wryly, shook her head, and said, “Do you think I don’t want to buy that high-grade magic weapon? Right now, Xiao clan’s power is definitely unable to compete with the other three big clan.”</p> <p>“You are not only a leech, but you’re also greedy. No one in the whole Limestone City has a high-grade magic weapon, so the weapon at the auction will be highly coveted. You may still not be able to buy it even if you had the money,” Leng Leng said with a stunned expression.</p> <p>“I certainly know this, but what if I adopt the identity of an alchemist?” Ye Mo took out a Stabilizing Pill with markings on it, and its surface emitted concentrated pill fragrances.</p> <p>Leng Leng and Xiao Yue both stared at the Stabilizing Pill in Ye Mo’s hand in astonishment. The Stabilizing Pill is a Rank Three Pill, which could only be made by Qin Mo in the whole Limestone City, but there were also markings and pill fragrance on this Stabilizing Pill.</p> <p>Simply being able to synthesize Fortifying Pills with markings, Elder Yin had already achieved such a respected status. How powerful was this alchemist who could synthesize a Stabilizing Pill with markings and aroma?</p> <p>“Hey, don’t think that by showing us a Stabilizing Pill with markings and pill fragrance, you will be able to get away with it. Do you really think that they are fools?”</p> <p>Leng Leng obviously would not believe that the pill was synthesized by Ye Mo. It was already incredible for someone of his age to synthesize a Stabilizing Pill, not to mention one with markings and fragrance.</p> <p>Knowing that the two did not believe him, Ye Mo could not help but smile, “Who else in this Limestone City can synthesize such a pill?”</p> <p>Was there? No. In their minds, Leng Leng and Xiao Yue both shook her heads at the same time, but they still could not accept the fact that Ye Mo was able to synthesize such a pill.</p> <p>“Ye Mo, did you really synthesize this pill yourself?” Xiao Yue asked skeptically.</p> <p>“It was not synthesized by me. However, I have the means to enhance pills and reform ordinary pills into high-quality pills!”</p> <p>Ye Mo took out a few Fortifying Pills from his pocket. On the surface of those Fortifying Pills, they all showed markings, they all emitted concentrated fragrances, and they were all high quality. In the whole of Limestone City, there was no one who sold such amounts of high-quality pills.</p> <p>“All of them are Fortifying Pills with markings?”</p> <p>The two girls froze right on the spot and looked at Ye Mo with shocked expressions.</p>",
  "Chapter 26: Auction": "<p>Without paying attention to the two girls’ surprised faces, Ye Mo continued, “With my alchemy technique, it isn’t easy for me to reform too many Stabilizing Pills, but I can reform Fortifying Pills in large quantities. Moreover, this pill does have a strengthening body effect.”</p> <p>“That is amazing! Your pill reformation technique is incredible! Can you teach me?” Leng Leng batted her eyelashes and looked at Ye Mo. Her previously abrasive demeanor had suddenly turned to curiosity.</p> <p>“If you are not an alchemist, you will not be able to learn this!” Ye Mo said deliberately.</p> <p>Leng Leng’s big eyes widened. Quickly, she grabbed and shook Ye Mo by the arm, and said pleadingly, “Brother Ye Mo, I have a few Stabilizing Pills at home. Can you help reform them?”</p> <p>“Am I not a leech?”</p> <p>“Haha, that was a misunderstanding, all just misunderstandings. How could people like brother Ye Mo take advantage of me?” Leng Leng said imploringly.</p> <p>“Let’s talk about that when the auction is over. Our mission at hand is to get that high-grade magic weapon first.” Ye Mo said.</p> <p>After the three discussed and finalized their plans, Ye Mo returned to the Ye mansion.</p> <p>The next day, when just as the sun rose and the sleeping Limestone City began to show its ferocious face, all the clans began their preparations. Today was the day when one of them would get their hands on a high-grade magic weapon. As for which family would be the final victor, the result was still unknown.</p> <p>In a bedroom, a black-haired man sat on a wooden bed with his legs crossed, eyes slightly closed, and air continuously flowing through the man’s nostrils. The man slightly raised his brows, and suddenly, the man opened his eyes with a faint smile on his face.</p> <p>“It won’t be long until I can open the mortal gates in my legs.”</p> <p>Ye Mo jumped off the wooden bed at once and asked Uncle Fu to notify Elder Yin that he would be taking a day off, and that he had something to do today and would not be able to help him with the fire blowing. This resulted in a burst of insults from Uncle Fu, but Uncle Fu knew Ye Mo would be up to something, so he obeyed and went anyway.</p> <p>Ye Mo left the Ye Mansion, but changed in a black robe that had a hood that covered his entire head, making it difficult for others to see his appearance. Xiao Yue and Leng Leng were also standing at the gate of the Xiao mansion waiting for Ye Mo.</p> <p>“Hey you two little girls, how do I get to the Muyang auction house?” The two girls heard an old man’s voice nearby.</p> <p>“Hello sir, are you also going to the auction? Let us take you with us.” Leng Leng said.</p> <p>“Haha, Ye Mo, it seems that you can deceive a lot of people with this voice, even the wicked Leng Leng has been tricked by you.” Xiao Yue grinned.</p> <p>“Ye Mo?” Leng Leng was dazed and said, frustrated, “Hey, Ye Mo, how dare you trick me!”</p> <p>“Okay, let’s go to the auction house,” Ye Mo said while leading Leng Leng and Xiao Yue to the auction. Ye Mo’s fake voice was very good, although it still carried a slightly immature tone. For people who were not familiar with Ye Mo, though, it would be hard to tell the difference.</p> <p>The three of them walked to the main street and attracted a lot of attention. Xiao Yue and Leng Leng were already for a long time famous beauties in Limestone City, so the pedestrians were all intrigued by them as they saw the two of them walking behind a black-robed man.</p> <p>“Once we’re at the auction, I will be the master of both of you. I have to pretend to be an inscrutable alchemist in order to make the other three families fear me,” Ye Mo reminded them as they approached the auction house and continued walking. Xiao Yue and Leng Leng then promptly followed him and did not complain. Their journey today was a gamble. The Xiao family could not stand up to the other three families, so they had no say about the auction.</p> <p>At that moment, the auction was already crowded with people, and it was unprecedentedly lively, despite the fact that many families knew that they were unable to compete with the big families. Nevertheless, to be able to witness the presence of a high-grade magic weapon would already be a great joy for them, not to mention that there would be other precious items auctioned off as well.</p> <p>One must have at least one purple gold in order to enter the auction. Members of clans all took out cards as identifications of their status to show the security guards outside the auction before entering.</p> <p>Subsequently, people gave way, and people from the Ye, Mo and Qin clans entered the auction house.</p> <p>“Let’s go!” Ye Mo said and walked to the auction at a slow pace.</p> <p>“Gentleman, you must have at least one purple gold to enter the auction house.”</p> <p>Xiao Yue took out a golden card and said, “This card should be enough.”</p> <p>The guard did not say anything else after seeing the golden card, and the three slowly entered the auction house.</p> <p>The auction venue was very crowded. The sea of faces, accompanied with clamorous noise, made Ye Mo somewhat uncomfortable.</p> <p>The three of them walked directly into the hall, and until arriving at the auction, it became a little less noisy. The three walked to a space near the auction platform, sat down, and quietly waited for the start of the auction.</p> <p>“Sister Yue Yue, there are just too many people here. We should have identified as the Xiao family, so we might be able to get a VIP room.” Leng Leng looked at the surroundings and felt uncomfortable.</p> <p>“My father would not have agreed to this,” Xiao Yue said lightly.</p> <p>Xiao Yuanshan was very cautious in his actions. Step by step, he elevated the Xiao family to become one of the four giants.</p> <p>“Hey, why is Miss Xiao Yue at the auction but only sitting here? If the young master of the Barbarians knew, he will be angry as hell, so how about coming to my VIP room instead?”</p> <p>Mo Feng was preparing to head to his VIP room, but suddenly saw Xiao Yue with the veil. He thought it was just an illusion at first, as how would a girl like Xiao Yue sit in ordinary seats like the others? He came to make sure, but did not expect it really to be Xiao Yue.</p> <p>The Barbarians? Hidden under the black robe, a thought crossed his Ye Mo’s mind. In the realm of Tianwu, there were a variety of races; the Barbarians in the southern wilderness and the Sky Witches in the northern wilderness are the two most powerful races among the minorities. They only followed the orders of the royal family, but the royal family had never commanded these races before. They only had to hand over a certain amount of resources to the royal family each year.</p> <p>Does that mean there was some relationship between the Xiao clan and the Barbarians?</p> <p>“No, I am fine sitting here with my master,” Xiao Yue responded gently, but when hearing the mention of the Barbarians, her brows slightly raised.</p> <p>“Master?” Not until then had Mo Feng noticed Ye Mo in a black robe and could not help but ask, “I have never heard of you having a master.”</p> <p>“Mo Feng, he is the master of both of us. He is an alchemist who is even more powerful than President Qin Mo,” Leng Leng said.</p> <p>“Haha, that’s ridiculous, how can there be an alchemist who is even better than President Qin Mo in Limestone City? Have you two just been deceived by this old man?”</p> <p>Mo Feng smiled disdainfully. Even though his laugh wasn’t too loud, some of the people waiting around looked to their side with rude expressions on their faces.</p> <p>Qin Mo is the president of the Alchemist Division, recognized as the most powerful alchemist in Limestone City.</p> <p>“Little boy, the Tianwu Kingdom is huge. Is it only Limestone City that has alchemists?”</p> <p>Ye Mo spoke in his hoarse voice, quietening Mo Feng immediately. Ye Mo’s meaning was very clear, that he was not from Limestone City.</p> <p>Mo Feng did not dare to speculate on his identity and did not suspect any further after seeing the respectful looks of the two girls towards the black robed man.</p> <p>“Xiao Yue, I heard that the young master of the Barbarians will also be coming to the auction. Be careful around them.”</p> <p>“You should be the one who needs to be careful. Don’t think that support from the Barbarians make you suddenly powerful.” Leng Leng pointed at Mo Feng with one hand on her waist.</p> <p>“When the Mo family becomes the most powerful clan, I will make you kneel in front of me for mercy.” Mo Feng stared at Leng Leng, with a trace of lust in his expression, and then turned and walked to his VIP room.</p>",
  "Chapter 27: The Barbarians": "<p>Ye Mo stared at Mo Feng as he left. “That guy’s aura is stronger than it was the last time. It seems like he has reached the Spirit Cultivating Third Realm,” he said in a stern voice.</p> <p>“The Mo Clan has a good heritage. Plus, he is also an alchemist, hence having a cultivation speed faster than the average person,” Xiao Yue said.</p> <p>“Oh right. So what’s the relationship between the Barbarian young master and you?” Ye Mo asked in an unruffled voice, surprising Xiao Yue and Leng Leng at the same time. Both of their faces showed signs of sorrow.</p> <p>“If you don’t want to say it, that’s fine,” Ye Mo said. He turned back at the auction house and continued to wait for the auction to begin.</p> <p>Leng Leng filled herself with courage and whispered, “The Barbarian young master is engaged to Yue Yue.”</p> <p>Getting engaged was supposed to be a good thing, but Ye Mo could tell this was definitely not Xiao Yue’s wish. Was this the reason of she was crying in the backyard the last time?</p> <p>“Man Tai of the Barbarians often comes to Limestone City to sell weapons and beast cores. During a chance encounter, the Barbarian young master Man Tai met Yue Yue, admired Yue Yue’s beauty, and wanted to possess her. After returning to his clan, he asked the Barbarians’ master to come to the Xiao Clan to propose. Even if the Xiao Clan could be counted as a big clan in Limestone City, it is incomparable to the Barbarians’ race. Yue Yue’s mother nodded and agreed without further hesitation to the proposal,” Leng Leng said.</p> <p>“I see. I guess you’re delaying them for now?”</p> <p>Ye Mo did not understand until now how Xiao Yue was able to stop Mo Feng from troubling him. It was because of the Barbarians.</p> <p>Xiao Yue nodded and said, “I should be able to control my own destiny. No one can decide who I should marry, so I have to be one of the top five in the Limestone Champion List competition. Only then will I be able to change this fate.”</p> <p>By being one of the top five in the Limestone Champion List competition, one would be able to enter the three major leagues, become a disciple of a league, and soar in status.</p> <p>Ye Mo looked at Xiao Yue’s determined look and recalled his own life. That’s right, I should be able to determine my own fate. No matter my birth status, regardless of my not being able to practice for five years. As long as I work hard, I believe I can definitely control my own destiny.</p> <p>“I will help you, Miss Xiao, at all costs,” Ye Mo said lightly.</p> <p>“Don’t forget, there’s also me!” Leng Leng said with laughter.</p> <p>“Calling me Miss Xiao seems awkward. If you don’t mind, you can just call me Yue Yue.” Xiao Yue felt a touch of warmth in her heart.</p> <p>“Yue Yue!”</p> <p>“Ye Mo, you are a lucky on., Yue Yue has never let other men call her like that. Anyhow, don’t waste your time on her, you definitely have no chance at all,” Leng Leng said.</p> <p>Ye Mo scratched his head in embarrassment and smiled. He wanted to help Xiao Yue only because he felt that they both shared similar experiences.</p> <p>“Look, the auction is about to start.”</p> <p>The three turned their eyes to the auction house as the auction floor lit up with lights.</p> <p>Under the fiery eyes of the crowd, a woman in a red sheath dress walked onto the auction floor. The woman’s curvaceous body cloaked by the dress was particularly alluring, especially since her body gave off sensual vibes, arousing a lot men at the venue and making their mouths go dry. The woman’s every move was enough to evoke every man’s desires.</p> <p>Even Ye Mo had to admit that Qi Ying had the capability to seduce any man, but he did not expect her to be the auctioneer of this event.</p> <p>Among the VIP rooms, a dark-skinned man with a rough face stared at the woman on the auction floor, and he felt arousal gather in the lower part of his body. He said to Mo Feng who was beside him, “Mo Feng, who is this girl? She is definitely arousing my sense.”</p> <p>“Man Tai, brother, this woman is of the Tianwu Kingdom’s Qi Clan and has a management role in Limestone City,” Mo Feng said with a smiley face. He also had a lot of fantasies of Qi Ying, but his pursuit of her was stopped by his father without a reason.</p> <p>“Just a management role? Then I want to have ” said Man Tai.</p> <p>“Man Tai, brother, I advise you to give up. This girl has a sizeable background. If she were merely of a management role, I would have already tried to court her, but my father reminds me all the time not to provoke her,” Mo Feng said.</p> <p>“It seems that I have to use some others means to try and court her, then,” Man Tai said while glancing at the auction table with eyes filled with lust, as if he wanted to take off Qi Ying’s clothes.</p> <p>“Man Tai, Xiao Yue is sitting in the ordinary seats. Would you want to go take a look later?” Mo Feng said.</p> <p>“That girl always pretends to be cold, and that bothers me all the time. Wait until I marry her, and then I will take that cold veil off her face.”</p> <p>Because of Qi Ying’s appearance, the auction gradually became quiet. Qi Ying’s eyelashes remained still while her eyes swept across the venue. She announced, “Everyone, I won’t say too much nonsense but will go straight to the topic instead. In today’s auction, there will be three items being auctioned off. In order to not keep you all waiting, the first item will be the high-grade magic weapon.”</p> <p>Gasp!</p> <p>As soon as the four words were said, the whole venue burst into discussion. No one expected the auction to bring out the finale item at the beginning.</p> <p>“High-grade magic weapon!” Ye Mo’s hands clasped into fists. He was excited to find our more about the rare item.</p> <p>Feeling the swell of excitement in the venue, Qi Ying gave a slight smile. For Limestone City, this weapon was a rare weapon indeed.</p> <p>“Nevertheless, I should say a few words first. In this auction, if anyone dares to use force, it will be considered as an offense to the Qi Clan” As Qi Ying spoke, an old man clothed in black slowly walked over with his hands behind his back. He emitted a powerful aura that threatened even Ye Kuang and the others. The old man’s eyes swept across the venue, imposing a strong pressure on everyone in the audience.</p> <p>“This kind of aura is of Half Step to the True Energy Realm!”</p> <p>Ye Kuang and the others had all reached the Energy Shaping Ninth Realm, only one step from the True Energy Realm, but they could all perceive a sense of threat from the old man. Half step to the True Energy Realm, even though was it only half a step from the True Energy Realm, was still not a force they could oppose and win.</p> <p>The presence of the old man silenced the venue.</p> <p>“Let us present the high-grade magic weapon now.” As Qi Ying’s words were said, everyone’s eyes collectively shifted from Qi Ying’s body to the entrance of the auction floor. A beauty’s temptation may be tempting, but to some others, a high-grade magic weapon was highly attractiveness as well.</p> <p>Under the watchful eyes of everyone, a muscular man carried a five-foot tall wooden box from the entrance to the auction floor, placed the wooden box on the table, and left.</p> <p>Qi Ying swayed her hips as she walked over to and opened the wooden box. She then took out a cyan-colored sword out of the box. The sword was four and a half feet long and its surface gave off an azure glow.</p> <p>“Azure Light Sword, high-grade magic weapon, made by a Yellow Rank Refiner. The sword is four feet long, whereas the handle is half a foot long. As Yuanli is injected, all subjects under the same realm can be instantly eliminated,” Qi Ying explained.</p> <p>Under the same realm, instant elimination. This was enough to thrill the entire crowd.</p> <p>The presentation of the Azure Light Sword excited everyone. The cyan glow beamed from the sword and made the sword extremely attractive.</p> <p>Whether it was Ke Kuang and Ye Changsheng sitting in the VIP room, or the Qin father and son in the private room, all their hearts swelled with enthusiasm.</p> <p>If they were able to take this Azure Light Sword, it would definitely be an extra benefit for them during the Limestone Champion List competition. Not only did they desire a spot in the top five, but they also desired the glory of being in first place.</p> <p>The Azure Light Sword was the type of weapon most people were accustomed to using. Some families even had its techniques passed down from their ancestors.</p> <p>However, after Ye Mo took a look of the weapon, he immediately lost interest. He already knew the Formation-Breaking Spear technique. If he could be equipped with a high-grade spear instead of a sword, by using the spear technique, it would not only be instantly kill all of his opponents in the same realm, but also martial artists above his realm.</p> <p>On the other hand, Leng Leng and Xiao Yue’s eyes were flashing with enthusiasm. It was obvious that both the girls’ preferred weapon was the sword.</p> <p>“With this Azure Light Sword, my Ye clan’s Six Pillar Sword Style will be able to actualise its full potential,” Ye Kuang said loudly as he stared at the Azure Light Sword on the auction floor.</p> <p>The Six Pillar Sword Style was the Ye Clan’s most famous sword style of all. The six pillars combined into one while varying in different forms, launching offensive and violent attacks of great damage. The Ye Clan once had a powerful member who completely cultivated the Six Pillar Sword Style; a whole mountain was pierced through by his attacked. His technique posed incredible power.</p> <p>In the other VIP room, Man Tai did not look at the Azure Light Sword, but had his eyes always on Qi Ying.</p> <p>“Man Tai, are you not interested in the weapon at all?” Mo Feng felt that Man Tai had not even paid any attention to the Azure Light Sword, so he could not help but ask.</p> <p>“We Barbarians never use swords. Swords are for girls.”</p> <p>Barbarians are born with great strength, hence are all good at using axes, blades, and war-hammers, all large-sized weapons. The Barbarians were also natural-born weapon forgers, but they were only good at forging weapons like axes and blades.</p> <p>“Nevertheless, even my Barbarian race does not have that many high-grade magic weapons like this. Rest assured, as long as you eliminate Xiao Yue from the Limestone Champion List, I will pay for a half of the price of the sword,” Man Tai said.</p> <p>After hearing what Man Tai said, Mo Feng immediately smiled obediently and said, “Man Tai, I appreciate your confidence in me. Xiao Yue is only at the Spirit Cultivating Second Realm, and the beast she controls is only at the Third Realm. If I could be equipped with this weapon, I will easily defeat her.”</p> <p>Qi Ying looked at the noisy auction venue, waved her hand, and smiled, “The price of a mid-grade magic weapon is 100 purple gold pieces. Hence, a high-grade magic weapon will have the starting price of 500 purple gold pieces.”</p> <p>As soon as the starting price was stated, many members of minor families shouted out their bids.</p> <p>“600 purple gold pieces!”</p> <p>“700 purple gold pieces!”</p> <p>“800 purple gold pieces!”</p> <p>As Ye Mo heard the price rise, he could not help but shake his head. 800 purple gold pieces was definitely a price that was unthinkable for an average person. Even so, clan members still shouted such numbers for what Ye Mo thought as just a weapon.</p> <p>This was a world dominated by the strong. Next to power, wealth and beauty were not worth mentioning.</p> <p>When the price reached 1000 purple gold pieces, the noises at the present scene gradually weakened. Having said that, many at the venue knew this was just the beginning of the auction as the four major families still had not made their bids.</p> <p>“1100 purple gold pieces!” Ye Kuang said.</p> <p>“How pitiful it is to only bid 1100 purple gold pieces! 2000 purple gold pieces,” Man Tai said loudly.</p> <p>When this price was declared, many turned their attention to the VIP room where Man Tai and Mo Feng sat. 2000 purple gold pieces! Even the four major families could not raise such an amount of money.</p> <p>“Who is this guy?” Ye Kuang’s complexion changed slightly. 2000 purple gold pieces! The Ye Clan would not be able to gather that much money at once.</p> <p>At the same time, the Limestone City leader Qin Huang in the other room paled. That price was just crazy. In the whole of Limestone City, who else would be able to afford such a price?</p> <p>“Haha, are you seeing their surprised expressions? Even with the Qin, Ye, Xiao clans’ power, they do not dare to raise such a large sum of money. The Azure Light Sword is going to belong to us.”</p> <p>A large smile took up much of Mo Feng’s face. This Azure Light Sword’s cost would be split between the Mo family and the Barbarians, and all he had to do was stop Xiao Yue from entering top five in the Limestone Champion List competition. “We’ve struck an incredible deal.”</p> <p>“As long as I make my move, all the Ye or Qin clan members will have to stand aside,” Man Tai ​​laughed and said. The power of the Barbarians was beyond comparable to the small families of Limestone City.</p> <p>“Who is this, the man who bid 2000 purple gold pieces right away?” Ye Mo said with surprise.</p> <p>Xiao Yue’s brows knitted together as she pondered,””Just by the sound of his voice, it should be Man Tai, but the Barbarians do not even use swords. Why would he still want the weapon?”</p> <p>“Yue Yue, this dude already bid 2000 purple gold pieces. I reckon no one will dare to compete with him.”</p> <p>As the bid of 2000 purple gold pieces was announced, no one in any of the other clans said a single word. Ye Kuang and Qin Huang were both feeling somewhat gloomy, as the price of 2000 purple gold pieces clearly was not affordable for them.</p> <p>Qi Ying, who stood on the auction floor, was also a bit shocked. The price had far exceeded her expectations.</p> <p>“2000 purple gold pieces. Any more bids?”</p> <p>Everyone was speechless. Man Tai and Mo Feng both had smug smiles on their face, especially Mo Feng who, in his mind, was already imagining how he would use the Azure Light Sword to excel in the Limestone Champion List competition.</p> <p>“If no one is going to raise a higher bid, then I will…” Before Qi Ying could finish her sentence, a calm and old voice spoke u.</p> <p>“The old man bids 200 pieces of Stabilizing Pills.”</p> <p>Bidding 200 pieces of Stabilizing Pills? Everyone sitting around Ye Mo was stupefied. Was using Stabilizing Pills to raise a bid even permissible?</p> <p>Even if he was bidding with Stabilizing Pills, it would still not be enough. Although the price of Stabilizing Pills is much higher than that of the Rank Two Fortifying Pills, that would still be only equal one purple gold piece per pill. 200 pieces of Stabilizing Pills would only be worth 200 purple gold. Was this old guy confused?</p> <p>“Haha. Hey old guy, are you stupid?”</p> <p>“He wants to buy the Azure Light Sword with only a few Stabilizing Pills?” Mo Feng said with disdain.</p> <p>Hearing the sneers and laughter around him, Ye Mo coughed a few times and said, “Sorry, the old man did not make it clear just now. It is 200 Stabilizing Pills with markings and pill fragrances.”</p> <p>Ye Mo’s sentence set off a ruckus in the auction. Stabilizing Pills originally had the effect of assisting Energy Shaping Realm martial artists in their cultivation, but Stabilizing Pills with markings and pill fragrances would even strengthen those martial artists’ mortal gates and body, laying the foundation for an elevation to the True Energy Realm in the future.</p> <p>A Stabilizing Pill with markings and pill fragrances was definitely worth a high price!</p> <p>“How is this possible? How could there be such an alchemist master in Limestone City?” Qi Ying said in amazement.</p> <p>“Sh*t, if I knew who that old man was, I would kill him,” Man Tai said with an angry face. As the young master of the Barbarians, how could he not understand what great value Stabilizing Pills with markings and pill fragrances posed?</p> <p>“Damn it, it’s them!” Mo Feng’s face became a bit gloomy as he recalled what Ye Mo had said earlier.</p> <p>“You know him?”</p> <p>“I don’t, but he has already accepted Xiao Yue as his disciple. He is a powerful alchemist master.” Mo Feng said.</p> <p>“Even if he’s a powerful alchemist, I will still make him pay the price for this.” Man Tai smashed the table next to him.</p> <p>“It seems like the little guy actually asked his master for help. The master can even synthesize Stabilizing Pills with markings and pill fragrances. My Qi clan will, at all costs, invite this alchemist master to our side.” Qi Ying’s eyes lit up as she secretly made up her mind. She already had the answer in her heart to who the Azure Light Sword should belong to.</p>",
  "Chapter 28: Azure Light Sword": "<p>The presentation of the Azure Light Sword excited everyone. The cyan glow beamed from the sword and made the sword extremely attractive.</p> <p>Whether it was Ke Kuang and Ye Changsheng sitting in the VIP room, or the Qin father and son in the private room, all their hearts swelled with enthusiasm.</p> <p>If they were able to take this Azure Light Sword, it would definitely be an extra benefit for them during the Limestone Champion List competition. Not only did they desire a spot in the top five, but they also desired the glory of being in first place.</p> <p>The Azure Light Sword was the type of weapon most people were accustomed to using. Some families even had its techniques passed down from their ancestors.</p> <p>However, after Ye Mo took a look of the weapon, he immediately lost interest. He already knew the Formation-Breaking Spear technique. If he could be equipped with a high-grade spear instead of a sword, by using the spear technique, it would not only be instantly kill all of his opponents in the same realm, but also martial artists above his realm.</p> <p>On the other hand, Leng Leng and Xiao Yue’s eyes were flashing with enthusiasm. It was obvious that both the girls’ preferred weapon was the sword.</p> <p>“With this Azure Light Sword, my Ye clan’s Six Pillar Sword Style will be able to actualise its full potential,” Ye Kuang said loudly as he stared at the Azure Light Sword on the auction floor.</p> <p>The Six Pillar Sword Style was the Ye Clan’s most famous sword style of all. The six pillars combined into one while varying in different forms, launching offensive and violent attacks of great damage. The Ye Clan once had a powerful member who completely cultivated the Six Pillar Sword Style; a whole mountain was pierced through by his attacked. His technique posed incredible power.</p> <p>In the other VIP room, Man Tai did not look at the Azure Light Sword, but had his eyes always on Qi Ying.</p> <p>“Man Tai, are you not interested in the weapon at all?” Mo Feng felt that Man Tai had not even paid any attention to the Azure Light Sword, so he could not help but ask.</p> <p>“We Barbarians never use swords. Swords are for girls.”</p> <p>Barbarians are born with great strength, hence are all good at using axes, blades, and war-hammers, all large-sized weapons. The Barbarians were also natural-born weapon forgers, but they were only good at forging weapons like axes and blades.</p> <p>“Nevertheless, even my Barbarian race does not have that many high-grade magic weapons like this. Rest assured, as long as you eliminate Xiao Yue from the Limestone Champion List, I will pay for a half of the price of the sword,” Man Tai said.</p> <p>After hearing what Man Tai said, Mo Feng immediately smiled obediently and said, “Man Tai, I appreciate your confidence in me. Xiao Yue is only at the Spirit Cultivating Second Realm, and the beast she controls is only at the Third Realm. If I could be equipped with this weapon, I will easily defeat her.”</p> <p>Qi Ying looked at the noisy auction venue, waved her hand, and smiled, “The price of a mid-grade magic weapon is 100 purple gold pieces. Hence, a high-grade magic weapon will have the starting price of 500 purple gold pieces.”</p> <p>As soon as the starting price was stated, many members of minor families shouted out their bids.</p> <p>“600 purple gold pieces!”</p> <p>“700 purple gold pieces!”</p> <p>“800 purple gold pieces!”</p> <p>As Ye Mo heard the price rise, he could not help but shake his head. 800 purple gold pieces was definitely a price that was unthinkable for an average person. Even so, clan members still shouted such numbers for what Ye Mo thought as just a weapon.</p> <p>This was a world dominated by the strong. Next to power, wealth and beauty were not worth mentioning.</p> <p>When the price reached 1000 purple gold pieces, the noises at the present scene gradually weakened. Having said that, many at the venue knew this was just the beginning of the auction as the four major families still had not made their bids.</p> <p>“1100 purple gold pieces!” Ye Kuang said.</p> <p>“How pitiful it is to only bid 1100 purple gold pieces! 2000 purple gold pieces,” Man Tai said loudly.</p> <p>When this price was declared, many turned their attention to the VIP room where Man Tai and Mo Feng sat. 2000 purple gold pieces! Even the four major families could not raise such an amount of money.</p> <p>“Who is this guy?” Ye Kuang’s complexion changed slightly. 2000 purple gold pieces! The Ye Clan would not be able to gather that much money at once.</p> <p>At the same time, the Limestone City leader Qin Huang in the other room paled. That price was just crazy. In the whole of Limestone City, who else would be able to afford such a price?</p> <p>“Haha, are you seeing their surprised expressions? Even with the Qin, Ye, Xiao clans’ power, they do not dare to raise such a large sum of money. The Azure Light Sword is going to belong to us.”</p> <p>A large smile took up much of Mo Feng’s face. This Azure Light Sword’s cost would be split between the Mo family and the Barbarians, and all he had to do was stop Xiao Yue from entering top five in the Limestone Champion List competition. “We’ve struck an incredible deal.”</p> <p>“As long as I make my move, all the Ye or Qin clan members will have to stand aside,” Man Tai ​​laughed and said. The power of the Barbarians was beyond comparable to the small families of Limestone City.</p> <p>“Who is this, the man who bid 2000 purple gold pieces right away?” Ye Mo said with surprise.</p> <p>Xiao Yue’s brows knitted together as she pondered,””Just by the sound of his voice, it should be Man Tai, but the Barbarians do not even use swords. Why would he still want the weapon?”</p> <p>“Yue Yue, this dude already bid 2000 purple gold pieces. I reckon no one will dare to compete with him.”</p> <p>As the bid of 2000 purple gold pieces was announced, no one in any of the other clans said a single word. Ye Kuang and Qin Huang were both feeling somewhat gloomy, as the price of 2000 purple gold pieces clearly was not affordable for them.</p> <p>Qi Ying, who stood on the auction floor, was also a bit shocked. The price had far exceeded her expectations.</p> <p>“2000 purple gold pieces. Any more bids?”</p> <p>Everyone was speechless. Man Tai and Mo Feng both had smug smiles on their face, especially Mo Feng who, in his mind, was already imagining how he would use the Azure Light Sword to excel in the Limestone Champion List competition.</p> <p>“If no one is going to raise a higher bid, then I will…” Before Qi Ying could finish her sentence, a calm and old voice spoke u.</p> <p>“The old man bids 200 pieces of Stabilizing Pills.”</p> <p>Bidding 200 pieces of Stabilizing Pills? Everyone sitting around Ye Mo was stupefied. Was using Stabilizing Pills to raise a bid even permissible?</p> <p>Even if he was bidding with Stabilizing Pills, it would still not be enough. Although the price of Stabilizing Pills is much higher than that of the Rank Two Fortifying Pills, that would still be only equal one purple gold piece per pill. 200 pieces of Stabilizing Pills would only be worth 200 purple gold. Was this old guy confused?</p> <p>“Haha. Hey old guy, are you stupid?”</p> <p>“He wants to buy the Azure Light Sword with only a few Stabilizing Pills?” Mo Feng said with disdain.</p> <p>Hearing the sneers and laughter around him, Ye Mo coughed a few times and said, “Sorry, the old man did not make it clear just now. It is 200 Stabilizing Pills with markings and pill fragrances.”</p> <p>Ye Mo’s sentence set off a ruckus in the auction. Stabilizing Pills originally had the effect of assisting Energy Shaping Realm martial artists in their cultivation, but Stabilizing Pills with markings and pill fragrances would even strengthen those martial artists’ mortal gates and body, laying the foundation for an elevation to the True Energy Realm in the future.</p> <p>A Stabilizing Pill with markings and pill fragrances was definitely worth a high price!</p> <p>“How is this possible? How could there be such an alchemist master in Limestone City?” Qi Ying said in amazement.</p> <p>“Sh*t, if I knew who that old man was, I would kill him,” Man Tai said with an angry face. As the young master of the Barbarians, how could he not understand what great value Stabilizing Pills with markings and pill fragrances posed?</p> <p>“Damn it, it’s them!” Mo Feng’s face became a bit gloomy as he recalled what Ye Mo had said earlier.</p> <p>“You know him?”</p> <p>“I don’t, but he has already accepted Xiao Yue as his disciple. He is a powerful alchemist master.” Mo Feng said.</p> <p>“Even if he’s a powerful alchemist, I will still make him pay the price for this.” Man Tai smashed the table next to him.</p> <p>“It seems like the little guy actually asked his master for help. The master can even synthesize Stabilizing Pills with markings and pill fragrances. My Qi clan will, at all costs, invite this alchemist master to our side.” Qi Ying’s eyes lit up as she secretly made up her mind. She already had the answer in her heart to who the Azure Light Sword should belong to.</p>"
}