{
    "Chapter 1: The Betrayal of Human Beings": "[<p>In Eastern China’s Sea City…</p>, <p>Sea City used to be one of the economically developed cities which had huge populations. But at present, it had degraded into a wasteland of dilapidation, without a trace of human habitation, and only a swarm of slow-moving zombies lumbering through the city.</p>, <p>At the moment, a scene was at play inside a closed room of a building in this deserted city…</p>, <p>The room had no windows and only a door, which was locked as well. There was no furniture save for a bed. It used to be a secret resting room in the CEO’s office of a large company.</p>, <p>From the ought-to-be empty room came some small sounds which could cause faces to blush and hearts to beat faster. On the bed inside the room, an act of forced sex was happening. However, nobody could have imagined that the one suffering this unspeakable act was a man, lying on the bed and unable to move.</p>, <p>An hour later, a woman walked out of the room, her face filled with satisfaction. Although she wasn’t ugly, her makeup was too heavy. Her lips were red as blood, and her face was caked in a layer of white foundation. The thick eyeshadow had obscured the original shape of her eyes. Her thick, long eyelashes fluttered down, lightly covering her eyes.</p>, <p>She had a body that could make men obsessed and women jealous. She was tall, with curves in all the right places—fullness in the chest, a soft, wasp waist, with a gently rounded hip, underneath which was a pair of beautiful legs, which were straight, slim, and long.</p>, <p>There was an office space outside the room. The three people who had been keeping watch there all turned to look at the woman as she came out, hints of contempt hidden in their eyes.</p>, <p>“Time to go,” said the woman while beaming with satisfaction.</p>, <p>While speaking, she drew out a gun and walked out of the office ahead of the others. She kept her back warily against the wall while moving toward the stairs. The three didn’t say anything, just pulled out their own guns and followed her out. But behind her, they silently exchanged glances loaded with an intent to murder.</p>, <p>Back in the room with no windows, a man lay flat on the bed, unable to move. He had a very handsome face, though it was heavily flushed at that moment. His nose was straight, and his thin lips were pressed together into a straight line. His long and narrow eyes contained a strong murderous intent, and were turning red while staring at the ceiling. His face was twisted with a mixture of wrath and homicidal intent, and his teeth were clenched tightly.</p>, <p>If he had found Ling Ling’s location, how could he ever have just meekly let that woman do such a thing to him?</p>, <p>…</p>, <p>But before long, the woman, whose face was a mask of heavy makeup, was knocked unconscious and thrown into a swarm of zombies. The zombies slowly slunk toward her before pouncing, biting, and tearing.</p>, <p>She woke up with an excruciating, tearing pain, her screams splitting the air around her, “Ah! Ling Yong! Liu Hongshi! Liang Caiyan! You won’t get away! Ah… Ah… I’ll hunt you, and I’ll find you… even as a zombie! Ah… Hahaha… Do you think I wasn’t prepared for this? The little girl isn’t there… Ah…”</p>, <p>A twisted and savage smile appeared on her face while she was screaming. However, her heart-tearing screeches gradually faded, heard by nobody but the zombies.</p>, <p>However, just as she was about to be torn into pieces by the zombies, a strong wave of energy suddenly erupted from her brain, propelling the zombies away from her body.</p>, <p>After picking themselves up, all the zombies froze. They were confusedly rooted to their spots for a while before swaying away, and none of them noticed this ‘fresh food’ ever again.</p>, <p>…</p>, <p>A day later, a squad of soldiers showed up from the opposite direction and moved toward the other side of the city while firing their weapons at the zombies. This was the only path to be taken, with dense woods and parks on both sides. In this apocalyptic world, human beings would rather face zombies than the mutated creatures in those places.</p>, <p>For this reason, all wooded areas had slowly been designated as forbidden areas.</p>, <p>Lu Tianyu, who had been dead for a day, lay stiffly on the ground. She had this twisted expression in her face, as though she was still suffering the immense pain. Her body and limbs had become shreds of flesh and skin, barely recognizable as human.</p>, <p>Her body was besmeared with blood, though she fortunately hadn’t been completely torn into pieces. She lay silently on the ground with a ghastly pale face, her gray eyes staring at the sky.</p>, <p>Pale gray eyes… it was a characteristic of zombies.</p>, <p>Suddenly, these pale and lifeless eyes moved. A living person would be scared literally to death if they saw this, because this was the early sign of the transition from human to zombie.</p>, <p>Her eyes moved again… and again. All of a sudden, those pale gray eyes turned black. Not just the pupils, but even the whites of those eyes turned black in this instant. Slight changes had begun happening to her body in the meanwhile—her fingernails had started growing, turning sharp and hard, and she no longer smelled like something that had rotted.</p>, <p>She moved slightly, then stiffly sat up on the ground, looking around blankly. About ten seconds later, she tried to stand up, quickly realizing that her body seemed to be not so under control.</p>, <p>She tried for a few times, but couldn’t get up because her knees were stiff. She looked around for something to hold onto, but there was nothing nearby.</p>, <p>At last, Lin Qiao had no choice but to try bending her knees. She spent quite a while to finally struggle to her feet, but once upright, she discovered something even more terrifying.</p>, <p>She stared at her hands, stunned.</p>, <p>There were purple-black dried blood stains under her black and sharp nails. Her arms were filthy, and all the skin and flesh had been chewed up, with only the pale white bones remaining. The skin on the back of her hands was bluish pale, also stained with black dried blood.</p>, <p>Her entire body was stiff, and limbs were lacking coordination, so she felt off-balance.</p>, <p>She was dumbstruck as she stared at her hands and then her body. She closed her eyes, unable to believe what she was seeing. She then reopened her eyes but found no change in this ravaged body of hers, which was barely in human shape.</p>, <p>She raised her head and howled at the sky, ‘What the hell!’</p>, <p>However, all that came out of her mouth was “Roarrrrrrrrrr!”</p>, <p>Maybe her growl was too alien, that the zombies nearby who had been busily attacking the squad of human soldiers all halted simultaneously and then turned to look at her. The soldiers who had been defending against the zombies paused briefly as well, then like the zombies, turned to look at her.</p>, <p>Human beings— <em>This zombie’s voice is so weird?</em></p>, <p>Zombies— <em>What is this zombie shouting about?</em></p>, <p>But soon, these human beings and zombies had forgotten about this weird zombie and continued fighting.</p>, <p>Lin Qiao looked at her hollowed stomach, dumbfounded.</p>, <p>Damn it! What the hell was this? Who could tell her what on earth had happened? Was she dreaming?</p>, <p>She raised her head and looked around, abruptly seeing two groups of people not far away. <em>‘Why does the outermost group look so much like the zombies from the movies?’ </em>She wondered.</p>, <p>She looked around, and what came into her vision were the ruins of war. She saw dilapidated buildings and completely broken windows, with nothing left in the window frames. The scenes by the road were just as dismaying, and the traffic was paralyzed, and broken cars were abandoned either by the side of the road or right in the middle. Some of the streetlights had tilted, and some had fallen to the ground. Rubble and dust were scattered all around, and the looks of the trees had become fairly strange as well.</p>]",
    "Chapter 2: Came Back to Life as A Zombie": "[<p>Chapter 2 – Resurrected As A Zombie</p>, <p>This strange environment made Lin Qiao feel out of her wits. She looked around in confusion while weighing this new reality. She must be dreaming! She must definitely be dreaming!</p>, <p>She looked down at her stomach once again.</p>, <p>Her stomach had been ripped from her body, so why was she still conscious? And, what was that strange sound she just made?</p>, <p>She felt that she might be going crazy. She seemed to remember merely having a fever and taking some medicine, then falling asleep. So, how come the world had become like this by the time she woke up?</p>, <p><em>‘Yes, I must be dreaming! I am dreaming! I am dreaming!’</em></p>, <p>Lin Qiao repeated this in a bid to convince herself. She had fallen asleep after taking the medicine, and probably just hadn’t woken up yet.</p>, <p>Otherwise, how could she feel nothing while her body was in this state?</p>, <p>Before she could figure out anything, she suddenly sensed a dull ache in her brain. Strange memories that didn’t belong to her randomly flooded her mind, and the dull ache instantly augmented into a swelling pain that threatened to burst her head open. Her face immediately twisted in agony, then she opened her mouth wide and gave a shout.</p>, <p>“Roarrrr!”</p>, <p>With that, her body toppled sideways and fell to the ground.</p>, <p>Within the memories, she saw an ordinary but adorable girl growing from a chubby toddler into a beautiful young lady. Every scene of the growing girl’s life, from primary school to middle school, and then to college, scrolled through Lin Qiao’s mind. This girl’s name was Lu Tianyu. She had been admitted to her dream college, and it should have been so wonderful. However, on her first day of college, the world suddenly changed.</p>, <p>In the classroom, all the new students were looking curiously at each other while introducing themselves one after another. However, things started going wrong when it was the turn of a girl who had been lying motionlessly on her desk.</p>, <p>No matter how loudly the other students called her, the girl wouldn’t wake up. Someone even pushed her, yet she still would not wake. The teacher had no other choice but to ask two male students to help her to the infirmary. However, right at the time when the two male students reached the door of the classroom with this unconscious girl, she suddenly opened her eyes.</p>, <p>Furthermore, those eyes were pale gray in color. She didn’t say a word after opening her eyes, but abruptly turned her head two seconds later and opened her mouth wide. Baring her teeth, she bit the neck of one of the two male students who had been holding her.</p>, <p>Shrill screams spread throughout the entire building,</p>, <p>The others hurriedly pulled the male student away from the girl, but he had already fainted. On the other side, the girl who bit him had become so incredibly strong that even a couple of male students couldn’t hold her down. They just helplessly watched her hurt some other students by biting and scratching them.</p>, <p>The same thing began happening throughout the city, attracting the attention of the government and local police. On that day, all available police and military forces were called out to deal with these strange and frightening events.</p>, <p>That night, a strange hush blanketed the world, and the people woke up the next morning to find their world destroyed.</p>, <p>Only thirty percent of all human beings in the world woke up as themselves, while the remaining seventy percent had all turned into slow-moving zombies with no real consciousness, just the insanely strong desire to eat human beings!</p>, <p>In fact, these memories were utterly disordered, but Lin Qiao slowly managed to put all the pieces together. Even though many parts were missing, she was still able to confirm one thing…</p>, <p>These memories all belonged to somebody else!</p>, <p>From the memories of this girl called Lu Tianyu, Lin Qiao learned another fact-since the apocalyptic era started, five years had passed!</p>, <p>The apocalyptic era began just the day after she took the medicine the last time for her fever and fell asleep.The next morning, many people woke up as senseless zombies that could do nothing but bite every living person they saw. Of course, many others woke up as normal people. And, there were still others who looked normal in appearance, but their physical quality had been drastically changed.</p>, <p>The last type of people were the ones who triggered their superpowers soon after.</p>, <p>By now, Lu Tianyu was twenty-three years old.</p>, <p>In Lu Tianyu’s memories, she did not wake up in the apocalyptic world as a zombie or with a triggered superpower, but as an ordinary person.</p>, <p>In this war-ridden and chaotic apocalyptic world, she was completely defenseless.</p>, <p>Therefore, she had to bargain for survival with her body and clever schemes. Luckily, she had a beautiful face. In the apocalyptic world, the number of women had dropped so dramatically that ninety percent of the people in a base were men, while only ten percent were women. Women had become like rare animals, so she was quite popular being a beautiful woman.</p>, <p>She had been good at scheming ever since she was a child. She framed people and played all kinds of dirty tricks just to survive in this dangerous, chaotic world.</p>, <p>It was strange that Lin Qiao recalled many of Lu Tianyu’s memories, but not all of them. She felt that there were still a lot of things that she hadn’t recollected yet. For example, she couldn’t see anything that Lu Tianyu had done recently.</p>, <p>Twenty years of strange memories filled her mind. Lin Qiao was a little confused, so much so that she nearly lost herself and forgot who she was. Was she Lin Qiao? Was she Lu Tianyu?</p>, <p>Fortunately, while she was gripped by an awful headache, a coolness spread through her brain, triggering her own memories and stopping her from becoming Lu Tianyu fully.</p>, <p>She touched her body and found that her clothes barely covered her body. She lowered her head and looked down at her hollowed stomach, as well as her zombie-eaten breasts.</p>, <p>Lin Qiao wanted to cry, but no tears would come out. She had confirmed one thing—she had become someone else because she had returned from death in someone else’s body! She wondered if her own body had woken up in that world-ending morning like the others. Or perhaps it had become a female zombie who knew nothing except biting every human being it saw!</p>, <p><em>‘Damn it! Even a rebirth should at least put me into a living person’s body! It could be male or female, old or young! What does this broken zombie body mean? Even if I have to live in a zombie body, I should at least have one that is whole!’ </em>She screamed in her heart.</p>, <p>Depressed, Lin Qiao raised her head and roared, “Roarrrrrrr!”</p>, <p>The zombies around her seemed to sense her discontentment, as they all quieted down suddenly. Then, something weird happened—all of the zombies around her slowly moved away from her, and an area was soon vacated around her.</p>, <p>Lin Qiao lay on the ground, looking around with a strong and strange sensation lingering in her mind.</p>, <p>From Lu Tianyu’s memories, she learned about the changes and developments of the apocalyptic world, and some things that Lu Tianyu had done after the old world ended. Although these memories were incomplete, they were enough for Lin Qiao to learn that Lu Tianyu was the most disgusting and despicable woman in the entire base. She traded for precious resources in the beds of different men, and evilly caused the deaths of many innocent people. However, beautiful women were even more popular in an apocalyptic world like this than they used to be in the old world.</p>, <p>Five years… five whole years had passed. All the people in the base had known that Lu Tianyu was an evil, calculative, and sl*tty woman.</p>, <p>However, Lin Qiao couldn’t understand why she hadn’t woken up that morning when the old world ended instead of five years later. Why did it take her five years?</p>, <p>What about her family? Her comrades? Were they still alive?</p>, <p>No, she couldn’t be like this! She needed to find her mother, brother, sister-in-law, sister, and others! She needed to know how they had been all this while, and whether they had turned into zombies or superpowered ones!</p>]"
  }