{
  "Chapter 1: A Love That Couldn’t Be Touched": "<p>Although it was the start of autumn, the city of Haicheng rained heavily for a few continuous days, causing the whole city to be enveloped in mist and the air to be especially humid and cold.</p> <p>Once she exited the cafe, Lin Nuan felt the chill in the air.</p> <p>“Lin Nuan?!”</p> <p>Gu Hanyan rushed out of the cafe and grabbed Lin Nuan who was holding up an umbrella. She yelled in her shrill voice, “The four years when Moshen went missing, his inheritance rights, company shares, and even the car and house under his name were taken away by his younger brother, Wen Moshi!”</p> <p>Lin Nuan’s back froze slightly.</p> <p>“The only thing I can save for Wen Moshen now is myself! I don’t want to see the day Moshen returns only to find that he has nothing left…”</p> <p>Lin Nuan felt a blow to her heart, bringing her deep pain—</p> <p>Wen Moshen was a love that couldn’t be touched, hidden at the bottom of Lin Nuan’s heart.</p> <p>Gu Hanyan stood unprotected from the rain, while Lin Nuan stayed under the shadows of her umbrella; the two were at a stalemate.</p> <p>Lin Nuan pulled back her wrist from the other’s grip, took out a large black coat from her shoulder bag and wrapped it around herself to draw away some of the chill seeping into her bones.</p> <p>“You can force me now only because… because I love Wen Moshen, but if he returns one day and finds out the truth, I will surely become an irremovable thorn wedged between the two of you. Gu Hanyan… do you dare to take that chance?”</p> <p>Gu Hanyan’s lips trembled as she wanted to reply yes, but she was afraid that answering without hesitation would cause her love to sound shallow. As she wavered, her almond-shaped eyes turned red and a teary mist covered them, making her seem all the more delicate and pitiful in the rain.</p> <p>Lin Nuan’s fair, slim fingers gripped tightly onto the umbrella, her knuckles turning white. Her gaze was clean and calm as she waited for Gu Hanyan’s reply.</p> <p>Gu Hanyan said nothing for a long time; Lin Nuan turned to leave, yet when her gaze fell on the other side of the road… on the tall brooding man standing beside the Bentley, she paused in surprise.</p> <p>The black car was parked right underneath the streetlight. The orange light scattered amongst the raindrops to create a soft, misty halo that landed on the man’s broad shoulders, outlining his tough facial features.</p> <p>A man with such outstanding looks and a strong stable aura would shine wherever he was, to the point where he was impossible to ignore…</p> <p>It was Fu Huai’an!</p> <p>She didn’t know why, but seeing Fu Huai’an at that moment, Lin Nuan actually felt a trace of guilt pushing her to feel insecure.</p> <p>Even though she hadn’t yet decided on whether to help Gu Hanyan, even though she hadn’t done anything yet, she started panicking once she saw Fu Huai’an.</p> <p>A gust of wind mixed with raindrops blew over, chilling Lin Nuan’s entire body almost instantly.</p> <p>Lin Nuan clenched her fist around the umbrella tightly, frozen as she watched the man opposite her. She desperately wanted to tear her uneasy gaze away from him, but her body was as still as a statue and she was unable to move.</p> <p>A middle-aged man had walked out together with Fu Huai’an from the Fragrance Residences… Seeing that Fu Huai’an had a cigarette between his fingers, he tried buttering up to him by holding up a lighter with both hands, wanting to light the cigarette for Fu Huai’an.</p> <p>Fu Huai’an’s hair and stiff suit were slightly wet from the rain, and he had one hand in his pocket. It was a pose that made him seem superior to others, his pride showing through his expression along with an aura of nobility.</p> <p>Accompanying Fu Huai’an was his good friend Lu Jinnan who, the moment after he exited the Fragrance Residences, noticed Lin Nuan on the other side of the road. He raised a brow in surprise and adjusted his collar, his uplifted eyes narrowing by half as he walked towards Fu Huai’an.</p> <p>“President Wang, do you mind helping me go to the convenience store on the other side of the road to buy a pack of cigarettes?”</p> <p>Lu Jinnan spoke with a casual tone, and the middle-aged man standing beside Fu Huai’an nodded his head continuously, agreeing without hesitation. “No problem, President Lu!”</p> <p>“Thanks!” Lu Jinnan said, without any sincerity.</p> <p>Watching the chubby President Wang jog off, Fu Huai’an calmly extinguished the cigarette in his hand.</p> <p>It was a high-end brand cigarette that someone gave him earlier during the meal, not the brand he was used to smoking.</p> <p>Lu Jinnan took out a box of cigarettes from his pocket and passed one cigarette to Fu Huai’an, biting onto another as he said, “Old Fu, your moonlight <sup>1</sup> is right there across the road.”</p> <p>Fu Huai’an paused in the middle of lighting up his cigarette and looked at Lu Jinnan with a deep and heavy gaze.</p> <p>Lu Jinnan bit onto his cigarette and stuck both of his hands into his pockets, jerking his chin in Lin Nuan’s direction and said, “I’m not kidding you, she’s over there with your fiancée, Gu Hanyan…”</p> <p>The cigarette was lit, white smoke rising up from the corner of his lips as Fu Huai’an put away his lighter; his deep and unreadable eyes looked towards the opposite side of the road, quickly spotting the woman watching him.</p> <p>Just one gaze was enough for the tight strand in Lin Nuan’s heart to break—she thought of Gu Hanyan’s earlier words while they were inside the cafe, and her sweaty palms tightened their grip on her umbrella guiltily.</p> <p>The heavy white smoke blurred Fu Huai’an’s cold and sharp face, yet Lin Nuan still felt a strong and heavy pressure closing in on her, causing her to panic.</p>",
  "Chapter 2: Is It Necessary for You to Plan Such a Huge Trap?": "<p>Lu Jinnan bit onto the cigarette butt, his gaze fearlessly sizing up Lin Nuan across the road and said, “Women—just give them a car, some flowers, a bag, and a card, and it’s pretty easy to coax them into bed. Is it necessary for you to plan such a huge trap?”</p> <p>“She’s different from those women of yours,” Fu Huai’an’s deep voice replied calmly, a smile ghosting the corner of his lips in between the puffs of white cigarette smoke.</p> <p>“She’s indeed different. I investigated that Lin Nuan before; a flower at the radio station that no one has ever managed to tarnish. She’s really hard to obtain, too smart, and quite good at faking it.” Lu Jinnan spoke with a sour tone, “So you like the kind that’s harder to get?</p> <p>Or… do you like it when women who are harder to obtain submit themselves to you?”</p> <p>Fu Huai’an pressed the area between his brows with the hand holding the cigarette. He remained silent, and the look in his eyes seemed distant and fathomless.</p> <p>A car drove over—Lin Nuan ignored the puddles of water on the road and left the pavement, reaching her hand out to stop the car…</p> <p>“Lin Nuan?!”</p> <p>Gu Hanyan called her name, but Lin Nuan didn’t look back.</p> <p>A mixture of mud and ice-cold water soaked Lin Nuan’s white sports shoes, but she didn’t even notice it. She was anxious to escape a place so close to Fu Huai’an. It was only after entering the cab and the warm air hit her that she realized her feet were freezing.</p> <p>…</p> <p>Lin Nuan held her umbrella and stood in front of Fu Huai’an’s villa, hesitating.</p> <p>Because of Gu Hanyan’s last words, once Lin Nuan reached her house, she again gave the cab driver Fu Huai’an’s address.</p> <p>She was afraid that after tonight, she would lose the courage to come and find Fu Huai’an.</p> <p>“Miss Lin…”</p> <p>Upon hearing a voice, Lin Nuan raised her head and saw that Fu Huai’an’s housekeeper had already opened the door to the house. She jogged over to Lin Nuan while carrying an umbrella.</p> <p>Lin Nuan had once sent Fu Huai’an’s son back home, thus his housekeeper had seen her before and recognized her.</p> <p>The warm light inside the house shone out from the door, making individual raindrops clear and distinct…</p> <p>“I saw someone was standing outside without moving for such a long time so I came out to take a look. I didn’t think that it would be Miss Lin!” Auntie Li gave a friendly smile to Lin Nuan. “Is Miss Lin here today to see Tuan Tuan? Tuan Tuan misses you and talks about you every day. He keeps saying that Miss Lin promised to come visit him.”</p> <p>The sound of the heavy rain hitting the umbrella couldn’t drown out Auntie Li’s happy voice…</p> <p>She quickly invited Lin Nuan into the house, saying, “It’s pouring outside right now! Quickly enter the house, Miss Lin.”</p> <p>“Is Mr. Fu back?” When Lin Nuan asked the question, her grip on the umbrella subconsciously tightened and her heart felt unavoidably anxious.</p> <p>Lin Nuan’s voice was very small and almost couldn’t be heard. Auntie Li took a while to process the question before she reacted and smiled, replying, “Sir is not back yet…”</p> <p>A car’s bright headlights shone over and Lin Nuan immediately froze in her steps.</p> <p>Inside the car, Fu Huai’an’s assistant saw the car light hitting Lin Nuan, whose pants were already half-drenched. She was standing together with Auntie Li with a slightly pale face. The assistant looked at Fu Huai’an through the rearview mirror, saying, “Boss, it’s Miss Lin…”</p> <p>Fu Huai’an had lowered his head, his deep eyes focused on his phone’s screen. The light from the screen outlined Fu Huai’an’s cold features, emotionless without a hint of warmth…</p> <p>Fu Huai’an looked up, and indeed it was Lin Nuan…</p> <p>Lin Nuan raised her hand to block the car’s overly bright light, her heartbeat increasing.</p> <p>The car came to a stop and Fu Huai’an’s assistant exited the car and greeted Lin Nuan briefly before jogging over to the other side of the vehicle. He held an umbrella to escort Fu Huai’an outside.</p> <p>Fu Huai’an stepped out of the car, his suit still immaculate—even his leather shoes were clean and had only a few rainwater droplets on them. It was a sharp contrast compared to Lin Nuan’s disheveled look.</p> <p>Lin Nuan subconsciously straightened her back.</p> <p>“Sir is back…” Auntie Li smiled and spoke in a happy tone.</p> <p>“It’s raining too hard, you should go in first,” Fu Huai’an said to Lin Nuan in a low voice.</p> <p>Lin Nuan followed after Fu Huai’an and entered the house. Auntie Li drew a bath for her, finding her some clean clothes.</p> <p>“Miss Lin, since the rain is too heavy and Jing’er road has been flooded, you definitely won’t be able to go home tonight. Sir said to let you rest for here for the night, and you can leave tomorrow.” Auntie Li passed a clean set of clothes to Lin Nuan, “This is a new set of pajamas Sir just bought yesterday; it’s washed and unworn. Your clothes are all soaked, so please make do with this for now. Dinner is already prepared so you can come down and eat after you’re done bathing.””</p> <p>“Thank you…” Lin Nuan took the pajamas.</p> <p>Lin Nuan took a hot bath in the bathroom of the guest room, feeling much better afterward.</p>",
  "Chapter 3: Jealousy With a Hidden Motive": "<p>She sat on the edge of the bed and wiped her hair dry, pondering how to talk to Fu Huai’an about Gu Hanyan. She actually wasn’t very familiar with him.</p> <p>Requesting him to cancel his engagement sounded ridiculous no matter how she thought about it. It might even make people think that she was being jealous and had a hidden motive.</p> <p>Lin Nuan wiped her hair with frustration.</p> <p>When Lin Nuan went to find Fu Huai’an, he had already finished his dinner and was heading upstairs.</p> <p>The two met at the narrow top of the staircase on the second floor. Lin Nuan didn’t give herself the chance to retreat; she opened her mouth and said with a clear voice, “Mr. Fu, I came with a request.”</p> <p>Fu Huai’an, one hand holding a cup of coffee and the other in his pocket, walked up the last step, his tall figure standing against the light. Lin Nuan was completely covered by his shadow. The great sense of pressure made Lin Nuan hold on tightly to the corner of her shirt, her brows furrowed as she straightened her back, subconsciously not wanting to show any cowardice.</p> <p>Their gazes met—Fu Huai’an’s eyes were peaceful and deep, as though he could easily see through other people’s hearts.</p> <p>Lin Nuan’s intuition told her that Fu Huai’an preferred those who went straight to the point. If she tried to play tricks in front of him and talked in a roundabout way, she would surely be exposed.</p> <p>Fu Huai’an didn’t push her—he patiently waited for Lin Nuan to speak…</p> <p>Taking in a deep breath, she threw away the speech she’d prepared in her mind and simplified her words, saying, “Mr. Fu, perhaps you don’t know, but Gu Hanyan was once Wen Moshen’s fiancée, and up until now she is still waiting for Wen Moshen to return.”</p> <p>Fu Huai’an’s pure black eyes caused Lin Nuan to panic in her heart; she was afraid Fu Huai’an would think she had bad intentions.</p> <p>Lin Nuan had just finished bathing, and her slightly curled hair fell loose at her waist. Seeing that Fu Huai’an was watching her with a heavy gaze, she tucked her long hair behind her ear to cover up her embarrassment.</p> <p>“As the saying goes, gentlemen do not snatch what others love, nor will they push others into a difficult corner. Mr. Fu, you’re a gentleman. Even if you wish to get engaged, you should have asked the lady about her feelings instead of deciding it with her family. After all, this is no longer the era of arranged marriages.”</p> <p>Lin Nuan spoke respectfully in a soft, yet firm, tone. Her words were direct with no embellishments. Even as she praised Fu Huai’an as a gentleman, it was merely to flatter him and emphasize his position as a man of character.</p> <p>Fu Huai’an looked at Lin Nuan without much emotion. His cold, thin lips were pursed, and he ignored her words, saying, “I lack a woman, Tuan Tuan lacks a mother, I don’t care who Gu Hanyan’s heart belongs to.”</p> <p>Lin Nuan suddenly remembered the little boy who looked at her with his big wet eyes as he shyly called her ‘Mother’.</p> <p>Her palms were covered in a thin layer of sweat, and her heart skipped a beat for a moment; she actually felt that Fu Huai’an’s words were a hint towards her.</p> <p>Distracted, Lin Nuan watched as Fu Huai’an brushed past her shoulder.</p> <p>Inside the bedroom, Fu Huai’an lit up a cigarette and casually threw his customized lighter onto the coffee table.</p> <p>Thud thud thud—</p> <p>Hearing the knocking on his door, Fu Huai’an picked up his cup of coffee with the same hand holding his cigarette, his deep gaze looking up in the direction of the door. He stayed silent.</p> <p>The results came faster than Fu Huai’an predicted.</p> <p>Thud thud thud—</p> <p>The knocking sound started up once more. Fu Huai’an’s long fingers ran along the rim of the cup, and he let out a low hum before he spoke up in a relaxed tone, “Enter…”</p> <p>Fu Huai’an’s deep voice traveled beyond the door, and Lin Nuan’s heart clenched for a split second. Confusion and cowardice almost clouded her heart, but at the thought of Wen Moshen… His name was like a talisman, deflecting away her hesitation.</p> <p>Lin Nuan grabbed the door handle, turned it and entered the room.</p> <p>Fu Huai’an sat on the couch lazily, a document lying on his casually crossed legs.</p> <p>When Lin Nuan entered, Fu Huai’an was placing down the coffee in his hands, flipping onto the next page of the document with a cigarette in his mouth.</p> <p>She closed the door, her expression reflecting the desire to seek death.</p> <p>“Any problems?” Fu Huai’an didn’t turn his head; he calmly asked the question while biting onto his cigarette.</p> <p>In the room filled with cigarette smoke, Fu Huai’an’s expression was slightly obscured.</p> <p>“Mr. Fu, you said you need a woman, and Tuan Tuan needs a mother. I think that no matter if it’s being Tuan Tuan’s mother or being your woman, maybe I’m much more suitable than Gu Hanyan!” The rims of Lin Nuan’s eyes were red, and her tone was unfriendly. “You’re waiting for me to say this, right?”</p> <p>Fu Huai’an stayed silent, his eyelids slightly closed. Through the white smoke, his strong facial features were blurred.</p> <p>If Fu Huai’an didn’t like Gu Hanyan, then Lin Nuan’s outstanding looks could easily gain favor from men. On the matter of being Tuan Tuan’s mother, Tuan Tuan had already taken Lin Nuan as his mother, hadn’t he?</p> <p>Lin Nuan wasn’t dumb to the point that she couldn’t get Lin Huai’an’s hint.</p> <p>Even though Lin Nuan had already decided on this plan beforehand, but after hearing Fu Huai’an’s hint, her heart was filled with indignation and anger.</p>",
  "Chapter 4: You Must Let Me See Your Sincerity": "<p>Her back was leaning firmly against the door, like a small kitten that was angered but had no choice except to resist getting angry.</p> <p>Underneath his thick brows, Fu Huai’an’s eyes narrowed slightly. His Adam’s apple moved imperceptibly as he slowly tapped away the cigarette ashes and said, “From how Tuan Tuan calls you Mom, you’re indeed more suitable than Gu Hanyan. Miss Lin may be pretty, and I also like Miss Lin, but it’s not necessary for this position to be filled by Miss Lin. If Miss Lin is unwilling, no one will force you. You should return to your room, get some rest, and pretend none of this happened.”</p> <p>Lin Nuan’s ears heated up, internally labeling Fu Huai’an as a beast dressed up as a human. He had made things clear, making her angry and embarrassed.</p> <p>Lin Nuan stood for a while instead of leaving, so Fu Huai’an patted the space beside him, motioning for Lin Nuan to sit there.</p> <p>Lin Nuan didn’t move. Fu Huai’an’s deep gaze focused on her, reading the emotions in her eyes that she couldn’t quite hide. It made her remember her purpose in coming here, so she could only adjust her feelings and walked towards him.</p> <p>At the age of 25, when she started heading towards her 30s, Lin Nuan knew she would be responsible for her own actions.</p> <p>Since walking out of the guest room, walking into the door, saying all those words, Lin Nuan knew she had two choices: either she kept her pride and walked out , or she let go of her dignity and stayed to plead, letting Fu Huai’an get what he wanted</p> <p>They were both adults. Despite being a virgin, Lin Nuan knew that when a man and a woman were together alone in a bedroom—and in the middle of the night—it all brought to mind inappropriate images.</p> <p>Lin Nuan wore a set of men’s pajamas that had a too-wide collar. Her fair and slender neck, her prominent collarbones, were all completely exposed, giving a sensual impression.</p> <p>Her skin was too fair. At the moment, her slightly pinkish skin and reddened eyes were enough for anyone to know her internal struggle.</p> <p>Fu Huai’an was exceptionally patient today—he watched Lin Nuan without any anxiety.</p> <p>Lin Nuan was having an internal war.</p> <p>Ultimately, her dignity was defeated by Gu Hanyan’s words—she didn’t want Wen Moshen to return only to find out that he had nothing left.</p> <p>Lin Nuan clenched her fists and stood firm beside the coffee table instead of sitting next to Fu Huai’an on the couch like he asked….</p> <p>Lin Nuan herself, was a proud and reserved lady.</p> <p>Going to find Fu Huai’an was a kind of submission that went against her heart, and was already challenging her limits.</p> <p>“Lin Nuan, we’re both adults. Since you chose not to leave but walked over here instead… We both know what that means, so you should show me your sincerity instead of acting like I’ve wronged you…” Fu Huai’an’s voice was still deep and calm.</p> <p>Sincerity…</p> <p>Lin Nuan understood what Fu Huai’an meant by sincerity, and her face burned furiously.</p> <p>As though she’d used up all of the courage in her life, Lin Nuan walked closer to Fu Huai’an and sat down beside him…</p> <p>In between her breaths, all she could smell was Fu Huai’an’s masculine scent mixed with the smell of cigarettes. His presence was steady and calm, filled with a strong sense of pressure.</p> <p>The term cautious was definitely accurate when describing the present Lin Nuan.</p> <p>She lowered her eyes. Even though she clearly made a move to get closer, her body maintained a distance from Fu Huai’an, trying hard to make herself look natural.</p> <p>Fu Huai’an removed the sizzling cigarette from his mouth and held it in his hand. He placed his hand on the couch behind Lin Nuan while his body tilted towards her.</p> <p>The fresh smell of the man’s soap mixed with the scent of cigarettes infiltrated Lin Nuan’s nose, the heavy masculine fragrance made Lin Nuan nervous.</p> <p>Fu Huai’an was very close to Lin Nuan—his increasingly heavy breaths caused Lin Nuan to panic, and her heart thundered against her chest.</p> <p>“Didn’t wear your bra… Mm?</p> <p>Fu Huai’an cocked a brow, his intense gaze was searing. His thick and deep voice that was slightly hoarse sounded sensual and pleasing to the ear, but the contents of his words turned Lin Nuan into an embarrassed mess.</p> <p>Lin Nuan flushed from head to toe. Yes… she didn’t wear it.</p> <p>Because she understood Fu Huai’an’s hint, she came up with the idea of unwillingly giving up her own body, taking the choice to retreat out of her hands.</p> <p>A woman wearing a man’s pajamas, bare inside and sitting on his couch—Fu Huai’an should understand the ‘sincerity’.</p> <p>She was so embarrassed she couldn’t face Fu Huai’an’s deep gaze. When she felt his breaths coming nearer, she nervously gripped a corner of her shirt with reddened eyes.</p> <p>“Lin Nuan…” Fu Huai’an’s lips sensually grazed her ears, and Lin Nuan immediately felt a tingle rush down her spine, her body tightening up as her ears became flushed.</p>",
  "Chapter 5: First Kiss?": "<p>Fu Huai’an softly called her name; Lin Nuan avoided Fu Huai’an’s mischievous lips at her ear to look up at him.</p> <p>His breath drew closer, mixed with the scent of minty cigarettes. Lin Nuan instinctively held her breath and turned her head away, exposing her fair neck.</p> <p>Their lips brushed against each other but did not kiss.</p> <p>Lin Nuan’s eyes turned red—she was so embarrassed she wanted to cry.</p> <p>How had she gotten herself into such a position, where she could only let others do whatever they wanted to her?</p> <p>“Lin Nuan, it’s not my thing to force women. If you feel mistreated, you can return to the guest room…”</p> <p>Fu Huai’an was in more control of his lust compared to a young lady like Lin Nuan. As he spoke, he removed his hand that was still holding the cigarette from behind her, recovering his image as a proper gentleman.</p> <p>Lin Nuan loosened her grip on the corner of her shirt, her heart feeling relieved yet disappointed at the same time.</p> <p>Since she wanted to give up her body, why must she still feel wronged and act like the kind of woman who would choose suicide over losing their virginity? Lin Nuan felt disdain for herself.</p> <p>Fu Huai’an seemed to have let the matter rest. Lin Nuan warned herself that at that point, she should let go of her dignity and take the initiative.</p> <p>She couldn’t do anything else, but she had enough courage to kiss Fu Huai’an of her own accord..</p> <p>Her small hands clenched into fists, and she turned her head sideways to look into Fu Huai’an’s eyes. With a brave expression, she placed her arms around Fu Huai’an’s neck and gently kissed the corner of his lips.</p> <p>Fu Huai’an remained as still as a mountain.</p> <p>He wasn’t anxious—he’d always had plenty of patience towards Lin Nuan.</p> <p>Lin Nuan thought that Fu Huai’an was keeping his distance from her because of the unwillingness on her face.</p> <p>But Lin Nuan was unable to go further…</p> <p>Lin Nuan was a conservative woman. At her age, there had been many who wooed her, yet she had never dated anyone.</p> <p>In the Lin family, Lin Nuan had a fiancé, but the number of times they’d eaten a meal together in one year could easily be counted with her fingers. Even if they stayed together, it was merely out of obligation for their families.</p> <p>Intimacy was something they never had.</p> <p>Thus, even if Lin Nuan rehearsed it to perfection inside her heart, she was still helpless when it came to the “actual war” that relied purely on her taking the initiative. Her stiff muscles quickly started to ache.</p> <p>“Does kissing count as taking the initiative?” Lin Nuan asked.</p> <p>Her sweaty fists tightened. Seeing no reply from Fu Huai’an, she started to think about retreating.</p> <p>“Since you love Wen Moshen, why are you choosing to climb into my bed?”</p> <p>Upon hearing these words, Lin Nuan raised her eyes…</p> <p>Their gazes met; Fu Huai’an’s deep eyes were calm.</p> <p>Nothing could be hidden from Fu Huai’an’s gaze. Based on how perceptive he was, when she asked him to break off his engagement to Gu Hanyan, Fu Huai’an must have already known that she loved Wen Moshen.</p> <p>After laying it out so clearly, her feelings of being wronged became embarrassment from being exposed, and she said, “Because I can’t watch Wen Moshen’s woman get engaged to you.”</p> <p>“Sacrificing yourself for love?” Holding his cigarette in his mouth, Fu Huai’an crossed his long legs. Through the light smoke, he narrowed his eyes… He looked at Lin Nuan’s slender arms wrapped around his neck and felt slightly touched—to think that she could love someone to such an extent…</p> <p>Lin Nuan didn’t want to think of that dirty trade as something great. She despised it from the bottom of her heart, believing that there should be no mention of love in the matter because it only stained its meaning.</p> <p>“You call that a kiss?</p> <p>With the cigarette in his mouth, Fu Huai’an’s words sounded slightly unintelligible.</p> <p>Lin Nuan’s face flushed red; she had never kissed anyone before…</p> <p>It was as though Fu Huai’an could read minds—he immediately understood Lin Nuan’s thoughts and asked, “First kiss?”</p> <p>Lin Nuan’s palms hurt from how hard she was clenching her fists, and she straightened her neck to look at him. She stubbornly refused to admit her loss and looked like a little lady complaining about being bullied by the fake gentleman Fu Huai’an.</p> <p>She was the one with the request, so she put away her thorns, but she still unintentionally pricked others.</p> <p>“Truly a clean woman!” Fu Huai’an let out a puff of thin smoke and casually extinguished the cigarette. He gently rubbed his thumb that smelled of cigarettes against the corner of Lin Nuan’s lips. His Adam’s apple bobbed slightly, deep voice sounding especially sexy, as he said, “Let me teach you what it means to kiss.”</p> <p>The man’s tall and broad figure leaned over with a burning heat, his strong scent and aura infiltrating Lin Nuan’s heart and making her whole body tremble.</p>",
  "Chapter 6: He Calmly Accepts": "<p>Fu Huai’an held the back of Lin Nuan’s head with one hand, his warm lips pressing down. With a gentle kiss, he slowly pried open her lips and their soft tongues mingled together, sharing a light and minty cigarette smell…</p> <p>Lin Nuan’s breath was snatched away by the man, and her face flushed.</p> <p>As she felt nervous, Lin Nuan’s senses had become extremely sensitive—that kind of fluid exchange made her anxious to the point she felt her scalp turning numb.</p> <p>His aggressive breathing attacked Lin Nuan, making her panic.</p> <p>Her mind was all jumbled up, and her heart violently beat against her chest.</p> <p>Fu Huai’an’s kiss pushed an unfamiliar tingle up Lin Nuan’s stiff spine, making her uneasy and even causing her to feel fear…</p> <p>Before she came into the room, she’d thought it would be a battle where she would welcome her death, but her body was like putty in Fu Huai’an’s embrace. She had no way of rivaling Fu Huai’an’s experienced ways—she was clearly surrendering before the fight even started.</p> <p>Fu Huai’an’s partially-closed eyes took in the sight of Lin Nuan’s red face… Her eyes were unfocused as his large hands stroked the beautiful curve of her back. He pulled her closer to him, the softness under his touch filling him with desire.</p> <p>She had always been the woman Fu Huai’an wanted. She was helplessly pliant for him and unable to resist whatever he wished to do—how could he not be stirred up?</p> <p>Lin Nuan’s heart retained a sliver of consciousness as she struggled to resist, her small hands pressing onto Fu Huai’an’s chest. Under her palms, she felt Fu Huai’an’s skin, burning at a high temperature.</p> <p>The force behind Lin Nuan’s push was weak, but Fu Huai’an noticed her rejection and let go of her lips, breathing heavily.</p> <p>“Regretting it? Fu Huai’an asked.</p> <p>Two words and Lin Nuan subconsciously grabbed onto the fabric covering Fu Huai’an’s chest.</p> <p>Fu Huai’an’s attitude was clear; he did not force women. And as for lust… Lin Nuan was tasting it for the first time, but Fu Huai’an still appeared clear-headed enough to withdraw himself at any time, as though nothing had happened.</p> <p>She was afraid that it would happen—and afraid that it would not happen.</p> <p>Lin Nuan had forced herself into a dead-end. Her eyes reddened, and she lowered her head in silence.</p> <p>Did Fu Huai’an’s actions meant that he agreed to her replacing Gu Hanyan…</p> <p>Or… Lin Nuan had gifted herself to him, so he was calmly accepting it?</p> <p>Lin Nuan wanted to ask, but her sense of shame did not allow her to.</p> <p>“Don’t be nervous…” Fu Huai’an patiently comforted and coaxed her, his heavy breath sweeping across Lin Nuan’s lips. His sexy, hoarse voice comforted Lin Nuan’s uneasy and conflicted feelings.</p> <p>The sound of Fu Huai’an’s gentle voice right next to her ears inflamed her, and she tightly held onto his shirt to avoid having her body crumbling under him.</p> <p>…</p> <p>Lin Nuan had a dream. In the dream… Wen Moshen came back.</p> <p>Right at the front door of the Lin family’s house, he wore the suit he’d had on the day he left, his face smiling in that way Lin Nuan was most familiar with. He was thanking Lin Nuan… Thanking Lin Nuan for helping him defend the woman he loved.</p> <p>The wind was strong, blowing to the point where Lin Nuan couldn’t even hide her tears. She was smiling… but her heart hurt as though someone had cut off a large piece, and it was turning cold.</p> <p>She remained where she stood and sent Wen Moshen away with her eyes, seeing him set off to find the woman he loved deeply with a blissful look on his face…</p> <p>The sound of a shower reached her ears, and Lin Nuan slowly woke up.</p> <p>Unfamiliar bedroom, unfamiliar bed… The unfamiliar pillow was soaked with Lin Nuan’s tears.</p> <p>Fu Huai’an was showering in the bathroom; Lin Nuan sat up… looking at the mess of clothes on the floor, she didn’t know how she’d ended up with Fu Huai’an last night.</p> <p>Maybe it was his experienced ways that made Lin Nuan unable to resist, or maybe… maybe it was Lin Nuan’s stubbornness in loving Wen Moshen that gave her incredible courage.</p> <p>Lin Nuan got off the bed trembling, picking up the pajamas that didn’t belong to her and wrapped herself up firmly.</p> <p>At first, she wanted to take advantage of Fu Huai’an’s time in the shower to escape the crime scene, but she remembered that she hadn’t gotten a confirmation on whether he would give up his engagement with Gu Hanyan.</p> <p>Lin Nuan chose not to leave after some hesitation…</p> <p>Since it had already happened, why should she be scared to face it?</p> <p>…</p> <p>When Fu Huai’an came out of the shower, Lin Nuan had already tidied up the bed.</p> <p>Seeing Fu Huai’an, with his towel hung on his neck, she wanted to open her mouth but found it hard to speak.</p> <p>She heard the sound of a lighter, then Fu Huai’an asking, “Did Gu Hanyan look for you?”</p>",
  "Chapter 7: Give You A Present": "<p>Lin Nuan thought about last night. Perhaps Fu Huai’an had already seen them together, so she didn’t try to cover it up and nodded her head.</p> <p>Fu Huai’an walked to the window and said to Lin Nuan, “Come here…”</p> <p>Lin Nuan turned to look at him standing beside the floor-to-ceiling window and decided to walk over. Stopping next to Fu Huai’an, she looked up at him and eventually said, “You won’t force Gu Hanyan anymore, right?”</p> <p>After one night, Lin Nuan no longer spoke so politely to Fu Huai’an—it was a big improvement to Fu Huai’an who smiled at the change.</p> <p>Fu Huai’an’s black eyes were focused on a certain place outside the window as he reached out to pull Lin Nuan into his embrace.</p> <p>Shocked, Lin Nuan looked up to see Fu Huai’an’s hand gripping her shoulder, not knowing the reason behind his sudden move.</p> <p>“Do you see the white Passat on the right?” Fu Huai’an’s magnetic voice entered Lin Nuan’s ears, grazing her with his hot breath.</p> <p>Feeling embarrassed, Lin Nuan’s ears flushed red as she looked out the window to the right.</p> <p>“Gu Hanyan already had people watching you,” Fu Huai’an spoke calmly and without a care.</p> <p>Lin Nuan’s hands curled up, her face carrying awkwardness from having her weakness exposed, but she stubbornly insisted, saying, “I know…”</p> <p>Gu Hanyan was probably waiting for photos showing her and Fu Huai’an leaving the house together in the morning. With photos—with proof—then once Gu Hanyan blew the matter up, she would have enough reason and the higher ground to not marry Fu Huai’an.</p> <p>But Gu Huanyan never once considered Lin Nuan’s position.</p> <p>Asking from others then attempting to trap them, that method of handling things was indeed despicable.</p> <p>But… as long as Gu Hanyan was doing it for Wen Moshen, Lin Nuan would endure it.</p> <p>Since she had already reached that step, Lin Nuan suddenly gained the courage to ask, “Mr. Fu… Can I replace Gu Hanyan now?”</p> <p>“How do you wish to replace her…” Fu Huai’an didn’t let go of Lin Nuan’s shoulder.</p> <p>Fu Huai’an was an unsmiling man, yet at that moment he smiled at Lin Nuan, his dark eyes revealing an unreadable deepness as the golden morning light shone on them.</p> <p>“As Gu Hanyan wishes, or properly?”</p> <p>Fu Huai’an gave Lin Nuan the option to choose.</p> <p>For a woman like Lin Nuan who had such outstanding looks, no matter which man she stood with, she would still attract others.</p> <p>That was exactly what Gu Hanyan wanted to make use of.</p> <p>But Lin Nuan disliked how Gu Hanyan handled matters…</p> <p>Currently, Lin Nuan was still a child of the Lin family by name.</p> <p>Lin Nuan who had always followed the rules and became the model of a proper lady from a recognized family… If a scandal came out relating to her snatching away someone else’s fiancé, how could she face her parents who raised her?</p> <p>These were all matters that Gu Hanyan had never considered for Lin Nuan.</p> <p>Even before Fu Huai’an gave her the choice, Lin Nuan had never thought about herself.</p> <p>Since Gu Hanyan’s request had already been accomplished, why must Lin Nuan continue along the path that Gu Hanyan had arranged?</p> <p>Lin Nuan’s gaze remained fixed on the Passat as her lips parted, and she said, “Properly.”</p> <p>The corner of Fu Huai’an’s lips lifted up further, and he said, “Let me give you a present…”</p> <p>“Huh? Lin Nuan let out a sound of puzzlement.</p> <p>“Since you don’t wish to see Wen Moshen’s beloved woman marry other people, then I will let Wen Moshen’s woman be unable to marry anyone else from now on. She can just wait obediently for Wen Moshen.”</p> <p>What kind of present was that?</p> <p>Lin Nuan speculated with some meanness that it probably stemmed from the need to avenge his self-esteem as a man.</p> <p>Lin Nuan watched as Fu Huai’an turned around, removing his bathrobe to change his clothes. She turned back in a panic, then covered her awkwardness with a slight cough and said, “I’ll go back to the guest room first.”</p> <p>Just as Lin Nuan opened the door, she saw Auntie Li carrying a sleepy Tuan Tuan out of his room.</p> <p>Tuan Tuan was wearing one-piece pajamas with a cartoon bear theme. While clinging onto Auntie Li’s shoulder, the bear-shaped hood covered his small head. His small face, fair and soft, rested on Auntie Li’s shoulder, his right chubby cheek pressing down.</p>",
  "Chapter 8: Sit Beside Mama!": "<p>Early in the morning, Lin Nuan, coming out from the master bedroom as a guest… Even being seen by Auntie Li as well. It was indeed embarrassing.</p> <p>Lin Nuan gave a flustered smile, but before she could open her mouth to greet Auntie Li, Tuan Tuan’s’ previously sleepy eyes opened—really wide.</p> <p>He suddenly straightened his tiny back with excitement, and his watery eyes sparkled as he shouted, “Mama!”</p> <p>Even though she had already heard Tuan Tuan call her that many times, Lin Nuan still wasn’t used to it…</p> <p>Seeing Lin Nuan frozen on the spot, Tuan Tuan climbed down from Auntie Li using all four limbs, then ran cutely towards her… Like a little bear cub.</p> <p>Tuan Tuan had grown smarter—he didn’t hug Lin Nuan out of nowhere like he did last time. He knew that if he did, he would scare his Mama.</p> <p>Tuan Tuan simply stood at Lin Nuan’s feet, raising his head to stare longingly at Lin Nuan.</p> <p>Tuan Tuan was a very pretty little boy; his features were completely unlike Fu Huai’an’s. Tuan Tuan’s eyes were round and big, black and bright, unlike Fu Huai’an’s dark and long narrow eyes.</p> <p>The little boy standing in front of Lin Nuan had softer facial features… Delicate and adorable just like a little lady!</p> <p>Lin Nuan guessed that Tuan Tuan was probably more like his mother.</p> <p>“Uh… have you eaten breakfast?” Lin Nuan asked.</p> <p>Lacking experience interacting with children, Lin Nuan’s voice was dry and awkward. Facing a kid that called her Mama made Lin Nuan panic more than when she was interacting with Fu Huai’an.</p> <p>Tuan Tuan obediently shook his head.</p> <p>“Miss Lin, you can accompany Tuan Tuan to go and eat, breakfast is already prepared…” Auntie Li smiled as she spoke.</p> <p>Auntie Li had been taking care of Tuan Tuan for years, yet she had never seen Tuan Tuan’s mother.</p> <p>Ever since Tuan Tuan met Lin Nuan, he had firmly called her his mother, leading Auntie Li to have some suspicions. After seeing Lin Nuan come out from Fu Huai’an’s room today, in her heart, Auntie Li believed more firmly that Lin Nuan was Tuan Tuan’s mother.</p> <p>“Then… let’s go!” Lin Nuan said to Tuan Tuan.</p> <p>“En!” Tuan Tuan nodded his head furiously.</p> <p>Tuan Tuan didn’t dare to grab Lin Nuan’s hand, so he walked quickly beside her instead.</p> <p>While heading down the stairs, Lin Nuan reached out her fair hand to Tuan Tuan, causing his eyes to shine even more. He originally wanted to place his small hand onto Lin Nuan’s palm, but he was afraid that she would reject him… So he carefully held onto Lin Nuan’s index finger, grabbing it tightly with his warm fist. He looked up and smiled sweetly at her.</p> <p>Tuan Tuan had never felt so blissful. Papa said… Mama was the most beautiful person on Earth. Yes… His mother was the most beautiful person he had ever seen. Even her fingers were so pretty, exactly like his!</p> <p>Downstairs, at the dining table.</p> <p>Auntie Li was just about to place Tuan Tuan in his high chair, but he ran to Lin Nuan’s side. With his two chubby arms—one hand pressed onto the chair while the other held onto the edge of the table—he raised his legs to climb the chair with some effort and obediently sat next to Lin Nuan. He then placed both hands on his thighs in a well-behaved manner. He looked up at Lin Nuan who was pulling her chair out to sit down, just like a little pug cub trying to please its owner.</p> <p>Auntie Li smiled at the sight and asked in a gentle voice, “Does Tuan Tuan want to sit next to Miss Lin?”</p> <p>Tuan Tuan nodded his head hard and said, “En… Sit beside Mama!”</p> <p>Regarding being called Mama, Lin Nuan still wasn’t used to it…</p> <p>She had already reached a consensus with Fu Huai’an. She couldn’t deny it, yet she couldn’t accept it immediately. The corner of her lips lifted into an awkward smile.</p> <p>“Then… Tuan Tuan’s breakfast, I’ll bring it over to you…” said Auntie Li, whose smile grew increasingly bright.</p> <p>“En!” Tuan Tuan nodded his head.</p> <p>Lin Nuan sat down next to Tuan Tuan and watched him…</p>",
  "Chapter 9: In Haicheng… Everyone Knows": "<p>Auntie Li brought over Tuan Tuan’s nutritious breakfast and placed it in front of him. The dining table was too tall for Tuan Tuan—even if he used his hands to hold onto the edge of the table, he could barely peek over it.</p> <p>Lin Nuan passed the cup of milk to Tuan Tuan. He held the cup close to him and quickly finished the milk before turning to look at Lin Nuan with his bright and sparkling eyes.</p> <p>Tuan Tuan didn’t talk much, and he kept staring at Lin Nuan… as though he was afraid that once he started talking he would scare her away.</p> <p>Lin Nuan took the empty cup away from Tuan Tuan’s hands and picked up a bowl with a steamed egg.</p> <p>The bowl holding the egg was rather hot, so Lin Nuan didn’t pass it directly to Tuan Tuan. Instead, she picked up a spoon, picked up a spoonful, and passed it to Tuan Tuan’s mouth.</p> <p>Tuan Tuan was both surprised and nervous as he stretched his neck to take a bite. His chubby hand held tightly onto the table’s edge as he ate up the food Lin Nuan fed him in small mouthfuls.</p> <p>When Fu Huai’an came down the stairs, that scene was what he saw.</p> <p>Tuan Tuan, who wasn’t as high as the table, sat closely next to Lin Nuan. With both hands holding onto the table, he happily raised his head, waiting for Lin Nuan to feed him.</p> <p>Fu Huai’an buttoned up his sleeves as he calmly walked down the stairs.</p> <p>“Sir…” Auntie Li greeted Fu Huai’an.</p> <p>Fu Huai’an sat down. In order not to disturb the “family of three” eating their breakfast together in peace, Auntie Li retreated silently.</p> <p>“Papa!” Tuan Tuan happily called for Fu Huai’an.</p> <p>Fu Huai’an’s expression remained normal as he pulled out a chair to sit down. Picking up the newspaper Auntie Li left on the dining table, he calmly started reading, as though the scene happening in front of him was normal, and he was used to it.</p> <p>“This afternoon at four I’ll make a trip to the Lins and officially meet your parents. That way we can get the marriage certificate tomorrow morning. I’m going on an overseas business trip tomorrow night, and Auntie Li has something to settle at her house so she’ll be taking leave starting this afternoon. These few days while I’m overseas, I’ll leave it to you to take care of Tuan Tuan.”</p> <p>Fu Huai’an’s voice was neutral, and he arranged everything within a few sentences, clearly not giving Lin Nuan any room to object.</p> <p>Upon the mention of the Lin family, Lin Nuan paused in the middle of feeding Tuan Tuan his egg soup.</p> <p>Tuan Tuan opened his mouth but saw that Lin Nuan wasn’t passing him the egg soup. He didn’t complain; he only raised his head to look at Lin Nuan obediently.</p> <p>Fu Huai’an’s gaze never moved away from the newspaper, his voice calm as he said, “Your passport is still at the Lin household. If we want to get our marriage certificate, it’s unavoidable to visit the Lins.”</p> <p>Lin Nuan looked at Fu Huai’an’s profile and asked, “You investigated me?”</p> <p>Fu Huai’an gazed deeply at Lin Nuan and replied, “Haicheng… It’s not a secret here. Everyone knows about it.”</p> <p>Indeed, the people of Haicheng all knew.</p> <p>Lin Nuan was once a model lady of a known rich family, but she then became a fake lady everyone pitied.</p> <p>Everyone in Haicheng knew about Lin Nuan parents; a birth mother who was mentally ill and a selfish birth father.</p> <p>That year, Haicheng had an earthquake and the Lin family accidentally lost track of their newborn daughter. Father Lin thought that his daughter was already dead, but Mother Lin was unwilling to give up and kept searching.</p> <p>Lin Nuan’s birth mother gave birth to her daughter on the same day as Mrs. Lin. At the time of the incident, when Lin Nuan’s birth father rescued his own daughter from the baby shower room, he also rescued the little baby girl beside her.</p> <p>After three months, the Lin family finally found the couple that rescued their daughter. That couple was Lin Nuan’s birth parents.</p> <p>The Lin family felt extremely grateful for Lin Nuan’s birth parents and took back their daughter. Who would’ve thought that Lin Nuan’s birth father would send his own daughter to the Lins to let her live a wealthy life, while he kept the Lin family’s real daughter to suffer in poverty with them?</p>",
  "Chapter 10: Troubled on Both Ends": "<p>The fake lady who was wrongfully raised by the Lins for more than twenty years—once the real daughter of the Lins returned, her original position in the Lin family became extremely awkward. Furthermore, the ones who caused it were her birth parents.</p> <p>Mother Lin was unable to completely let go of the Lin Nuan whom she’d taken care of for over twenty years, but she also couldn’t ignore her birth daughter. So, on the one hand, she continued to care for Lin Nuan, and on the other, she tried to think of ways to make it up to her birth daughter, feeling troubled on both ends.</p> <p>But Lin Nuan knew what she had to do in that tough situation—the day the real daughter of the Lins returned, she found an excuse to move out of the Lin family’s home.</p> <p>After moving out, Mother Lin still came by often to give Lin Nuan good clothes and good food, but the Lin family’s house… Lin Nuan had never once returned.</p> <p>If Fu Huai’an was going to visit the Lins for his marriage with Lin Nuan, she would be frowned upon if she didn’t return with him.</p> <p>Lin Nuan originally wanted to ask Fu Huai’an whether he knew that her birth mother had a mental illness?</p> <p>Before she could open her mouth, Lin Nuan felt a warmth at the tip of her finger. When she looked down, she saw Tuan Tuan’s soft hand holding onto her.</p> <p>Children are sensitive—Tuan Tuan sensed Lin Nuan’s mood change and felt a little scared…</p> <p>Meeting Tuan Tuan’s bright black eyes, Lin Nuan forced down the words at the tip of her tongue and replied, “I know. Call me before you go, and I’ll… go there too.”</p> <p>After breakfast, Fu Huai’an left for the lawyer’s office, and Lin Nuan got ready to head for the radio station.</p> <p>Fu Huai’an had already dealt with the parked car near his house in the morning.</p> <p>Lin Nuan said she wanted it to be proper, so Fu Huai’an would definitely grant her wish.</p> <p>However, Auntie Li was taking a break in the afternoon, and Fu Huai’an had already left. Lin Nuan looked at Tuan Tuan who was sitting across from her, quietly staring at her with his big eyes. For a moment… Lin Nuan didn’t know what to do.</p> <p>She glanced at her wristwatch; it was almost 1 p.m. and she’d promised her colleague to help her cover the 1:30 p.m. radio program today. She couldn’t delay going to work anymore.</p> <p>After some pondering, Lin Nuan changed into her clothes—which Auntie Li had already washed and ironed—and brought Tuan Tuan with her to the radio station.</p> <p>…</p> <p>When Lin Nuan suddenly brought such a cute little boy to the radio station building, it attracted many adults into coming over to take a look.</p> <p>Tuan Tuan obediently sat on the couch, holding the cotton candy that Lin Nuan bought for him along the way. As he hugged the numerous snacks that Lin Nuan’s colleagues pushed onto him, he looked up at the crowd of uncles and aunties asking him endless questions. He looked adorable, like a cute little baby straight out of a comic.</p> <p>Lin Nuan’s good friend Bai Xiaonian sat inside the broadcasting room and watched the chubby Tuan Tuan through the glass window. She too was cooing over the boy’s cuteness and desperately wanted to go out and squeeze Tuan Tuan’s tiny face.</p> <p>After Bai Xiaonian tested the mic, she took off her headphones and leaned towards Lin Nuan, asking, “Nuan Nuan, where did you get such a cute baby from? He’s way too precious!”</p> <p>Lin Nuan took a look at Tuan Tuan, and for a moment she couldn’t answer; she couldn’t possibly just tell Bai Xiaonian the truth, right?</p> <p>“Hey, I’m asking you a question.”</p> <p>Getting no response from Lin Nuan, Bai Xiaonian elbowed her lightly.</p> <p>Bai Xiaonian was not a gossipy person, and she wasn’t someone who felt strong curiosity towards anything. However, Bai Xiaonian had been friends with Lin Nuan for more than ten years—she knew that Lin Nuan was in a difficult situation. She was afraid that Lin Nuan’s kindness would inadvertently bring some messy problems for herself.</p> <p>Lin Nuan glanced at the clock in the broadcasting room and replied, “I’ll tell you later after the program…”</p>",
  "Chapter 11: Don’t Lose Yourself to Money": "<p>The show began on time.</p> <p>Tuan Tuan put down the snacks in his hand and leaped off the sofa. He ran across the room to watch Lin Nuan and Bai Xiaonian through the transparent glass.</p> <p>“What splendid weather we have today—it’s raining cats and dogs! Yet ’tis the season of harvest, so my wife took leave from work to return home and harvest the wheat. So this noon, at the hour of ” Wandering in New York”, Nuan Nuan and I will be accompanying you.”</p> <p>Once the show began, Bai Xiaonian began teasing her partner that took leave.</p> <p>“A good afternoon to everyone! In this misty and cold weather, thank goodness Nuan Nuan is here to accompany you. Not cold, but warm—warm like my name, like 999 cough syrup, heating you folks up.”</p> <p>Bai Xiaonian’s show was supposed to be a light-hearted and funny one. Lin Nuan got into the zone pretty fast. Her self-deprecating humor even elicited a few heartfelt laughs from the phone editors outside.</p> <p>Bai Xiaonian laughed out loud. “Woah! The advertisers must be very pleased to have their advertisement put on the show!”</p> <p>“Looks like this is the advertiser funding your show; I’m literally sacrificing myself to serve you,” Lin Nuan commented with a smirk in her eyes.</p> <p>Tuan Tuan stared at Lin Nuan without blinking. It was the first time he noticed that Lin Nuan had a funny side to her. He envied that Bai Xiaonian sitting beside her; he wished his mother would smile at him like that.</p> <p>Bai Xiaonian noticed Tuan Tuan standing at the door peeking inside, his tiny hand pressed up against the glass. He was so tiny and petite, his clear beautiful eyes following Lin Nuan wherever she went, melting people’s hearts at the sight of him.</p> <p>“Wow, there are already comments left from Wei Bo’s friends…” Bai Xiaonian quickly resumed her work mode and read out loud in a light, bright tone, “<em>‘What a pleasant surprise, my Goddess Nuan actually came on this show!’ </em>And you, with your username “The Birdbrain Boss”, what’s your comment supposed to mean? Are you saying our show is low class? Nuan Nuan is without a doubt a ‘Ten’, but so am I… I’m half a ‘Ten’. Nuan Nuan, please do us some justice and kindly tell this classmate how sophisticated our show really is.”</p> <p>“Hmm….” Lin Nuan pretended to think deeply. “When I was entering the studio I overheard you chatting with my editor about me coming on the show. Ye Ye said that I must be out of my mind to come on a whimsical show like this, just to tear down my image.”</p> <p>“Well, Ye Ye… looks like you’ve lost your big raise for this month!” Bai Xiaonian joked as she laughed out loud.</p> <p>Behind the glass window, they saw Ye Ye stick out her tongue.</p> <p>“From how I see it, you should give me the big raise. After all, my image did get ruined after being on such a nonsensical show.”</p> <p>“May Goddess Nuan mind your cockiness—don’t lose yourself to money.” Bai Xiaonian and Lin Nuan continued to tease each other.</p> <p>Lin Nuan and Bai Xiaonian had a great rapport as partners, owing to the strong friendship they sustained over the years.</p> <p>The hour-long program finally came to an end. Lin Nuan said goodbye to their audience and made a date with them for the following evening at six, reminding them to listen to her own show. Afterward, Bai Xiaonian told her, “That kid… he stood at the door for almost an hour looking at you.”</p> <p>Lin Nuan looked up.</p> <p>As expected, Tuan Tuan was standing at the door, staring at her with his huge eyes.</p> <p>Lin Nuan removed her earpiece, got up and walked out of the room.</p> <p>Tuan Tuan looked up at Lin Nuan. He wanted to get closer to her, but he was still a bit apprehensive, so all he could do was offer a big sweet smile.</p> <p>In that instant, Lin Nuan felt sorry for the child who’d lost his mother—he was too young.</p> <p>Even though Lin Nuan wasn’t related to the Lin family by blood, she had truly been happy before she found out the truth.</p>",
  "Chapter 12: This Child Is Particularly Close to You": "<p>In the Lin Family, Lin Nuan’s mother had been utterly protective of her, to the extent that she had been literally sheltered like a delicate princess.</p> <p>Lin Nuan bent down and lifted Tuan Tuan up by his tiny little elbows, nestling him in her arms.</p> <p>She pondered what to do with him if she was going to go to the Lin Family that afternoon.</p> <p>Fu Huai’an might not trust anybody else to look after him. Otherwise, Bai Xiaonian could be a good candidate to take care of Tuan Tuan.</p> <p>However, the matter definitely needed to be discussed with Fu Huai’an before she could ask Bai Xiaonian for her help.</p> <p>Tuan Tuan was a bright kid. He could remember Fu Huai’an’s phone number quite clearly. In fact, he managed to recite both of his numbers when Lin Nuan asked him.</p> <p>Bai Xiaonian finished tidying up and took a look at the adorable pudding in Lin Nuan’s arms. She asked, “What’s the deal with this kid?”</p> <p>“Help me look after him for a bit, I need to make a call…” Lin Nuan looked at Tuan Tuan and said, “Stay with Aunt Bai for a while, okay?”</p> <p>“Don’t call me Aunt Bai.” Bai Xiaonian took Tuan Tuan into her arms and shamelessly brainwashed him. “Call me Sister.”</p> <p>“….” Lin Nuan was speechless.</p> <p>Bai Xiaonian took Tuan Tuan into the pantry to get something nice to eat while Lin Nuan walked into the stairway and called Fu Huai’an.</p> <p>When Lin Nuan told him about the situation, Fu Huai’an asked, “So where’s Tuan Tuan now?”</p> <p>“Tuan Tuan is with my friend,” Lin Nuan replied.</p> <p>Fu Huai’an was taken by surprise. Tuan Tuan had an odd personality—he usually wasn’t willing to stay around strangers.</p> <p><em>“Maybe he’s doing it to suck up to Lin Nuan?”</em></p> <p>Fu Huai’an inwardly let out a sigh. Tuan Tuan really did want Lin Nuan as a mother…</p> <p>“If you’re going to the Lins, I can pick you up at the radio station. I’ll hand Tuan Tuan over to my assistant who can babysit him for us.”</p> <p><em>“So he was unwilling to let someone else look after Tuan Tuan,” </em>Lin Nuan thought. She agreed. “Okay. Then what time are you coming to pick me up, Mr. Fu?”</p> <p>“Three-twenty.”</p> <p>He answered without hesitation.</p> <p>“Very well. I’ll be waiting for you downstairs with Tuan Tuan at three-twenty.”</p> <p>“Sure.”</p> <p>Fu Huai’an hung up the phone after giving a succinct response.</p> <p>Lin Nuan returned to the room and saw Tuan Tuan’s chubby, fair face surrounded by the station’s employees. No matter how hard they tried to tease him, he wouldn’t say a word.</p> <p>As soon as he saw Lin Nuan come in, Tuan Tuan leaped off the seat and ran towards her. He stopped himself short half a meter away to look up at her. His huge, innocent eyes radiated a spark reserved only for her.</p> <p>Lin Nuan found the cautiousness in his movements to be genuinely endearing.</p> <p>She bent over and caressed his tiny head, “Father will pick us up at three-twenty. Hey, I know an awesome ice-cream shop downstairs, how about we go get ourselves some ice cream before he gets here?”</p> <p>Tuan Tuan grinned like a Cheshire cat. He nodded furiously. “Yes!”</p> <p>Bai Xiaonian walked towards Tuan Tuan and said, “This kid seems particularly close to you.”</p> <p>Even though Tuan Tuan didn’t say anything, his behavior raised some suspicions regarding his relationship with Nuan Nuan.</p> <p>Lin Nuan’s reputation was already pretty bad at that point. As soon as Bai Xiaonian said that, it was a silent explanation to the crowd that there wasn’t much going on between the child and Lin Nuan.</p> <p>…</p> <p>The ice-cream shop was right downstairs.</p> <p>Tuan Tuan sat in a chair a tad higher than himself, holding the ice-cream bowl in one of his chubby hands while vigorously shoving spoonfuls of ice cream into his mouth with the other.</p>",
  "Chapter 13: A Marriage With Fu Huai’an?": "<p>Tuan Tuan saw the kid opposite their table splattering his face with ice-cream, his mother chuckling and wiping it off the corner of her little sweetheart’s mouth—his heart ached with longing at the scene.</p> <p>He took a peek at Lin Nuan and felt a sinking feeling inside… he, too, had ice cream splattered all over his face.</p> <p>When Tuan Tuan dropped his head to take another scoop of ice cream, a soft, slender finger suddenly grasped his head.</p> <p>He looked up and saw Lin Nuan wipe his mouth gently with a handkerchief.</p> <p>“Eat slower… look at the mess on your face.” Lin Nuan’s voice sounded so lovely, just like the first time he heard it on the radio station. It was so soft—soft enough to make people feel fuzzy inside.</p> <p>“Okay!” Tuan Tuan nodded. But he didn’t want to eat slower. He liked the way Lin Nuan gently wiped the corner of his mouth when he made a huge mess on his face. It felt like he was being lovingly adored by a mother.</p> <p>Bai Xiaonian sat across Lin Nuan and Tuan Tuan, chewing on her straw. She crossed her long, slender legs, a troubled expression written all over her face.</p> <p>“Are you really… going to marry Fu Huai’an?” Bai Xiaonian felt Lin Nuan’s decision was too rash.</p> <p>Lin Nuan nodded.</p> <p>Bai Xiaonian knew Lin Nuan was smart. She was sure that Lin Nuan knew that Gu Hanyan was just using her, but she was actually willing to let herself be used for Wen Moshen.</p> <p>“But what about your happiness?” Bai Xiaonian asked again, “And what about that dignified fiancé the Lin Family arranged for you?”</p> <p>“That was the fiancé they prepared for a daughter of the Lin family. Their legitimate daughters should be the ones marrying into the Gu Family—”</p> <p>Lin Nuan stopped herself mid-speech.</p> <p>Of course, the Gu Family wasn’t going to let a woman with a mentally disabled mother marry their only son.</p> <p>Bai Xiaonian knew Lin Nuan all too well. The real reason was that Lin Nuan had no feelings towards the young Sir from the Gu Family. If she did, she wouldn’t have managed to say all that so nonchalantly.</p> <p>“Is it all worth it then… just for Wen Moshen?” Bai Xiaonian asked, her beautiful eyebrows furrowing together. Obviously, she thought it wasn’t.</p> <p>Lin Nuan looked down and chuckled. “Even if it was, I still owe Moshen’s brother. Maybe he won’t hold a grudge anymore after this?”</p> <p>“Just keep lying to yourself.” Bai Xiaonian sighed.</p> <p>Lin Nuan’s head fell as she let out a faint laugh, a blank expression covering her face.</p> <p>Out of all people, how could Bai Xiaonian not be aware of Lin Nuan’s gratitude towards Wen Moshen?</p> <p>Yet it wasn’t Lin Nuan lying to herself. After all, it was her final warning to herself. She felt it was time to let go—let go of her past with Wen Moshen.</p> <p>At exactly three-twenty, Lin Nuan’s phone rang. Fu Huai’an was calling.</p> <p>“I need to go…” Lin Nuan grabbed her purse and glanced at Tuan Tuan who had already finished his ice-cream. “Tuan Tuan, let’s go. Your father is here.”</p> <p>“Okay!” Tuan Tuan nodded.</p> <p>Bai Xiaonian sat in the ice-cream shop, watching as Lin Nuan walked towards the black Bentley parked on the roadside, Tuan Tuan nestled in her arms.</p> <p>Under the sunlight, Fu Huai’an stood at the rear end of the car, his lips biting a cigarette. He stood there in his navy fitted suit, the top unbuttoned, revealing the white, neatly ironed shirt underneath. He didn’t wear a tie.</p> <p>His mannerisms exuded the sophistication and intellect of a cultivated alpha male, intimidating people at mere sight.</p> <p>Bai Xiaonian crossed her feet and rested her chin on her hand. She had to admit Fu Huai’an, and Lin Nuan looked like a great match.</p> <p>Bai Xiaonian had heard about Fu Huai’an. He was notoriously cold, especially towards women. So many of them had attempted to approach him upon hearing about his power in the lawyer world, yet they all received terrible ends.</p> <p>But why did Gu Hanyan turn down Fu Huai’an, a man with such credentials who was willing to marry her, and instead turned to Lin Nuan to ask for help?</p>",
  "Chapter 14: So You’re Willing to Come Back Now?": "<p>Bai Xiaonian would never believe that Gu Hanyan was waiting for Wen Moshen.</p> <p>A woman like Gu Hanyan knows exactly what she wants.</p> <p>She wasn’t Lin Nuan… and she definitely wouldn’t reserve herself for a man almost confirmed dead.</p> <p>Gu Hanyan’s act of devotion in front of Lin Nuan was merely to manipulate her love for Wen Moshen!</p> <p>Bai Xiaonian knew that even if Lin Nuan saw through it, she wouldn’t do anything about it.</p> <p>Wen Moshen had always been Lin Nuan’s weak spot.</p> <p>…</p> <p>As Fu Huai’an’s car reached the gates of the Lins’ mansion. Lin Nuan suddenly made his assistant park the car near the road.</p> <p>Lin Nuan turned and said to Fu Huai’an, “If I don’t say anything in advance to the Lin Family and just break the news that we’re getting married, my mother won’t be able to accept it. How about I go in first to lay some groundwork, then you can come in? I only need twenty minutes…”</p> <p>Lin Nuan talked it over with Fu Huai’an. After all, as a busy, influential figure in the lawyer world, his time was valuable.</p> <p>To her surprise, Fu Huai’an nodded.</p> <p>Lin Nuan thanked him, took her purse and alighted from the car.</p> <p>Taking a deep breath, she looked at the imposing black gates of the Lin Mansion.</p> <p>It was where she grew up. It all seemed so familiar, yet so distant.</p> <p>Before Lin Nuan could muster up the courage to walk up to the door and ring the doorbell, a car approached her from the side.</p> <p>“Nuan Nuan…”</p> <p>The driver seat’s window rolled down, revealing Lin Chen’s face.</p> <p>After the truth was revealed—that Lin Nuan wasn’t kin to the Lins—Lin Nuan was unwilling to see anyone else from the Lin Family besides her mother. The last time she saw Lin Chen was actually four years ago.</p> <p>Lin Chen got down from the car. He was still handsome and elegant like he was four years ago, but with an extra touch of maturity.</p> <p>Lin Chen was wearing a white shirt with a wide collar and a gray vest, and he looked quite exceptional. Perhaps the Lin Family was too busy that period, but his eyes were full of sleepiness. The moment he saw Lin Nan, it felt as if he’d entered a different world. He felt a gentle ache somewhere at the bottom of his heart.</p> <p>He still remembered the scene when Lin Nuan left the mansion with her luggage. She stood at the bottom of the staircase—he stood at the top—when she said, “Brother, if you still consider me as your sister, then don’t ever come to see me again. The same goes for everyone else in the Lin family. It would just feel like my heart got stabbed with a knife.”</p> <p>Because of that sentence, Lin Chen had visited her house so many times, but he would just sit in his car, anticipating the moment he could see her rushing back home from work.</p> <p>Lin Chen was unaware of how four years could change a person. He just felt Lin Chen grew slimmer, her delicate face as pale as a sheet.</p> <p>“Brother…” Lin Nuan unconsciously called out, her eyes watering and her nose turning red.</p> <p>Lin Chen stood in front of her with his slender, long legs, a scent of tobacco lingering on him…</p> <p>“So you’re willing to come back now?” Lin Chen fought back the lump in his throat and asked in a heavy voice.</p> <p>Lin Nuan tightened her grasp on her purse, the bitterness surging through her heart. She looked up at him with a pained expression, trying to suppress her emotions.</p> <p>The sun was shining on her face; the mist beneath her eyes dampened her long eyelashes. Lin Nuan looked down and said, “I brought home my fiancé to introduce to Mother…”</p>",
  "Chapter 15: It’s Either Me… or Her!": "<p>Lin Chen’s clenched his fists in his pants pockets. His long, bony fingers inadvertently let out a cracking sound. He immediately unclenched his fists, maintaining the calm composure in his enigmatic eyes. Smoothly concealing his emotions, he took the box of cigarettes out of his pocket.</p> <p>“Your fiance? Gu Shaoting?” Lin Chen pulled out a cigarette and bit onto it as he searched for a lighter on his body.</p> <p>Lin Nuan shook her head.</p> <p>Thinking about the man in the car still waiting for her, Lin Nuan knew that she only had about twenty minutes. Seeing that Lin Chen hadn’t found his lighter yet, she said, “Brother, let’s talk about it after we go inside. Let’s not stand outside…”</p> <p>Lin Chen stared at Lin Nuan in silence and removed the cigarette from his mouth. He just wanted to spend a little more time alone with Lin Nuan. But he lost his composure once he heard that Lin Nuan had brought home her… fiancé.</p> <p>“Come in…”</p> <p>Lin Chen honked the horn, and the gates of the Lins’ mansion slowly opened.</p> <p>Lin Chen drove all the way inside along their driveway and made a call back home. The butler picked up.</p> <p>Lin Chen broke the news that Lin Nuan had returned.</p> <p>The news set off an uproar in the Lin Family. Especially to Lin Ran, who was picking out a formal dress for her grandmother’s birthday celebration next month.</p> <p>There was no way that Lin Ran could treat her decently; not the woman who’d robbed her identity for so many years.</p> <p>“What’s she here for?” Lin Ran said with furrowed brows, feeling her anger rising inside like steam.</p> <p>Liang Mulan took a look at Lin Ran and held her small hand tightly. Her eyes began to water.</p> <p>She wanted to thoroughly persuade Lin Ran to accept Lin Nuan. Deep down, Liang Mulan still wanted Lin Nuan to come back home—even if it meant becoming a part of the family using another identity.</p> <p>Liang Mu Lan pleaded, “Ran Ran, please bear with it… for me. You need to know that both you and Nuan Nuan are children to me, I really—”</p> <p>“Mother, you have only one daughter. It’s either me… or her! If you want Lin Nuan to come back to play as your daughter, then I’ll leave! Think it over!”</p> <p>Lin Ran slammed the magazine on the table and stormed upstairs.</p> <p>“Ran Ran…” Liang Mulan called out as she stood up. Lin Ran didn’t turn back.</p> <p>Lin Ran fought back her tears. She was the illegitimate daughter of the Lins, not Lin Nuan! After wandering around from home for so many years, everyone should have cherished and loved her like a gem the moment she came back!</p> <p>But the brothers always reserved a cold attitude towards her, as if her arrival had broken the harmony of their family.</p> <p>Every single day, the only thing that elderly woman talked about was how she’d brought up Lin Nuan. When Lin Nuan was still in the Lin Family, all the socialites had tried to emulate her. Lin Ran should learn a bit more from her if she didn’t want to ruin the image of the Lins outside the family.</p> <p>As if Lin Ran didn’t hear the servants gossiping about her behind her back, saying that she came from a humble background. Despite being a blood-related daughter of the Lin Family, she couldn’t compete with Lin Nuan in terms of etiquette and elegance—she was the girl who was raised in the Lin Family since she was a child.</p> <p>For so many years the mere mention of Lin Nuan’s name was like a sharp knife that stabbed her in the heart. The moment anyone pressed on it, the blood just kept dripping—and it hurt like hell.</p> <p>Lin Ran hated Lin Nuan and her real parents… so much so that she wished she could tear them into pieces.</p> <p>…</p> <p>Lin Chen parked his car in place. Lin Nuan unbuckled her seatbelt and prepared to get off the car.</p> <p>“Nuan Nuan, have you considered that matter Mother mentioned when she visited you?” Lin Chen turned and looked at the beautiful curves of her side profile. He intentionally lowered his tone so she wouldn’t detect the tremor in his voice.</p> <p>Lin Nuan grabbed the handle of the car door and turned back to look at him…</p>",
  "Chapter 16: What Right Did She Have to Look Down on Fu Huai’An?": "<p>Lin Chen gazed deeply into her eyes.</p> <p>It required considerable courage from Lin Chen to say what he just did.</p> <p>Previously Liang Mulan had informed Lin Nuan that if she didn’t like Sir Gu from the Gu family, perhaps she could consider being with Lin Chen. Then everyone could be from the same family, and Lin Nuan would be her daughter, just…. by another identity.</p> <p>At that time, Lin Nuan assumed it was merely Liang Mulan’s wishful thinking since she was too protective of her.</p> <p>But hearing Lin Chen ask that very question, Lin Nuan felt genuinely startled.</p> <p>“We’ve lived together for so long as a family. We have the same habits, we know everything about each other…” As Lin Chen took his time to persuade her in his deep voice, Lin Nuan noticed he was hiding something behind his expression.</p> <p>“Brother…” Lin Nuan fell silent for a moment. “You don’t have to do this for Mother…”</p> <p>Lin Nuan didn’t know the right words to say in that situation—she never rehearsed beforehand in her heart. With a lump in her throat, she couldn’t utter a single word.</p> <p>Lin Chen’s gaze grew even more serious. He didn’t look one bit like he was joking, only calm and determined.</p> <p>Lin Nuan’s fluttering heart began to settle down. She replied, “Brother, I know you and Mother both have the same plan—to make me a member of the Lin Family. But you need to know that even though we aren’t related by blood, I’ve always seen Mother as my own mother, and you as my real brother. I… wouldn’t change that for anything in the world.”</p> <p>Lin Nuan was smart—she always was. And she made a perfect point.</p> <p>“If that’s the case, why won’t you come home? Hm?” Lin Chen tried to repress a flash of anger from his voice.</p> <p>“Because… it’s awkward,” Lin Nuan replied honestly, “Facing Lin Ran… It’s even more awkward.”</p> <p>The kind of awkwardness that felt terrifying…</p> <p>Without waiting for Lin Chen to reply, Lin Nuan put on an indifferent tone, “Brother, you definitely won’t imagine who I brought home to marry—it’s Fu Huai’an! Did you know, he’s got quite a reputation in the lawyer world.”</p> <p>Lin Chen couldn’t maintain a composed expression anymore. His eyebrows slowly knitted together.</p> <p>Since Lin Nuan was so eager to reveal the person she was marrying, it was evident to Lin Chen; she was determined to make it clear that she objected to marrying him.</p> <p><em>“Well, Fu Huai’an has a reputation that exceeds more than just the lawyer world, doesn’t he?”</em></p> <p>Fu Huai’an had kept a low profile for a whole year. Three years ago he suddenly appeared on Wall Street in America as a lawyer. His transformational business tactics left people in awe. Some predicted that he would come to control Wall Street in no longer than a year’s time, which had caused quite the commotion.</p> <p>When he returned to his homeland with his son, he stopped taking cases, leaving all lawyer-related matters to his partners to settle while he himself delved into high-risk investments. Nearly all the new trending projects in recent years were funded by him.</p> <p>Lin Chen recalled a commentary on Fu Huai’an written in the Economy Times. The passage elaborated considerably on Fu Huai’an’s adroit and fiercely accurate vision. Even Lin Chen had to admit it; he possessed a cunning intellect.</p> <p><em>“So Lin Nuan’s actually going to marry Fu Huai’an of all people?”</em></p> <p>A man with a child…</p> <p>Lin Chen’s forehead began to wrinkle like a raisin. How on earth did Lin Nuan come to know a man like Fu Huai’an?</p> <p>“Nuan Nuan, this man already has a kid,” Lin Chen said with pure anger written all over his face.</p> <p>Lin Nuan gave a faint laugh. ” And my own mother has a mental illness.”</p> <p>Her implication was that Fu Huai’an had never looked down on her, so what right did she have to look down on Fu Huai’an?</p> <p>Lin Chen really wanted to explain that he didn’t mind her having a mentally disabled mother. In fact, nobody in his family would ever look down on Lin Nuan.</p> <p>Of course… except for Lin Ran.</p> <p>However, Lin Nuan had already made it very clear that she saw Lin Chen as a brother—and nothing more.</p>",
  "Chapter 17: You Have an Engagement With the Gu Family": "<p>“Didn’t he already confirm his engagement with Gu Han?”</p> <p>Lin Nuan’s slender fingers tightened their grasp on her purse. She answered calmly, “It’s nothing but a rumor…”</p> <p>“How long have you known each other?”</p> <p>Lin Chen put in a lot of effort to make himself sound like a big brother.</p> <p>“Three or four months…” Lin Nuan answered honestly.</p> <p>Lin Chen began to heat up with anger. Lin Nuan was going to marry a man she had known for only three or four months? She was being too impulsive!</p> <p>“Do you understand what you’re doing?”</p> <p>As soon as Lin Chen finished his sentence, Liang Mulan had walked out of the mansion’s entrance.</p> <p>Liang Mulan fixed her shawl, her eyes focused on Lin Chen’s car, and she walked towards them briskly.</p> <p>“Mother is coming…” Lin Nuan said as she opens the door and exits the carriage.</p> <p>Liang Mulan had already spotted Lin Nuan from afar. Her eyes teared up, and she couldn’t help but quicken her steps.</p> <p>“Mother…” Lin Nuan called gently.</p> <p>Lin Chen looked down as he lit up a cigarette. He unbuckled his seatbelt and left the car unhurriedly.</p> <p>“Nuanuan….” Liang Mulan reached forward to grab Lin Nuan’s petite hand. She exclaimed in an accusatory yet relieved tone, “You’ve finally come back home?”</p> <p>Lin Nuan grinned and immediately got to the point, “I brought back the man I’m marrying so I can introduce him to Mother. We’re going to collect our marriage certificate tomorrow.”</p> <p>Lin Nuan’s news caught Liang Mulan off guard. She took a look at Lin Chen who just alighted from the car with a cigarette in his mouth. Liang Mulan grasped Lin Nuan’s petite hand tightly and said, “Follow me upstairs.”</p> <p>Liang Mulan was still acting like a mother in front of Lin Nuan—old habits died hard.</p> <p>Liang Mulan almost dragged Lin Nuan into her bedroom.</p> <p>Closing the door, Liang Mulan forced Lin Nuan to sit on the sofa and interrogated, ” Are you rushing to marry some random man… just because I told you to consider marrying your brother?”</p> <p>Liang Mulan had obviously misunderstood…</p> <p>She was afraid that the ridiculous idea she proposed—as a result of her fixation on Lin Nuan returning to the Lin Family—had prompted Lin Nuan to panic and find some random person to marry. Such a decision could lead to the biggest mistake of her life.</p> <p>Liang Mulan scolded her, “You foolish child! If you’re not willing, then it’s fine with me… Do you think I would ever force you to do it? I only thought of that messed up idea because I hoped it would get you to come back home! You can’t act recklessly just because you don’t agree with me! Aren’t you stabbing your mother in the heart right now?”</p> <p>Liang Mulan couldn’t hide the desperation and care in her eyes; it was a mother’s most raw affection towards her daughter.</p> <p>Lin Nuan’s eyes grew red. She was truly grateful towards Liang Mulan. Even after the brutal truth had been revealed, she still treated her as her own daughter.</p> <p>“Mother…” Lin Nuan took Liang Mulan’s hand, her voice choked with emotion.</p> <p>Liang Mulan wiped away the tears in her eyes and wrapped her arms around Lin Nuan. She made a futile attempt to hold back from crying.</p> <p>Liang Mulan’s voice was hoarse as well, “Even if you aren’t my own flesh and blood, I did raise you since you were a child. All I ever wanted was for the person you married to treat you properly. That way you can truly be happy. I think I messed up there—I actually came up with an idea that ridiculous to keep you by my side… Alright, my dear. Don’t worry, I won’t mention it again. You still have an engagement with the Gu Family, and as long as your father and I are here, the Gu Family won’t dare to break it off. But you’d better promise me you won’t keep up this recklessness outside! Otherwise, I won’t be able to take it…”</p> <p>Outside the bedroom door, Lin Ran silently listened to their heartfelt conversation. Her whole body ached as if she’d been thrown into a meat grinder, crushed into pieces.</p> <p>Lin Ran was Liang Mulan’s real flesh and blood, but as long as Lin Nuan was here, she was treated like some kid she picked up from the streets?!</p>",
  "Chapter 18: It Was That Simple?": "<p>Liang Mulan was well aware that Lin Ran liked Gu Shaoting. In fact, she had told Liang Mulan herself!</p> <p>She had wholeheartedly believed that if the Lins were to marry into the Gu Family, a daughter from the Lin family would be appropriate. After she began to develop feelings towards Gu Shaoting, Lin Ran naturally saw herself as his fiancée. And… Liang Muran had given what rightfully belonged to her—the engagement—to Lin Nuan?!</p> <p>On what basis?</p> <p>Lin Ran’s fingers coiled from the intensity of her seething fury.</p> <p>She turned around to quickly leave. Yet as soon as she reached the staircase, she suddenly stopped and stood still.</p> <p>Why should she be the one leaving? She’s the one who belongs to the Lin Family! She wasn’t intimidated by Lin Nuan. So in what universe did she have to leave inside her own territory?</p> <p>Lin Nuan finally managed to calm down Liang Mulan. She told her that the man she was marrying was waiting right outside and that her only agenda today was to bring him back home to meet her. Liang Mulan finally stopped crying…</p> <p>Liang Mulan wiped the tears away from the corners of her eyes with her already damp handkerchief. With furrowed eyebrows, she said in frustration, “Why didn’t you say so earlier? Look at my ruined makeup—how on earth am I presentable now?”</p> <p>Lin Nuan laughed gently. “No matter what, you still look beautiful.”</p> <p>The mother and daughter seemed to have returned to their former intimacy. It was the first time Lin Nuan said something flattering and playful to Liang Mulan after she had left home.</p> <p>The guest had already reached the door. It was better not to keep Fu Huai’an waiting outside.</p> <p>Liang Mulan didn’t ask any more about her fiancé. She urged Lin Nuan to invite him inside.</p> <p>Lin Nuan came out of the room and saw Lin Ran standing nearby with arms folded, as if she were waiting for her.</p> <p>“Lin Nuan, oh wait… that’s not right. I should be calling you, Lu Nuan?” Lin Ran said mockingly, her tone cold and sarcastic.</p> <p>Lin Nuan actually understood how she felt. In Lin Ran’s eyes, Lin Nuan was merely a thief, stealing the life that had always belonged to her.</p> <p>Lin Ran had always felt that if the Lin Family had raised her, she would definitely outshine Lin Nuan—instead of being mocked behind her back as a hillbilly who came from an unknown place.</p> <p>As they stared at each other, Lin Nuan’s gaze was much gentler and calmer in nature.</p> <p>Lin Nuan felt very apologetic towards Lin Ran. She said, “My identity card is still here in the Lin Family’s home. I returned today just to retrieve it so I can collect my marriage certificate. If you don’t want to see me again, I won’t ever come back.”</p> <p>Lin Ran clenched her fists. In that instant, her nerves were on edge, and her body shook slightly as she asked, “Your marriage certificate…? With who? Gu Shaoting?”</p> <p>Lin Nuan shook her head and apologized, “I’ve always wanted to apologize to you. I’m the one who stole twenty years of the life that belonged to you.”</p> <p>Lin Nuan’s voice was clear, sincere, and soft. These few words stunned Lin Ran on the spot.</p> <p>She probably didn’t expect Lin Nuan to apologize, since it wasn’t even her fault in the first place.</p> <p>The fault… lied with Lin Nuan’s real parents.</p> <p>Lin Ran cleared her throat as she steadily approached Lin Nuan, lowering her voice to say, “Since you feel sorry and you know… that you stole a life that didn’t belong to you for so many years, then please stay away from my home… and my family. Especially my mother.”</p> <p>Lin Ran was trying to assert her power here, but her eyes ended up watering. She was basically a child, afraid that her own family was being robbed away.</p> <p>She never was a cunning nor manipulative person by nature. To say something stern like that only revealed how unsettled she was inside.</p> <p>Lin Nuan felt a piercing pain from the bottom of her heart. To avoid complicating things between Liang Mulan and her real daughter, she nodded.</p> <p>“Very well…” Lin Nuan agreed to Lin Ran solemnly. “After I collect that certificate, I’ll cut all ties with the Lin Family for good.”</p> <p>It was that simple?</p> <p>Lin Ran was silently shaking inside.</p>",
  "Chapter 19: A Long-Term Strategy": "<p>She didn’t expect Lin Nuan to agree so readily.</p> <p>By right, a dynasty like the Lin Family should be one that Lin Nuan would never want to leave. In fact, she should be grasping onto her mother for any opportunity to stay.</p> <p>Lin Ran even saw Lin Nuan’s departure that year as a long-term strategy. She was retreating for the sake of advancing.</p> <p>“What game are you trying to play now?” Lin Ran narrowed her eyes, sizing Lin Nuan up defensively.</p> <p>Without waiting for Lin Nuan’s response, Lin Ran looked at Lin Nuan as if she had suddenly reached a grand enlightenment, “So you do want to marry Lin Chen! You want to get back into the Lin Family this way? Oh, Lin Nuan… after living with Lin Chen as brother and sister for twenty years, you actually came up with such an indecent idea…”</p> <p>“Lin Ran!”</p> <p>A deep voice called out from behind Lin Ran.</p> <p>An indecent idea…</p> <p>It insulted both Liang Mulan and Lin Chen, not just Lin Nuan.</p> <p>Lin Ran straightened up stiffly before turning back to look at Lin Chen.</p> <p>Lin Chen’s tall figure was standing by the staircase, his hands in the pockets of his pants that covered his long, slender legs. He glanced towards Lin Ran with a piercing coldness and with repressed anger in his features—his presence was thoroughly intimidating.</p> <p>“No matter when or where Lin Nuan will forever be a part of this family. Nobody can change that.”</p> <p>Lin Chen’s imposing presence left Lin Ran somewhat cowed. That was the first time she’d seen Lin Chen with such a grim look on his face. She bit her lip, not daring to respond back.</p> <p>“My fiancé is still outside. I’ll go invite him inside first.”</p> <p>Lin Nuan said matter-of-factly and went downstairs, brushing shoulders with Lin Chen.</p> <p>Lin Chen stood there watching Lin Nuan’s figure disappear downstairs. The veins in his clenched fists began to pop as he fixed his gaze on Lin Ran.</p> <p>“You’re a part of this family, but so is Lin Nuan…” Lin Chen said in a heavy tone, “I think that Father and Mother just wanted to see the two of you get along like sisters.”</p> <p>“I—”</p> <p>“Even if you can’t manage to do that, there’s no need to be that cruel.”</p> <p>Lin Chen didn’t even give Lin Ran the chance to reply.</p> <p>Lin Ran stood there completely mute, her face drained of color. She had always respected and somewhat feared her big brother Lin Chen.</p> <p>And after hearing such harsh feedback coming from him, Lin Ran couldn’t hold back her tears.</p> <p>“If this family didn’t want to welcome me, you shouldn’t have let me come back in the first place!” Lin Ran cried as she ran back to her room, slamming the door shut.</p> <p>Liang Mulan heard the commotion and came out of her room. She saw Lin Chen standing at the staircase and asked, “What’s the matter?”</p> <p>“Baby Ran is throwing a tantrum at me…” Lin Chen answered blankly.</p> <p>Liang Mulan knew it was because Lin Nuan had come back.</p> <p>“Baby Chen, Ran Ran…”</p> <p>“Mother, you don’t need to explain, I get it,” Lin Chen interrupted her and glanced at his watch, “I need to go.”</p> <p>“Baby Chen, Nuan Nuan brought back her fiancé—check him out for me.”</p> <p>Liang Mulan was somewhat nervous. When a daughter brought her fiance back home for ‘inspection’, that was always the case.</p> <p>“I just came home to copy a document. There’s still a meeting in the office, so I have to leave first…”</p> <p>Lin Chen concealed his sentiments well within his deep eyes. He had always been a composed and unpredictable man. Even his own mother and his father sometimes felt distant from their son.</p> <p>When Lin Chen came downstairs, he spotted Lin Nuan in the living room making a phone call to Fu Huai’an, her back facing him. Lin Chen took a long glance at her slender, tall figure, and left the mansion without a word. Standing outside the front door, he lit up a cigarette.</p>",
  "Chapter 20: What Lin Nuan Said to Fu Huai’an": "<p>Lin Chen’s sharp and defined features were enveloped in the swirling smoke. His mood was very complicated. He gazed into the far distance as he fell into deep contemplation.</p> <p>Lin Nuan had always been an exceptional sister to Lin Chen, and he was fiercely protective of her from the bottom of his heart.</p> <p>Yet at some point, the protectiveness changed in nature—Lin Chen himself was unaware of it.</p> <p>When Liang Mulan approached Lin Chen and proposed the idea of having Lin Nuan marry him to get her to return home, Lin Chen felt something stirring in his still heart.</p> <p>And that tiny hint of sentiment terrified Lin Chen.</p> <p>No matter what, Lin Nuan was his sister—she had been for twenty years.</p> <p>Liang Mulan’s plan made Lin Chen realize that he had feelings for his own sister; feelings that transcended more than just familial love.</p> <p>Lin Chen, however, had never focused on nor invested in romance.</p> <p>His job was his sole priority. He always believed he was going to marry a woman that would ultimately benefit the Lin Family. She didn’t need to excel in looks nor abilities, as long as she was willing to settle down and do her job.</p> <p>Evidently, Liang Mulan’s words had kindled certain feelings in his heart.</p> <p>Without finishing his cigarette, Lin Chen saw the large black iron gates of the Lin Family slowly open, letting in a black Bentley.</p> <p>Lin Chen bit the cigarette with the corner of his mouth, fixed his suit and glanced at the car through the smoke with narrowed eyes.</p> <p>Fu Huai’an…</p> <p>They say that he was a monster, and his name set people trembling in the lawyer world. There wasn’t a case he couldn’t crack, even if there was clear-cut evidence on the table. He always had a solution.</p> <p>After going undercover for three years, he stopped taking cases, no matter the price offered. Instead, he began to make a name for himself on Wall Street.</p> <p>After Fu Huai’an returned to his homeland, the Jiang Family suddenly announced they were bankrupt before anyone could comprehend the situation. There were outside speculations that it was Fu Huai’an’s handiwork. After all, he was the legitimate son of Jiang Chengyuan—the CEO of the Jiang Cooperation. He crushed the Jiang cooperation to avenge his mother.</p> <p>Even a man as proud as Lin Chen had to admit, Fu Huai’an could do whatever he wanted and get away with it. Everything he touched turned into gold. Effortlessly.</p> <p>Lin Chen mumbled Fu Huai’an’s name in his heart…</p> <p>Upon hearing Lin Nuan’s approaching footsteps, Lin Chen put out his cigarette in the pot next to the door and leisurely walked towards his car.</p> <p>Lin Chen was already in his car by the time Lin Nuan walked out of the house.</p> <p>Through the glass window, he took one look at her standing in the sunset.</p> <p>The sun was blazingly bright after the rain. With her whole figure enveloped in a golden haze, Lin Nuan appeared like an angel caught between the clear sky and earth.</p> <p>Lin Nuan held her phone in one hand and flipped her hair behind her ear, the strands tangled from the wind. Her dark, hauntingly beautiful eyes gazed at the car approaching from the distance. She didn’t display the uneasiness or nervousness that a girl bringing home her boyfriend should have.</p> <p>After a long while, Lin Chen broke off his gaze and started the engine.</p> <p>Lin Chen and Fu Huai’an’s cars passed each other. Glancing into the rearview mirror, he spotted the tall figure alight from the car and stand before Lin Nuan. She looked up and said something to him…</p> <p>…</p> <p>Fu Huai’an sat in the European-styled sofa in the Lins’ living room. His refined features radiated a composed, unfathomable demeanor and a magnetic presence.</p> <p>From his appearance and demeanor to his mysterious background, Fu Huai’an was admittedly a man of considerable charm.</p> <p>At the age of thirty, he was already a man of authority and power, one that maintained a low yet wealthy profile. He was quite the man—ripe like fine wine while commanding an alpha male’s presence. Even a woman at Liang Mulan’s age would take one look and feel her heart skip a beat, let alone a girl like Lin Nuan who had barely set foot into society and was as spotless as a sheet of paper.</p> <p>Liang Mulan observed Fu Huai’an’s mannerisms as he raised his cup and sipped his tea. She couldn’t help but mirror his movements and take a sip of her own.</p> <p>The elegance in Liang Mulan’s composure emanated from her bones. Lin Nuan’s decorous gestures were jointly influenced and molded by Liang Mulan herself.</p>",
  "Chapter 21: The Speculations": "<p>“If I may ask, Mr. Fu… is this going to be your second marriage? Because you already have a son, unless…” Liang Mulan felt that she had to ask that difficult question for the sake of her daughter’s happiness.</p> <p>Fu Huai’an looked up, the calmness in his expression not changing one bit. He replied, “Since you are Lin Nuan’s mother, and I am marrying Lin Nuan, I should tell you the honest truth about the child. Tuan Tuan was a child who my friend asked me to take care of—before he passed away.</p> <p>It took Lin Nuan by surprise.</p> <p>Fu Huai’an didn’t say any more than he needed. Lin Nan guessed that Fu Huai’an didn’t want the child to think he was an orphan, so he took up the role of his father.</p> <p>Liang Mulan was also visibly shocked. Ever since Fu Huai’an had brought back a child, there were so many outside speculations…</p> <p>Some had theorized that Fu Huai’an had gotten married then divorced overseas, and brought back a child!</p> <p>The nastier rumors were that the child was born out of wedlock.</p> <p>An old wound caused by the death of a friend was not one Liang Mulan should reopen. She apologized and contemplated whether Fu Huai’an’s words were truthful. But there was no way she could see through his unfathomable eyes.</p> <p>It was the first time Fu Huai’an revealed Tuan Tuan’s background.</p> <p>It was an open gesture to Liang Mulan to prove his sincerity to marry Lin Nuan.</p> <p>“So are you aware of Nuan Nuan’s past?” Liang Mulan asked.</p> <p>Liang Mulan meant Lin Nuan’s family background. She wanted to know if Fu Huai’an knew about Lin Nuan’s mentally disabled mother and whether he considered it to be an issue like the Gu Family did.</p> <p>Four years ago, Lin Nuan’s life experienced a transformational change. Her real father visited her with Lin Ran out of the blue. After revealing the background of the two kids, he committed suicide by ingesting poison. Fu Huai’an knew all about it.</p> <p>Fu Huai’an said, “Yes. I know everything about Lin Nuan’s background and her real parents. Everything…”</p> <p>Liang Mulan gripped the teacup tightly in her hand. She looked into Fu Huai’an’s deep eyes and said, ” Nuan Nuan even told you about this.”</p> <p>Fu Huai’an couldn’t deny it. Lin Nuan, however, felt uneasy since she had never lied to Liang Mulan even as a kid. Suddenly she had no choice but to play along.</p> <p>That afternoon, Liang Mulan discussed some trivial matters with Fu Huai’an. Fu Huai’an was an eloquent conversationalist and he composed himself well. Furthermore, he didn’t mind Lin Nuan’s background.</p> <p>Besides the fact that he had a child, he seemed flawless to Fu Huai’an—she even developed a certain fondness and appreciation towards him.</p> <p>She just found it hasty of them to collect the marriage certificate the very next day. However it was Lin Nuan’s choice of husband, and Liang Mulan had no right to prevent them from doing so.</p> <p>After sending off Fu Huai’an, Lin Nan left the Lins after retrieving her identity card.</p> <p>She felt a sense of relief as she sat inside the cab, watching the picturesque scenery outside through the window.</p> <p>Upon collecting the marriage certificate, she thought Liang Mulan would have nothing to say if she used the marriage as the reason to remove herself from the identity card…</p> <p>If she still kept her ties with the Lins it would be unfair to Lin Ran…</p> <p>But how could she abandon the true bond she had with the Lin parents and brother just like that?</p> <p>…</p> <p>That evening, Lin Nuan took a shower once she reached home. Once she came out, she saw a few missed calls on her phone.</p> <p>Lin Nuan returned the calls as soon as she realized it was her landlord’s number.</p> <p>The landlord called to negotiate with her on the rising rent—right after Lin Nuan had just paid the next installment.</p> <p>Lin Nuan’s landlord was a lady from the south. Her voice was soothing and pleasant, yet there was a non-negotiable edge to her words.</p> <p>Lin Nuan paused for a while. Her eyes fell on the identity card under her table lamp.</p>",
  "Chapter 22: Lin Nuan Knew Better Than Anyone": "<p>Lin Nuan and Fu Huai’an were going to collect their marriage certificate the next day. Fu Huai’an’s intention was for her to look after Tuan Tuan.</p> <p>Then where was she supposed to stay—here or in Fu Huai’an’s home? She hadn’t thought it through before this.</p> <p>If she called Fu Huai’an right then to clarify the matter it would seem as if she were rushing into things.</p> <p>At the other end of the line, her landlord said in a soft voice, “I do like you—you keep such a tidy and comfy place. I can really trust you with my house. It’s just the inflation getting out of control and I still need to cover my costs. So think it through. Our contract will expire in two months. If you think the price is acceptable for you we’ll choose a date to extend it. Is that okay with you?”</p> <p>Lin Nuan didn’t think it was unreasonable for the landlord to raise the rent. She wasn’t going to raise it until the contract expired, and she expected to extend it and continue raising the price—yet Lin Nuan could still understand.</p> <p>It would indeed be more convenient for Lin Nuan to stay here since it was closer to the station.</p> <p>After Lin Nuan hung up the phone, she dug up the contract. Before she could take a closer look at it, her doorbell rang.</p> <p>Lin Nuan glanced at her watch. At nine-forty, the only person visiting her would be Bai Xiaonian.</p> <p>Without putting on a jacket, she opened the door in her nightgown, a towel strapped around her neck.</p> <p>A guy in a vest stood outside the door. He wasn’t too tall so it had been quite tiring for him to carry Bai Xiaonian on his back.</p> <p>He was silently taken aback at the sight of Lin Nuan’s thin clothing and her overly defined features.</p> <p>The strands of hair left on her face were not yet dry as the drops of water streamed down her beautiful cheeks. The droplets adhered to her smooth, white skin, her swan-like neck, and rested on her attractive collarbones.</p> <p>The aroma left from a fresh bath smelled so nice to him. He unconsciously averted his eyes, yet they couldn’t help falling on her long slender legs. His face turned even redder then when he first met Bai Xiaonian.</p> <p>“Um… I’m the driver your friend called. She drank too much and nagged me to send her here…”</p> <p>Lin Nuan hadn’t expected to see a driver at the door. She instantly regretted opening the door in her current attire. Turning around to snatch the hoodie lying on her shoe shelf, she hurriedly slipped it on and kept a straight face. She then reached out to take Bai Xiaonian from his hands and said, “Thank you… leave it to me.”</p> <p>Lin Nuan knew better than anyone what Bai Xiaonian was like when she got drunk.</p> <p>The guy tried to support Bai Xiaonian while awkwardly maintaining some distance from her so she couldn’t take advantage of him. His movements were as awkward as they could be.</p> <p>Lin Nuan supported the hammered Bai Xiaonian with her right arm. Before the guy could loosen her left one, Bai Xiaonian lifted up her head.</p> <p>“Heh heh… Nuan Nuan…” Bai Xiaonian hooked the guy towards her with her left arm and pinched his face with her pretty and long fingers. Her speech was slurred as she mumbled, “Look at the tiny little bunny I caught today—isn’t he adorable?”</p> <p>“Ouch…” He was almost in tears from the pain.</p> <p>“…” Lin Nuan was speechless.</p> <p>How much did Bai Xiaonian drink to reach this state?</p> <p>“I’m so sorry. My friend always acts this way when she drinks too much…” Lin Nuan apologized as she forcefully peeled Bai Xiaonian off of the guy’s body.</p>"
}